[
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Utilities",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Bitmoji is your own personal emoji.• Create an expressive cartoon avatar• Choose from a huge library of stickers – all featuring YOU• Use Bitmoji in Snapchat, iMessage and wherever else you chatUsing Bitmoji in Snapchat unlocks friendmoji – 2-person bitmojis featuring you and your friends!",
    "In App Purchases": "No",
    "Name": "Bitmoji - Your Personal Emoji",
    "Number of Reviews (All Time)": "36882",
    "Number of Reviews (Current Versions) ": "348",
    "Overall Rating": "4.5",
    "Rank": "1",
    "Rating of Current Version": "3.5",
    "Release": "Mar 06, 2017",
    "Seller": "Bitstrips Inc.",
    "Size": " 80.9 MB",
    "Version": "10.3"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Sports",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Bitmoji is your own personal emoji.• Create an expressive cartoon avatar• Choose from a huge library of stickers – all featuring YOU• Use Bitmoji in Snapchat, iMessage and wherever else you chatUsing Bitmoji in Snapchat unlocks friendmoji – 2-person bitmojis featuring you and your friends!",
    "In App Purchases": "No",
    "Name": "NCAA March Madness Live - Men's College Basketball",
    "Number of Reviews (All Time)": "36882",
    "Number of Reviews (Current Versions) ": "348",
    "Overall Rating": "4.5",
    "Rank": "2",
    "Rating of Current Version": "3.5",
    "Release": "Mar 06, 2017",
    "Seller": "Bitstrips Inc.",
    "Size": " 80.9 MB",
    "Version": "10.3"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Photo & Video",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Life's more fun when you live in the moment :) Happy Snapping!* * *Please note: Snapchatters can always capture or save your messages, such as by taking a screenshot or using a camera. Be mindful of what you Snap!",
    "In App Purchases": "No",
    "Name": "Snapchat",
    "Number of Reviews (All Time)": "306333",
    "Number of Reviews (Current Versions) ": "97",
    "Overall Rating": "2.5",
    "Rank": "3",
    "Rating of Current Version": "3.5",
    "Release": "Mar 20, 2017",
    "Seller": "Snap, Inc.",
    "Size": " 191 MB",
    "Version": "10.4.2.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Photo & Video",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Life's more fun when you live in the moment :) Happy Snapping!* * *Please note: Snapchatters can always capture or save your messages, such as by taking a screenshot or using a camera. Be mindful of what you Snap!",
    "In App Purchases": "No",
    "Name": "Instagram",
    "Number of Reviews (All Time)": "306333",
    "Number of Reviews (Current Versions) ": "97",
    "Overall Rating": "2.5",
    "Rank": "4",
    "Rating of Current Version": "3.5",
    "Release": "Mar 20, 2017",
    "Seller": "Snap, Inc.",
    "Size": " 191 MB",
    "Version": "10.4.2.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Social Networking",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Instantly reach the people in your life—for free. Messenger is just like texting, but you don't have to pay for every message (it works with your data plan). Not just for Facebook friends: Message people in your phone book and just enter a phone number to add a new contact.Group chats: Create groups for the people you message most. Name them, set group photos and keep them all in one place.Photos and videos: Shoot videos and snap selfies or other photos right from the app and send them with one tap.Free calls: Talk as long as you want, even with people in other countries. (Calls are free over Wi-Fi. Otherwise, standard data charges apply.)Even more ways to message: Bring your conversations to life with stickers. Preview your camera roll photos and videos without leaving the conversation--then choose the perfect ones to send.Record voice messages when you have more to say.Extra features:Know when people have seen your messages.Forward messages or photos to people who weren't in the conversation.Search for people and groups to quickly get back to them.Turn on location to let people know when you're nearby.See who's available on Messenger and who's active on Facebook. Turn off notifications when you're working, sleeping or just need a break.Stay logged in so you never miss a message.Continued use of GPS running in the background can dramatically decrease battery life. Messenger uses location data to make features work, help people connect and more.",
    "In App Purchases": "No",
    "Name": "Messenger",
    "Number of Reviews (All Time)": "345056",
    "Number of Reviews (Current Versions) ": "461",
    "Overall Rating": "3",
    "Rank": "5",
    "Rating of Current Version": "2",
    "Release": "Mar 17, 2017",
    "Seller": "Information Not Available",
    "Size": " 265 MB",
    "Version": "109.2"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Navigation",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Google Maps makes navigating your world faster and easier. Find the best places in town and the information you need to get there.Get there faster with real-time updates• Beat traffic with real-time ETAs and traffic conditions• Catch your bus, train, or ride-share with real-time transit info• Save time with automatic re-routing based on live traffic, incidents, and road closures• Don't miss a turn or exit with lane guidance• Find pit stops along your route like gas stations and coffee spotsDiscover places and explore like a local• Find top-rated restaurants and local businesses, wherever you are• Decide on the best places to go with reviews, ratings, and pictures of foods and interiors• Plan your visit and see menus, make reservations, and find when places are typically busiest• Help others discover the best places by sharing reviews, photos and more• Save places you want to or often visit, and quickly find them later from any computer or deviceExperience the Google Maps difference• Offline maps to search and navigate without an internet connection• Street View and indoor imagery for restaurants, shops, museums and more• Indoor maps to quickly find your way inside big places like airports, malls and stadiums• Comprehensive, accurate maps in 220 countries and territories• Transit schedules and maps for over 15,000 cities• Detailed business information on over 100 million places* Some features not available in all countries**Continued use of GPS running in the background can dramatically decrease battery life.",
    "In App Purchases": "No",
    "Name": "Google Maps - Navigation & Transit",
    "Number of Reviews (All Time)": "151063",
    "Number of Reviews (Current Versions) ": "1302",
    "Overall Rating": "4.5",
    "Rank": "6",
    "Rating of Current Version": "4",
    "Release": "Feb 28, 2017",
    "Seller": "Information Not Available",
    "Size": " 102 MB",
    "Version": "4.28.1"
  },
  {
    "Age Restriction": "You must be at least 17 years old to download this app.",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get the official YouTube app for iPhone and iPad.See what the world is watching in music, gaming, entertainment, news and more. Subscribe to channels, share with friends, edit and upload videos, and watch on any device.You can also create playlists, check out what’s trending, express yourself with comments, share videos with friends, cast a video to your TV, and more – all from inside the app.FIND VIDEOS YOU LOVE FAST- Browse personal recommendations on the home tab- See the latest from the creators you follow on the subscriptions tab- Discover the world’s hottest videos on the trending tab- Look up videos you watched or liked on the library tabCONNECT AND SHARE- Let people know how you feel with likes, comments, or shares- Create, edit, add filters or music, and upload your own videos all inside the appGet 1 month of YouTube Red for free. Existing YouTube Red or Google Play Music members and users of either service who have already received this 30 day trial are not eligible. Monthly charges apply for YouTube Red membership outside of trial periods.If you subscribe via iTunes:Payment will be charged to iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period. Account will be charged for renewal within 24 hours prior to the end of the current period at the rate of the selected plan. Subscriptions and auto-renewal may be managed  by going to Account Settings after purchaseAny unused portion of a free trial period will be forfeited when purchasing a subscription.YouTube paid service terms: https://www.youtube.com/t/terms_paidservicePrivacy policy: https://www.google.com/policies/privacy",
    "In App Purchases": "Yes",
    "Name": "YouTube - Watch, Upload and Share Videos",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "267275",
    "Overall Rating": "Information Not Available",
    "Rank": "7",
    "Rating of Current Version": "2.5",
    "Release": "Mar 21, 2017",
    "Seller": "Google, Inc.",
    "Size": " 114 MB",
    "Version": "12.10"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Music",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Spotify is the best way to listen to music on mobile or tablet. Search for any track, artist or album and listen for free. Make and share playlists. Build your biggest, best ever music collection. Get inspired with personal recommendations, and readymade playlists for just about everything.Listen absolutely free with ads, or get Spotify Premium.Free on mobile• Play any artist, album, or playlist in shuffle mode.Free on tablet• Play any song, any time.Premium features• Play any song, any time on any device: mobile, tablet or computer.• Enjoy ad-free music. • Listen offline. • Get better sound quality.Please note: This app features Nielsen’s audience measurement software which will allow you to contribute to market research, such as Nielsen’s Audio Measurement. If you don't want to participate, you can opt-out within the app settings. To learn more about our digital audience measurement products and your choices in regard to them, please visit http://www.nielsen.com/digitalprivacy for more information.Privacy policy: http://www.spotify.com/legal/privacy-policy/Terms of use: https://www.spotify.com/legal/end-user-agreement/Love Spotify? Like us on Facebook: http://www.facebook.com/spotify Follow us on Twitter: http://twitter.com/spotify",
    "In App Purchases": "Yes",
    "Name": "Spotify Music",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "848676",
    "Overall Rating": "Information Not Available",
    "Rank": "8",
    "Rating of Current Version": "4.5",
    "Release": "Mar 21, 2017",
    "Seller": "Spotify",
    "Size": " 124 MB",
    "Version": "8.0.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Travel",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Uber is a ridesharing app for fast, reliable rides in minutes—day or night. There’s no need to park or wait for a taxi or bus. With Uber, you just tap to request a ride, and it’s easy to pay with credit or cash in select cities.Whether you’re going to the airport or across town, there’s an Uber for every occasion. Uber is available in more than 500 cities worldwide—download the app and take your first trip today.Requesting your Uber is easy—here’s how it works:- Just open the app and tell us where you’re going.- The app uses your location so your driver knows where to pick you up.- You’ll see your driver’s picture, vehicle details, and can track their arrival on the map.- Payment can be made by credit card, cash in select cities, Apple Pay, PayPal, and more.- After the ride, you can rate your driver and provide feedback to help us improve the Uber experience. You’ll also get a receipt by email.Need a simple way to get from A to B quickly? Take uberX, our most affordable individual option. Want to save money on your ride? Take uberPOOL—you’ll travel with other riders headed your way and enjoy a lower fare. Want to elevate your experience? Take a high-end vehicle with UberBLACK. And there’s still more options—whether you’re traveling with a big group, or need a vehicle with accessibility features.See if Uber is available in your city at https://www.uber.com/citiesFollow us on Twitter at https://twitter.com/uberLike us on Facebook at https://www.facebook.com/uberHave a question? Visit uber.com/help.Note: Continued use of GPS running in the background can dramatically decrease battery life.",
    "In App Purchases": "No",
    "Name": "Uber",
    "Number of Reviews (All Time)": "47069",
    "Number of Reviews (Current Versions) ": "671",
    "Overall Rating": "3.5",
    "Rank": "9",
    "Rating of Current Version": "2",
    "Release": "Mar 06, 2017",
    "Seller": "Information Not Available",
    "Size": " 220 MB",
    "Version": "3.235.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Social Networking",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Keeping up with friends is faster than ever. • See what friends are up to• Share updates, photos and video• Get notified when friends like and comment on your posts• Watch and interact with live video• Play games and use your favorite appsRead our Data Use Policy, Terms and other important info in the legal section of our App Store description. Continued use of GPS running in the background can dramatically decrease battery life. Facebook doesn't run GPS in the background unless you give us permission by turning on optional features that require this.",
    "In App Purchases": "No",
    "Name": "Facebook",
    "Number of Reviews (All Time)": "2962262",
    "Number of Reviews (Current Versions) ": "1037",
    "Overall Rating": "3.5",
    "Rank": "10",
    "Rating of Current Version": "3",
    "Release": "Mar 16, 2017",
    "Seller": "Facebook, Inc.",
    "Size": " 328 MB",
    "Version": "84.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Keeping up with friends is faster than ever. • See what friends are up to• Share updates, photos and video• Get notified when friends like and comment on your posts• Watch and interact with live video• Play games and use your favorite appsRead our Data Use Policy, Terms and other important info in the legal section of our App Store description. Continued use of GPS running in the background can dramatically decrease battery life. Facebook doesn't run GPS in the background unless you give us permission by turning on optional features that require this.",
    "In App Purchases": "No",
    "Name": "Word Cookies!",
    "Number of Reviews (All Time)": "2962262",
    "Number of Reviews (Current Versions) ": "1037",
    "Overall Rating": "3.5",
    "Rank": "11",
    "Rating of Current Version": "3",
    "Release": "Mar 16, 2017",
    "Seller": "Facebook, Inc.",
    "Size": " 328 MB",
    "Version": "84.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Relax your brain with the champion of time killer!Swipe your finger to throw the balls and break the bricks.Try to break as many bricks as possible before they move down to the bottom. Collect all the items to get additional balls and make an endless ball chain!The level of bricks will be increased after each round you throw the balls.Very easy to play but very hard to reach high scores. Don't forget the angle is the key point!Game Features:◉ Free to play◉ Endless gameplay◉ Simple ball control◉ Challenge your friends with the best highscore",
    "In App Purchases": "Yes",
    "Name": "Ballz",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "2362",
    "Overall Rating": "Information Not Available",
    "Rank": "12",
    "Rating of Current Version": "4.5",
    "Release": "Feb 18, 2017",
    "Seller": "Ketchapp",
    "Size": " 141 MB",
    "Version": "1.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Books",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Relax your brain with the champion of time killer!Swipe your finger to throw the balls and break the bricks.Try to break as many bricks as possible before they move down to the bottom. Collect all the items to get additional balls and make an endless ball chain!The level of bricks will be increased after each round you throw the balls.Very easy to play but very hard to reach high scores. Don't forget the angle is the key point!Game Features:◉ Free to play◉ Endless gameplay◉ Simple ball control◉ Challenge your friends with the best highscore",
    "In App Purchases": "Yes",
    "Name": "HOOKED - Chat Stories",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "2362",
    "Overall Rating": "Information Not Available",
    "Rank": "13",
    "Rating of Current Version": "4.5",
    "Release": "Feb 18, 2017",
    "Seller": "Ketchapp",
    "Size": " 141 MB",
    "Version": "1.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Entertainment",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Subscribe Now on Your iPhone® or iPad®Watch TV shows and movies recommended just for you, including award-winning Netflix original series, movies, and documentaries.  Netflix has something for everyone. There’s even a safe watching experience just for kids with family-friendly entertainment. How does Netflix work? • Netflix adds TV shows and movies all the time. Browse titles or search for your favorites. • The more you watch, the better Netflix gets at recommending TV shows and movies that you’ll love—just for you. • You can create up to five individual profiles within a single Netflix account. Profiles allow different members of your household to have their own personalized Netflix experience built around the movies and TV shows they enjoy. • Instantly stream on iOS devices or on the web.Try us free for 1 month! If you enjoy your Netflix trial, do nothing and your membership will automatically continue for as long as you choose to remain a member. Netflix membership is a month-to-month subscription that begins at sign up. You can easily cancel anytime, online, 24 hours a day. There are no long-term contracts or cancellation fees. Just sign up to get started! If you subscribe via iTunes:Payment will be charged to iTunes Account at confirmation of purchase. Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period at the rate of your selected plan above. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings on the device. If you haven’t subscribed through iTunes, you can manage your subscription through Netflix.Choose the plan that’s right for you:1 Screen $7.99/month2 Screens + HD $9.99/month4 screens + ULTRA HD$11.99/monthPrivacy policy:  https://help.netflix.com/legal/privacyTerms of use:  https://help.netflix.com/legal/termsofuse",
    "In App Purchases": "Yes",
    "Name": "Netflix",
    "Number of Reviews (All Time)": "302735",
    "Number of Reviews (Current Versions) ": "385",
    "Overall Rating": "3.5",
    "Rank": "14",
    "Rating of Current Version": "3",
    "Release": "Mar 14, 2017",
    "Seller": "Netflix, Inc.",
    "Size": " 84.3 MB",
    "Version": "9.10.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Subscribe Now on Your iPhone® or iPad®Watch TV shows and movies recommended just for you, including award-winning Netflix original series, movies, and documentaries.  Netflix has something for everyone. There’s even a safe watching experience just for kids with family-friendly entertainment. How does Netflix work? • Netflix adds TV shows and movies all the time. Browse titles or search for your favorites. • The more you watch, the better Netflix gets at recommending TV shows and movies that you’ll love—just for you. • You can create up to five individual profiles within a single Netflix account. Profiles allow different members of your household to have their own personalized Netflix experience built around the movies and TV shows they enjoy. • Instantly stream on iOS devices or on the web.Try us free for 1 month! If you enjoy your Netflix trial, do nothing and your membership will automatically continue for as long as you choose to remain a member. Netflix membership is a month-to-month subscription that begins at sign up. You can easily cancel anytime, online, 24 hours a day. There are no long-term contracts or cancellation fees. Just sign up to get started! If you subscribe via iTunes:Payment will be charged to iTunes Account at confirmation of purchase. Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period at the rate of your selected plan above. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings on the device. If you haven’t subscribed through iTunes, you can manage your subscription through Netflix.Choose the plan that’s right for you:1 Screen $7.99/month2 Screens + HD $9.99/month4 screens + ULTRA HD$11.99/monthPrivacy policy:  https://help.netflix.com/legal/privacyTerms of use:  https://help.netflix.com/legal/termsofuse",
    "In App Purchases": "Yes",
    "Name": "Gmail - email by Google: secure, fast & organized",
    "Number of Reviews (All Time)": "302735",
    "Number of Reviews (Current Versions) ": "385",
    "Overall Rating": "3.5",
    "Rank": "15",
    "Rating of Current Version": "3",
    "Release": "Mar 14, 2017",
    "Seller": "Netflix, Inc.",
    "Size": " 84.3 MB",
    "Version": "9.10.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Social Networking",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Subscribe Now on Your iPhone® or iPad®Watch TV shows and movies recommended just for you, including award-winning Netflix original series, movies, and documentaries.  Netflix has something for everyone. There’s even a safe watching experience just for kids with family-friendly entertainment. How does Netflix work? • Netflix adds TV shows and movies all the time. Browse titles or search for your favorites. • The more you watch, the better Netflix gets at recommending TV shows and movies that you’ll love—just for you. • You can create up to five individual profiles within a single Netflix account. Profiles allow different members of your household to have their own personalized Netflix experience built around the movies and TV shows they enjoy. • Instantly stream on iOS devices or on the web.Try us free for 1 month! If you enjoy your Netflix trial, do nothing and your membership will automatically continue for as long as you choose to remain a member. Netflix membership is a month-to-month subscription that begins at sign up. You can easily cancel anytime, online, 24 hours a day. There are no long-term contracts or cancellation fees. Just sign up to get started! If you subscribe via iTunes:Payment will be charged to iTunes Account at confirmation of purchase. Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period at the rate of your selected plan above. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings on the device. If you haven’t subscribed through iTunes, you can manage your subscription through Netflix.Choose the plan that’s right for you:1 Screen $7.99/month2 Screens + HD $9.99/month4 screens + ULTRA HD$11.99/monthPrivacy policy:  https://help.netflix.com/legal/privacyTerms of use:  https://help.netflix.com/legal/termsofuse",
    "In App Purchases": "Yes",
    "Name": "Pinterest",
    "Number of Reviews (All Time)": "302735",
    "Number of Reviews (Current Versions) ": "385",
    "Overall Rating": "3.5",
    "Rank": "16",
    "Rating of Current Version": "3",
    "Release": "Mar 14, 2017",
    "Seller": "Netflix, Inc.",
    "Size": " 84.3 MB",
    "Version": "9.10.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Music",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Subscribe Now on Your iPhone® or iPad®Watch TV shows and movies recommended just for you, including award-winning Netflix original series, movies, and documentaries.  Netflix has something for everyone. There’s even a safe watching experience just for kids with family-friendly entertainment. How does Netflix work? • Netflix adds TV shows and movies all the time. Browse titles or search for your favorites. • The more you watch, the better Netflix gets at recommending TV shows and movies that you’ll love—just for you. • You can create up to five individual profiles within a single Netflix account. Profiles allow different members of your household to have their own personalized Netflix experience built around the movies and TV shows they enjoy. • Instantly stream on iOS devices or on the web.Try us free for 1 month! If you enjoy your Netflix trial, do nothing and your membership will automatically continue for as long as you choose to remain a member. Netflix membership is a month-to-month subscription that begins at sign up. You can easily cancel anytime, online, 24 hours a day. There are no long-term contracts or cancellation fees. Just sign up to get started! If you subscribe via iTunes:Payment will be charged to iTunes Account at confirmation of purchase. Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period at the rate of your selected plan above. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings on the device. If you haven’t subscribed through iTunes, you can manage your subscription through Netflix.Choose the plan that’s right for you:1 Screen $7.99/month2 Screens + HD $9.99/month4 screens + ULTRA HD$11.99/monthPrivacy policy:  https://help.netflix.com/legal/privacyTerms of use:  https://help.netflix.com/legal/termsofuse",
    "In App Purchases": "Yes",
    "Name": "Pandora - Music & Radio",
    "Number of Reviews (All Time)": "302735",
    "Number of Reviews (Current Versions) ": "385",
    "Overall Rating": "3.5",
    "Rank": "17",
    "Rating of Current Version": "3",
    "Release": "Mar 14, 2017",
    "Seller": "Netflix, Inc.",
    "Size": " 84.3 MB",
    "Version": "9.10.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Shopping",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Subscribe Now on Your iPhone® or iPad®Watch TV shows and movies recommended just for you, including award-winning Netflix original series, movies, and documentaries.  Netflix has something for everyone. There’s even a safe watching experience just for kids with family-friendly entertainment. How does Netflix work? • Netflix adds TV shows and movies all the time. Browse titles or search for your favorites. • The more you watch, the better Netflix gets at recommending TV shows and movies that you’ll love—just for you. • You can create up to five individual profiles within a single Netflix account. Profiles allow different members of your household to have their own personalized Netflix experience built around the movies and TV shows they enjoy. • Instantly stream on iOS devices or on the web.Try us free for 1 month! If you enjoy your Netflix trial, do nothing and your membership will automatically continue for as long as you choose to remain a member. Netflix membership is a month-to-month subscription that begins at sign up. You can easily cancel anytime, online, 24 hours a day. There are no long-term contracts or cancellation fees. Just sign up to get started! If you subscribe via iTunes:Payment will be charged to iTunes Account at confirmation of purchase. Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period at the rate of your selected plan above. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings on the device. If you haven’t subscribed through iTunes, you can manage your subscription through Netflix.Choose the plan that’s right for you:1 Screen $7.99/month2 Screens + HD $9.99/month4 screens + ULTRA HD$11.99/monthPrivacy policy:  https://help.netflix.com/legal/privacyTerms of use:  https://help.netflix.com/legal/termsofuse",
    "In App Purchases": "Yes",
    "Name": "Amazon App: shop, scan, compare, and read reviews",
    "Number of Reviews (All Time)": "302735",
    "Number of Reviews (Current Versions) ": "385",
    "Overall Rating": "3.5",
    "Rank": "18",
    "Rating of Current Version": "3",
    "Release": "Mar 14, 2017",
    "Seller": "Netflix, Inc.",
    "Size": " 84.3 MB",
    "Version": "9.10.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Social Networking",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Subscribe Now on Your iPhone® or iPad®Watch TV shows and movies recommended just for you, including award-winning Netflix original series, movies, and documentaries.  Netflix has something for everyone. There’s even a safe watching experience just for kids with family-friendly entertainment. How does Netflix work? • Netflix adds TV shows and movies all the time. Browse titles or search for your favorites. • The more you watch, the better Netflix gets at recommending TV shows and movies that you’ll love—just for you. • You can create up to five individual profiles within a single Netflix account. Profiles allow different members of your household to have their own personalized Netflix experience built around the movies and TV shows they enjoy. • Instantly stream on iOS devices or on the web.Try us free for 1 month! If you enjoy your Netflix trial, do nothing and your membership will automatically continue for as long as you choose to remain a member. Netflix membership is a month-to-month subscription that begins at sign up. You can easily cancel anytime, online, 24 hours a day. There are no long-term contracts or cancellation fees. Just sign up to get started! If you subscribe via iTunes:Payment will be charged to iTunes Account at confirmation of purchase. Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period at the rate of your selected plan above. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings on the device. If you haven’t subscribed through iTunes, you can manage your subscription through Netflix.Choose the plan that’s right for you:1 Screen $7.99/month2 Screens + HD $9.99/month4 screens + ULTRA HD$11.99/monthPrivacy policy:  https://help.netflix.com/legal/privacyTerms of use:  https://help.netflix.com/legal/termsofuse",
    "In App Purchases": "Yes",
    "Name": "WhatsApp Messenger",
    "Number of Reviews (All Time)": "302735",
    "Number of Reviews (Current Versions) ": "385",
    "Overall Rating": "3.5",
    "Rank": "19",
    "Rating of Current Version": "3",
    "Release": "Mar 14, 2017",
    "Seller": "Netflix, Inc.",
    "Size": " 84.3 MB",
    "Version": "9.10.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Shopping",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Over 100 million people are getting trending items 50-80% cheaper than what you pay at the local mall. Get the hottest products at incredible prices delivered directly to your door. Wish is the #1 shopping mall in Europe and North America allowing you to browse a worldwide selection of trending fashion, accessories, and electronics directly at your fingertips.",
    "In App Purchases": "No",
    "Name": "Wish - Shopping Made Fun",
    "Number of Reviews (All Time)": "132278",
    "Number of Reviews (Current Versions) ": "530",
    "Overall Rating": "4.5",
    "Rank": "20",
    "Rating of Current Version": "4.5",
    "Release": "Mar 16, 2017",
    "Seller": "ContextLogic Inc.",
    "Size": " 50.0 MB",
    "Version": "3.18.5"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Challenge your friends in the new hot trivia game!Discover 1000s of themes and find more answers than your opponent to win the match. Use jokers to give you an edge and revelation wands to learn from your mistakes. Check your stats and make it to N°1 amongst your friends and worldwide!● Play against real players online● Discover 1000s of themes● Check your progress, stats and ranking● Use Jokers and revelation wands● Chat with your friends",
    "In App Purchases": "Yes",
    "Name": "Fight List",
    "Number of Reviews (All Time)": "2200",
    "Number of Reviews (Current Versions) ": "1297",
    "Overall Rating": "3.5",
    "Rank": "21",
    "Rating of Current Version": "3.5",
    "Release": "Mar 08, 2017",
    "Seller": "Voodoo",
    "Size": " 32.2 MB",
    "Version": "2.15.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Challenge your friends in the new hot trivia game!Discover 1000s of themes and find more answers than your opponent to win the match. Use jokers to give you an edge and revelation wands to learn from your mistakes. Check your stats and make it to N°1 amongst your friends and worldwide!● Play against real players online● Discover 1000s of themes● Check your progress, stats and ranking● Use Jokers and revelation wands● Chat with your friends",
    "In App Purchases": "Yes",
    "Name": "8 Ball Pool™",
    "Number of Reviews (All Time)": "2200",
    "Number of Reviews (Current Versions) ": "1297",
    "Overall Rating": "3.5",
    "Rank": "22",
    "Rating of Current Version": "3.5",
    "Release": "Mar 08, 2017",
    "Seller": "Voodoo",
    "Size": " 32.2 MB",
    "Version": "2.15.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Challenge your friends in the new hot trivia game!Discover 1000s of themes and find more answers than your opponent to win the match. Use jokers to give you an edge and revelation wands to learn from your mistakes. Check your stats and make it to N°1 amongst your friends and worldwide!● Play against real players online● Discover 1000s of themes● Check your progress, stats and ranking● Use Jokers and revelation wands● Chat with your friends",
    "In App Purchases": "Yes",
    "Name": "Bit City",
    "Number of Reviews (All Time)": "2200",
    "Number of Reviews (Current Versions) ": "1297",
    "Overall Rating": "3.5",
    "Rank": "23",
    "Rating of Current Version": "3.5",
    "Release": "Mar 08, 2017",
    "Seller": "Voodoo",
    "Size": " 32.2 MB",
    "Version": "2.15.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Music",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Challenge your friends in the new hot trivia game!Discover 1000s of themes and find more answers than your opponent to win the match. Use jokers to give you an edge and revelation wands to learn from your mistakes. Check your stats and make it to N°1 amongst your friends and worldwide!● Play against real players online● Discover 1000s of themes● Check your progress, stats and ranking● Use Jokers and revelation wands● Chat with your friends",
    "In App Purchases": "Yes",
    "Name": "SoundCloud - Music & Audio",
    "Number of Reviews (All Time)": "2200",
    "Number of Reviews (Current Versions) ": "1297",
    "Overall Rating": "3.5",
    "Rank": "24",
    "Rating of Current Version": "3.5",
    "Release": "Mar 08, 2017",
    "Seller": "Voodoo",
    "Size": " 32.2 MB",
    "Version": "2.15.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Episode lets you LIVE your stories. One choice YOU make can change everything! The world’s largest home of visual stories where YOU choose your path. Or, become a creator and write your own! Wouldn’t it be amazing if YOU were a character in your favorite story? Episode lets you do just that, with over 35,000 gripping stories. In each, create your own character and make choices that matter. From your favorite movie titles like Mean Girls to fan faves such as Bad Boy’s Girl, Episode will keep you interacting for hours. If you love Snapchat or Netflix, give Episode a try!With all your favorite genres, there’s no time like the present to fall in love, rise to fame, or solve a decade-old mystery. Better yet, join this incredible community and become a creator of your own -- writing and publishing stories, amassing lots of fans along the way!Episode is LIT. Join our #episodesquad for #episodelife.FOLLOW US:instagram.com/episodefacebook.com/TheEpisodeAppIf you haven’t checked it out yet, start reading PRETTY LITTLE LIARS! - CREATE YOUR PERSONAL LOOK and choose your best outfits.- MAKE FRIENDS WITH THE LIARS and hang out with the coolest clique.- EXPERIENCE THE SUSPENSE and uncover the mysterious “A”.- DATE THE HOT GUY and decide your path to romance.OTHER FEATURED STORIES:MEAN GIRLS: SENIOR YEAR. Step inside girl world, right where the Mean Girls movie left off, and navigate the drama and romance of Senior Year at North Shore High. As you battle Regina George, you will get to know characters from the Mean Girls movie like Cady, Janis, Damian, and of course the Plastics. You will also meet the guy of your dreams, but Regina won't let you get him that easily. DEMI LOVATO: PATH TO FAME. Star in your very own tour! After winning a spot on Demi’s tour as her opening act, it’s time to embrace your true self and define your dream career. As Demi shares her advice on taking control of destiny, what choices will you make as you become a role model for aspiring stars?FALLING FOR THE DOLAN TWINS. On your first day in LA, you meet the cutest guy you've ever seen—and then you meet his twin brother. As you get closer and closer to internet stars Ethan and Grayson Dolan, the sparks start to fly... which one will you choose? HOLLYWOOD DAYS WITH HAYES, featuring internet sensation Hayes Grier. Your choices determine how you rise in the Hollywood ranks. As the lines blur between fantasy and reality, how will you manage? Let's see what you've got! You might even fall in love as your adventure unfolds…iMESSAGE STICKERS are here! OMG! Yaaaas! Do you Slay every day? Thought so. Are you a Pretty Little Liars fan? Here’s a secret. How about Mean Girls? Come sit with us. We’ve got your favorite characters, sayings, and slayings from Episode in a brand new 28 sticker pack, so you can tell your old stickers, “Boy, BYE.” Download directly from the App Store for iMessage or enable from Settings in Episode. PRETTY LITTLE LIARS and all related characters and elements © & ™ Warner Bros. Entertainment Inc. (s16)TM & ©2016 Paramount Pictures. All Rights Reserved.PLEASE NOTE: Episode lets you purchase items within the game for real money. Please disable in-app purchases on your device if you do not want this feature to be accessible. Your use of this application is governed by the Terms of Service available at http://pocketgems.com/episode-terms-of-service/. Collection and use of your data are subject to the Privacy Policy available at http://pocketgems.com/episode-privacy-policy/.",
    "In App Purchases": "Yes",
    "Name": "Episode - Choose Your Story",
    "Number of Reviews (All Time)": "142719",
    "Number of Reviews (Current Versions) ": "2374",
    "Overall Rating": "4.5",
    "Rank": "25",
    "Rating of Current Version": "4.5",
    "Release": "Mar 14, 2017",
    "Seller": "Episode Interactive, LLC",
    "Size": " 178 MB",
    "Version": "5.80"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Travel",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Need a lift? Try Lyft for a friendly, affordable ride whenever you need one. Request a ride with the tap of a button, and get picked up by a nearby community driver who’ll take you to your destination within minutes. Yep, it's that easy.• Split the cost of a ride with friends. It’s easy, fast, and secure. • All Lyft drivers pass comprehensive background and DMV checks.• Drivers are rated by passengers and only the highest-rated drivers are allowed on the road.• Lyft provides a first-of-its-kind $1M liability insurance for total peace of mind.Join the millions who’ve taken 5-star rides. Download and take a ride today!—What people are saying:\"Ride-sharing programs like Lyft are providing commuters with less expensive and more social ways to get around. Users log into the app, specify where they’re heading, and a background-checked driver picks them up for less than a typical cab ride.\" - TODAY Show“Lyft is a real community — with both the drivers and riders being inherently social — making real friendships and saving money.” - Time\"In a city where taxis can be scarce and… black town cars are rampant but expensive, Lyft has quickly gained visibility due to low prices and quirky branding.\" - Ad Age\"Lyft's focus on the everyman has recently extended to the wildly successful Lyft Line carpool service aimed at commuters, which offers discounts of 30% to 60% for sharing a Lyft ride with others.\" - Fast Company—For Lyft drivers, continued use of GPS running in the background can dramatically decrease battery life.Prices vary based on market condition.",
    "In App Purchases": "No",
    "Name": "Lyft",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "39886",
    "Overall Rating": "Information Not Available",
    "Rank": "26",
    "Rating of Current Version": "4.5",
    "Release": "Mar 21, 2017",
    "Seller": "Information Not Available",
    "Size": " 148 MB",
    "Version": "4.23.31"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "News",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Need a lift? Try Lyft for a friendly, affordable ride whenever you need one. Request a ride with the tap of a button, and get picked up by a nearby community driver who’ll take you to your destination within minutes. Yep, it's that easy.• Split the cost of a ride with friends. It’s easy, fast, and secure. • All Lyft drivers pass comprehensive background and DMV checks.• Drivers are rated by passengers and only the highest-rated drivers are allowed on the road.• Lyft provides a first-of-its-kind $1M liability insurance for total peace of mind.Join the millions who’ve taken 5-star rides. Download and take a ride today!—What people are saying:\"Ride-sharing programs like Lyft are providing commuters with less expensive and more social ways to get around. Users log into the app, specify where they’re heading, and a background-checked driver picks them up for less than a typical cab ride.\" - TODAY Show“Lyft is a real community — with both the drivers and riders being inherently social — making real friendships and saving money.” - Time\"In a city where taxis can be scarce and… black town cars are rampant but expensive, Lyft has quickly gained visibility due to low prices and quirky branding.\" - Ad Age\"Lyft's focus on the everyman has recently extended to the wildly successful Lyft Line carpool service aimed at commuters, which offers discounts of 30% to 60% for sharing a Lyft ride with others.\" - Fast Company—For Lyft drivers, continued use of GPS running in the background can dramatically decrease battery life.Prices vary based on market condition.",
    "In App Purchases": "No",
    "Name": "Twitter",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "39886",
    "Overall Rating": "Information Not Available",
    "Rank": "27",
    "Rating of Current Version": "4.5",
    "Release": "Mar 21, 2017",
    "Seller": "Information Not Available",
    "Size": " 148 MB",
    "Version": "4.23.31"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Discover Voodoo's new game: Paper.io.Your goal? To conquer as much territory as possible. It's initially very simple, and the game can be mastered immediately, but watch out: there's competition, and not everyone can win!Whether you're bold or more careful, you have to be more cunning than your adversaries by finding the best strategy to conquer the most space. But be careful! You have a weak spot: your tail. If an enemy touches it, that's the end for you.Try to stay ahead, because victory in Paper.io is never certain until you possess all the territory. Stealing is allowed, and your enemies won't hesitate to do so.After the success of Quiz Run, 1 Pic 8 Words, and Bool, Voodoo now offers you a new gaming and graphics experience inspired by io type games (made popular by agar.io). Enjoy the simplicity and strategy of an io game in a world with unique graphics.Paper.io is for the whole family and doesn't require an Internet connection.",
    "In App Purchases": "Yes",
    "Name": "Paper.io",
    "Number of Reviews (All Time)": "14781",
    "Number of Reviews (Current Versions) ": "546",
    "Overall Rating": "3.5",
    "Rank": "28",
    "Rating of Current Version": "4",
    "Release": "Mar 17, 2017",
    "Seller": "Voodoo",
    "Size": " 273 MB",
    "Version": "2.6"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Shopping",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Discover Voodoo's new game: Paper.io.Your goal? To conquer as much territory as possible. It's initially very simple, and the game can be mastered immediately, but watch out: there's competition, and not everyone can win!Whether you're bold or more careful, you have to be more cunning than your adversaries by finding the best strategy to conquer the most space. But be careful! You have a weak spot: your tail. If an enemy touches it, that's the end for you.Try to stay ahead, because victory in Paper.io is never certain until you possess all the territory. Stealing is allowed, and your enemies won't hesitate to do so.After the success of Quiz Run, 1 Pic 8 Words, and Bool, Voodoo now offers you a new gaming and graphics experience inspired by io type games (made popular by agar.io). Enjoy the simplicity and strategy of an io game in a world with unique graphics.Paper.io is for the whole family and doesn't require an Internet connection.",
    "In App Purchases": "Yes",
    "Name": "OfferUp - Buy. Sell. Simple.",
    "Number of Reviews (All Time)": "14781",
    "Number of Reviews (Current Versions) ": "546",
    "Overall Rating": "3.5",
    "Rank": "29",
    "Rating of Current Version": "4",
    "Release": "Mar 17, 2017",
    "Seller": "Voodoo",
    "Size": " 273 MB",
    "Version": "2.6"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Travel",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Yelp has over 100 million reviews of businesses worldwide and is available for iPhone, iPad, and Apple Watch.Whether you’re looking for a pizzeria that just opened or a coffee shop nearby, Yelp is your local guide to finding the perfect place to eat, shop, drink, relax and play.Yelp features:Find Restaurants• Find the newest and hottest restaurants in your area• Make reservations, pick up food and order for delivery, all from your phone• Filter restaurant search results by price, location and moreSearch for Nearby Businesses• Discover great local businesses• Read millions of reviews by the Yelp community• Find great deals offered by local businessesSearch Filters • Filter your search results by neighborhood, distance, rating, price and hours of operation• Look up addresses and phone numbers, call a business or make reservations directly from the appOther Features• Read expert user reviews and browse through beautiful photos of each business• Write and read reviews, check-in to local businesses, upload photos and add tips for other Yelp usersFind local restaurants, read expert customer reviews and start searching for businesses near you with Yelp.Need Help? Contact Yelp at https://www.yelp-support.com/?l=en_USNote: Continued use of GPS running can dramatically decrease battery life.",
    "In App Purchases": "No",
    "Name": "Yelp: The Best Local Food, Drinks, Services & More",
    "Number of Reviews (All Time)": "209491",
    "Number of Reviews (Current Versions) ": "3432",
    "Overall Rating": "3.5",
    "Rank": "30",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Information Not Available",
    "Size": " 167 MB",
    "Version": "11.10.1"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Utilities",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Yelp has over 100 million reviews of businesses worldwide and is available for iPhone, iPad, and Apple Watch.Whether you’re looking for a pizzeria that just opened or a coffee shop nearby, Yelp is your local guide to finding the perfect place to eat, shop, drink, relax and play.Yelp features:Find Restaurants• Find the newest and hottest restaurants in your area• Make reservations, pick up food and order for delivery, all from your phone• Filter restaurant search results by price, location and moreSearch for Nearby Businesses• Discover great local businesses• Read millions of reviews by the Yelp community• Find great deals offered by local businessesSearch Filters • Filter your search results by neighborhood, distance, rating, price and hours of operation• Look up addresses and phone numbers, call a business or make reservations directly from the appOther Features• Read expert user reviews and browse through beautiful photos of each business• Write and read reviews, check-in to local businesses, upload photos and add tips for other Yelp usersFind local restaurants, read expert customer reviews and start searching for businesses near you with Yelp.Need Help? Contact Yelp at https://www.yelp-support.com/?l=en_USNote: Continued use of GPS running can dramatically decrease battery life.",
    "In App Purchases": "No",
    "Name": "Google Chrome – The Fast and Secure Web Browser",
    "Number of Reviews (All Time)": "209491",
    "Number of Reviews (Current Versions) ": "3432",
    "Overall Rating": "3.5",
    "Rank": "31",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Information Not Available",
    "Size": " 167 MB",
    "Version": "11.10.1"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Yelp has over 100 million reviews of businesses worldwide and is available for iPhone, iPad, and Apple Watch.Whether you’re looking for a pizzeria that just opened or a coffee shop nearby, Yelp is your local guide to finding the perfect place to eat, shop, drink, relax and play.Yelp features:Find Restaurants• Find the newest and hottest restaurants in your area• Make reservations, pick up food and order for delivery, all from your phone• Filter restaurant search results by price, location and moreSearch for Nearby Businesses• Discover great local businesses• Read millions of reviews by the Yelp community• Find great deals offered by local businessesSearch Filters • Filter your search results by neighborhood, distance, rating, price and hours of operation• Look up addresses and phone numbers, call a business or make reservations directly from the appOther Features• Read expert user reviews and browse through beautiful photos of each business• Write and read reviews, check-in to local businesses, upload photos and add tips for other Yelp usersFind local restaurants, read expert customer reviews and start searching for businesses near you with Yelp.Need Help? Contact Yelp at https://www.yelp-support.com/?l=en_USNote: Continued use of GPS running can dramatically decrease battery life.",
    "In App Purchases": "No",
    "Name": "Piano Tiles 2™(Don't Tap The White Tile 2)",
    "Number of Reviews (All Time)": "209491",
    "Number of Reviews (Current Versions) ": "3432",
    "Overall Rating": "3.5",
    "Rank": "32",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Information Not Available",
    "Size": " 167 MB",
    "Version": "11.10.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Create, edit, and collaborate with others on documents from your iPod, iPhone, or iPad with the free Google Docs app. With Google Docs you can:* Create new documents or edit any that were created on the web or on another device * Share documents and work together with others in the same document at the same time* Open, edit, and save Microsoft Word documents* Get stuff done anytime -- even without an internet connection* Add and respond to comments* Never worry about losing your work -- everything is automatically saved as you type * Protect your documents with a 4-digit passcode",
    "In App Purchases": "No",
    "Name": "Google Docs",
    "Number of Reviews (All Time)": "60108",
    "Number of Reviews (Current Versions) ": "892",
    "Overall Rating": "4.5",
    "Rank": "33",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Google, Inc.",
    "Size": " 194 MB",
    "Version": "1.2017.08204"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Shopping",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Create, edit, and collaborate with others on documents from your iPod, iPhone, or iPad with the free Google Docs app. With Google Docs you can:* Create new documents or edit any that were created on the web or on another device * Share documents and work together with others in the same document at the same time* Open, edit, and save Microsoft Word documents* Get stuff done anytime -- even without an internet connection* Add and respond to comments* Never worry about losing your work -- everything is automatically saved as you type * Protect your documents with a 4-digit passcode",
    "In App Purchases": "No",
    "Name": "letgo: Buy & Sell Second Hand Stuff",
    "Number of Reviews (All Time)": "60108",
    "Number of Reviews (Current Versions) ": "892",
    "Overall Rating": "4.5",
    "Rank": "34",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Google, Inc.",
    "Size": " 194 MB",
    "Version": "1.2017.08204"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "The sequel to our hit game \"Water Bottle Flip Challenge 2\" with over 1.5 million downloads!Think you can take on the Impossible Bottle Flip? Download now to find out! Tap to flip through the room onto ordinary household objects to get to the finish, just don't fall off!Conquer 15 impossible levels on your way to becoming a bottle flipping master.",
    "In App Purchases": "Yes",
    "Name": "Impossible Bottle Flip",
    "Number of Reviews (All Time)": "84",
    "Number of Reviews (Current Versions) ": "21",
    "Overall Rating": "3.5",
    "Rank": "35",
    "Rating of Current Version": "4",
    "Release": "Mar 20, 2017",
    "Seller": "Tastypill LLC",
    "Size": " 29.3 MB",
    "Version": "1.3"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Navigation",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Join 100 million Wazers who save time & money with Waze navigation by avoiding traffic jams, police, accidents and construction for free. Use the #1 real-time GPS today!Just by driving with Waze open, you're already contributing tons of real-time traffic information to your local community. You can also actively report accidents, police traps and other hazards you see on the road. Get road alerts along your route and find the cheapest gas prices around you shared by the community. Plus, you can add friends, send locations or keep others posted on your arrival time.- Live routing based on community driven, real-time traffic & road info- Community reported alerts including accidents, hazards, police traps, road closures, and more- Turn-by-turn voice guided navigation- Live maps, consistently edited and updated by Waze community map editors- Automatic rerouting as conditions change on the road - Send your ETA & real-time drive to update those you’re meeting- Learns your frequent destinations, commuting hours, and preferred routes- Find the cheapest gas station on your route - Add information on local places and businesses- Add Facebook friends and sync Contacts- See friends’ ETA when driving to the same destination- One tap navigation to Facebook & Calendar events- Earn points as you contribute road info and climb the ranks in your community Waze is all about contributing to and benefiting from the common good, so hop on board and get involved! Note: Continued use of GPS running in the background can dramatically decrease battery life. Waze will automatically shut down if you run it in the background and haven't driven for a while. Learn more about the Waze privacy policy, including what information is accessed and how it is used. With Waze, you have full control over your privacy settings. http://www.waze.com/legal/privacy/",
    "In App Purchases": "No",
    "Name": "Waze - GPS Navigation, Maps & Real-time Traffic",
    "Number of Reviews (All Time)": "329714",
    "Number of Reviews (Current Versions) ": "3935",
    "Overall Rating": "4.5",
    "Rank": "36",
    "Rating of Current Version": "4.5",
    "Release": "Mar 05, 2017",
    "Seller": "waze",
    "Size": " 88.7 MB",
    "Version": "4.20"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "One choice can change everything! Fall in love, solve crimes, or embark on epic fantasy adventures in immersive visual stories where YOU control what happens next! Current stories include:THE FRESHMAN, BOOK 1. Welcome to Hartfeld University! You'll make friends for life, and maybe even find true love. Will you date bookish James, party girl Kaitlyn, football hero Chris... or all three at once?- Dress to impress with fashion forward outfits.- Choose a date for the elegant and romantic Winter Formal.- Support new friends as you tackle freshman adventures together!THE CROWN & THE FLAME, BOOK 1. Your enemies stole your kingdom, but now the time has come for you to raise an army, master magic, and reclaim your crown!- Form alliances to build your army.- Master unique weapons.- Choose between elegant ball gowns and powerful armor.- Crush your enemies in an epic battle!MOST WANTED, BOOK 1. The heat is on when a no-nonsense Texas Marshal and a Hollywood detective are thrown together to stop a deranged hitman. Can you catch the killer?- Play as Detective Dave Reyes and U.S. Marshal Sam Massey.- Investigate a mystery with twists you won't see coming.- Examine evidence at crime scenes.- Stop the killer before he can claim another victim!...PLUS more new stories and chapters EACH WEEK!Choices is by the team that first created story games for mobile over a decade ago. Later we created Surviving High School and Cause of Death, the first games with episodes, for EA.Both games hit the Top 25 and were inspirations for other companies. After leaving EA, our team regrouped in a small office and with the quacking of nearby ducklings we set out to create story driven games with heart. As Pixelberry, we launched two hit games, High School Story and Hollywood U.Our team has now grown to over a dozen of the most experienced game writers in the industry. In our 10 years of creating story games together, we’ve seen heartbreak, marriages, great adventures, and even Pixelbabies.But even through diaper changes and late nights, we think we’ve created our best work to date. We hope you’ll fall in love with our newest characters, Chris, James, Kaitlyn, Dave, and Sam just as we have.Enjoy,- The Pixelberry Team",
    "In App Purchases": "Yes",
    "Name": "Choices: Stories You Play",
    "Number of Reviews (All Time)": "22683",
    "Number of Reviews (Current Versions) ": "7753",
    "Overall Rating": "4.5",
    "Rank": "37",
    "Rating of Current Version": "4.5",
    "Release": "Feb 01, 2017",
    "Seller": "Pixelberry Studios",
    "Size": " 99.6 MB",
    "Version": "1.7.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Productivity",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "One choice can change everything! Fall in love, solve crimes, or embark on epic fantasy adventures in immersive visual stories where YOU control what happens next! Current stories include:THE FRESHMAN, BOOK 1. Welcome to Hartfeld University! You'll make friends for life, and maybe even find true love. Will you date bookish James, party girl Kaitlyn, football hero Chris... or all three at once?- Dress to impress with fashion forward outfits.- Choose a date for the elegant and romantic Winter Formal.- Support new friends as you tackle freshman adventures together!THE CROWN & THE FLAME, BOOK 1. Your enemies stole your kingdom, but now the time has come for you to raise an army, master magic, and reclaim your crown!- Form alliances to build your army.- Master unique weapons.- Choose between elegant ball gowns and powerful armor.- Crush your enemies in an epic battle!MOST WANTED, BOOK 1. The heat is on when a no-nonsense Texas Marshal and a Hollywood detective are thrown together to stop a deranged hitman. Can you catch the killer?- Play as Detective Dave Reyes and U.S. Marshal Sam Massey.- Investigate a mystery with twists you won't see coming.- Examine evidence at crime scenes.- Stop the killer before he can claim another victim!...PLUS more new stories and chapters EACH WEEK!Choices is by the team that first created story games for mobile over a decade ago. Later we created Surviving High School and Cause of Death, the first games with episodes, for EA.Both games hit the Top 25 and were inspirations for other companies. After leaving EA, our team regrouped in a small office and with the quacking of nearby ducklings we set out to create story driven games with heart. As Pixelberry, we launched two hit games, High School Story and Hollywood U.Our team has now grown to over a dozen of the most experienced game writers in the industry. In our 10 years of creating story games together, we’ve seen heartbreak, marriages, great adventures, and even Pixelbabies.But even through diaper changes and late nights, we think we’ve created our best work to date. We hope you’ll fall in love with our newest characters, Chris, James, Kaitlyn, Dave, and Sam just as we have.Enjoy,- The Pixelberry Team",
    "In App Purchases": "Yes",
    "Name": "Google Drive - free online storage",
    "Number of Reviews (All Time)": "22683",
    "Number of Reviews (Current Versions) ": "7753",
    "Overall Rating": "4.5",
    "Rank": "38",
    "Rating of Current Version": "4.5",
    "Release": "Feb 01, 2017",
    "Seller": "Pixelberry Studios",
    "Size": " 99.6 MB",
    "Version": "1.7.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "One choice can change everything! Fall in love, solve crimes, or embark on epic fantasy adventures in immersive visual stories where YOU control what happens next! Current stories include:THE FRESHMAN, BOOK 1. Welcome to Hartfeld University! You'll make friends for life, and maybe even find true love. Will you date bookish James, party girl Kaitlyn, football hero Chris... or all three at once?- Dress to impress with fashion forward outfits.- Choose a date for the elegant and romantic Winter Formal.- Support new friends as you tackle freshman adventures together!THE CROWN & THE FLAME, BOOK 1. Your enemies stole your kingdom, but now the time has come for you to raise an army, master magic, and reclaim your crown!- Form alliances to build your army.- Master unique weapons.- Choose between elegant ball gowns and powerful armor.- Crush your enemies in an epic battle!MOST WANTED, BOOK 1. The heat is on when a no-nonsense Texas Marshal and a Hollywood detective are thrown together to stop a deranged hitman. Can you catch the killer?- Play as Detective Dave Reyes and U.S. Marshal Sam Massey.- Investigate a mystery with twists you won't see coming.- Examine evidence at crime scenes.- Stop the killer before he can claim another victim!...PLUS more new stories and chapters EACH WEEK!Choices is by the team that first created story games for mobile over a decade ago. Later we created Surviving High School and Cause of Death, the first games with episodes, for EA.Both games hit the Top 25 and were inspirations for other companies. After leaving EA, our team regrouped in a small office and with the quacking of nearby ducklings we set out to create story driven games with heart. As Pixelberry, we launched two hit games, High School Story and Hollywood U.Our team has now grown to over a dozen of the most experienced game writers in the industry. In our 10 years of creating story games together, we’ve seen heartbreak, marriages, great adventures, and even Pixelbabies.But even through diaper changes and late nights, we think we’ve created our best work to date. We hope you’ll fall in love with our newest characters, Chris, James, Kaitlyn, Dave, and Sam just as we have.Enjoy,- The Pixelberry Team",
    "In App Purchases": "Yes",
    "Name": "True Skate",
    "Number of Reviews (All Time)": "22683",
    "Number of Reviews (Current Versions) ": "7753",
    "Overall Rating": "4.5",
    "Rank": "39",
    "Rating of Current Version": "4.5",
    "Release": "Feb 01, 2017",
    "Seller": "Pixelberry Studios",
    "Size": " 99.6 MB",
    "Version": "1.7.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Photo & Video",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Google Photos is a smarter home for all your photos and videos, made for the way you take photos today.“The best photo product on Earth” – The Verge“Google Photos is your new essential picture app” – Wired“Upload the pictures, and let Google Photos do the rest” – The New York Times• FREE UNLIMITED STORAGE: Back up unlimited photos and videos for free, up to 16 megapixels and 1080p HD. Access from any device and photos.google.com – your photos are safe, secure, and private to you.• FREE UP SPACE: Never worry about running out of space on your phone again. Photos that are safely backed up can be removed from your device’s storage in just a tap.• VISUAL SEARCH: Your photos are now searchable by the people, places and things in them – no tagging required.• BRING PHOTOS TO LIFE: Get automatically created movies, collages, GIFs, panoramas, and more from your photos. Or easily create them yourself.• ADVANCED EDITING: Transform photos with a tap. Use intuitive and powerful photo and video editing tools to apply content-aware filters, adjust lighting, and more.• MOTION STILLS: Advanced stabilization turns your Live Photos into beautiful looping videos or GIFs.• SMART AUTOMATIC ALBUMS: Automatically get new albums with just your best shots after an event or trip, then invite others to add their photos.• SEND PHOTOS IN SECONDS: Don’t waste data texting and emailing photos. Instantly share up to 1,500 photos with anyone.• REDISCOVER: It’s easier than ever to relive your memories. Get collages of photos you took a year ago on this day.• CAST: View your photos and videos on your TV with Chromecast support.Note: Face grouping is not available in all countries.Continued use of GPS running in the background can dramatically decrease battery life. Google Photos doesn't run GPS in the background unless you give us permission by turning on optional features that require this.For the latest updates from the team, follow us on Twitter at @googlephotos",
    "In App Purchases": "No",
    "Name": "Google Photos - free photo and video storage",
    "Number of Reviews (All Time)": "64988",
    "Number of Reviews (Current Versions) ": "3342",
    "Overall Rating": "5",
    "Rank": "40",
    "Rating of Current Version": "5",
    "Release": "Mar 08, 2017",
    "Seller": "Google, Inc.",
    "Size": " 158 MB",
    "Version": "2.11.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Google Photos is a smarter home for all your photos and videos, made for the way you take photos today.“The best photo product on Earth” – The Verge“Google Photos is your new essential picture app” – Wired“Upload the pictures, and let Google Photos do the rest” – The New York Times• FREE UNLIMITED STORAGE: Back up unlimited photos and videos for free, up to 16 megapixels and 1080p HD. Access from any device and photos.google.com – your photos are safe, secure, and private to you.• FREE UP SPACE: Never worry about running out of space on your phone again. Photos that are safely backed up can be removed from your device’s storage in just a tap.• VISUAL SEARCH: Your photos are now searchable by the people, places and things in them – no tagging required.• BRING PHOTOS TO LIFE: Get automatically created movies, collages, GIFs, panoramas, and more from your photos. Or easily create them yourself.• ADVANCED EDITING: Transform photos with a tap. Use intuitive and powerful photo and video editing tools to apply content-aware filters, adjust lighting, and more.• MOTION STILLS: Advanced stabilization turns your Live Photos into beautiful looping videos or GIFs.• SMART AUTOMATIC ALBUMS: Automatically get new albums with just your best shots after an event or trip, then invite others to add their photos.• SEND PHOTOS IN SECONDS: Don’t waste data texting and emailing photos. Instantly share up to 1,500 photos with anyone.• REDISCOVER: It’s easier than ever to relive your memories. Get collages of photos you took a year ago on this day.• CAST: View your photos and videos on your TV with Chromecast support.Note: Face grouping is not available in all countries.Continued use of GPS running in the background can dramatically decrease battery life. Google Photos doesn't run GPS in the background unless you give us permission by turning on optional features that require this.For the latest updates from the team, follow us on Twitter at @googlephotos",
    "In App Purchases": "No",
    "Name": "Solitaire·",
    "Number of Reviews (All Time)": "64988",
    "Number of Reviews (Current Versions) ": "3342",
    "Overall Rating": "5",
    "Rank": "41",
    "Rating of Current Version": "5",
    "Release": "Mar 08, 2017",
    "Seller": "Google, Inc.",
    "Size": " 158 MB",
    "Version": "2.11.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Social Networking",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Monkey is like omegle except for making new friends on Snapchat! When you're connected with a new person, you can add time to keep chatting. If the other person adds time too, the call goes on. You can also mutually add your new friends on Snapchat!",
    "In App Purchases": "No",
    "Name": "Monkey — have fun chats",
    "Number of Reviews (All Time)": "1411",
    "Number of Reviews (Current Versions) ": "345",
    "Overall Rating": "4.5",
    "Rank": "42",
    "Rating of Current Version": "4",
    "Release": "Feb 02, 2017",
    "Seller": "Monkey Squad, Inc.",
    "Size": " 55.1 MB",
    "Version": "1.4.1"
  },
  {
    "Age Restriction": "You must be at least 17 years old to download this app.",
    "Category": "Utilities",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "The best of Google in one app. Say “Ok Google” and find everything from nearby restaurants to the calories in cheesecake. Google also shows you the info you need before you ask, like updates on your favorite teams and traffic alerts.Talk instead of type:• Say “Ok Google” then ask a question* • Google will speak the answer aloudAsk Google to help you do things:• “What are good restaurants nearby?”• “Where is my package?”Personalize your feed and get notifications:• Start your morning with weather, news & traffic• Get updates on sports, movies & eventsMore about the Google app: http://www.google.com/search/about* requires iPhone 4s or later",
    "In App Purchases": "No",
    "Name": "Google — Search made just for mobile",
    "Number of Reviews (All Time)": "478684",
    "Number of Reviews (Current Versions) ": "260",
    "Overall Rating": "3.5",
    "Rank": "43",
    "Rating of Current Version": "4",
    "Release": "Mar 06, 2017",
    "Seller": "Google, Inc.",
    "Size": " 180 MB",
    "Version": "23.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Hotspot Shield VPN is the World’s most trusted security, privacy and access app. -\tAccess all websites and apps securely and privately from anywhere in the World.-\tStay private and anonymous online, preventing anyone from tracking your online activities.-\tGet protected from hackers and snoopers on public WiFi connections.Hotspot Shield Free VPN Proxy for iOS:- No Logs Kept: Hotspot Shield doesn’t track or keep any logs of its users and their activities. You are completely private with Hotspot Shield.- FREE and UNLIMITED: You have the choice to use basic features for free (forever) and unlimited, or simply upgrade to Elite for more features!- Trusted by millions: Trusted by more than 400 million global users and featured by Fortune, Forbes, TechCrunch, New York Times and many more renowned media.- No sign up, no registration, no credit cards: To use the basic features of the app, you don’t need to create an account or have a credit card!- Unparalleled VPN Performance: Hotspot Shield fully own all VPN servers and the proprietary servers ensure fastest VPN speed, and most stable & secured connections.- Largest VPN Coverage: Powered by AnchorFree, Hotspot Shield offers largest VPN coverage from 17 countries including US, UK, JP, IN, AU, CA, CN, TR, UA and more!- Support: We are striving to be the best security, privacy and access app for you, so we are always open to feedbacks and suggestions. Any questions, simply shoot an email to support@hsselite.com!Get Hotspot Shield Free VPN Proxy Now! And if you love us, don’t forget to spread the love by giving us 5-stars!-------------------------------------------■ Why Hotspot Shield VPN?Hotspot Shield VPN is the most trusted security, privacy and access platform with top performance on speed, stability and security.  Hotspot Shield enables users’ online activities, sites visited, searches and personally identifiable information to always stay private and secured. Get complete protection from cybercriminals - Hotspot Shield’s banking-level encryption hides your IP address from snoopers- Access all websites and apps securely and privately at home, school, work or anywhere on the go.- Get complete protection from cybercriminals- Enjoy complete anonymity - hide your IP address, identity, and location from websites and online trackers.- Protect yourself from hackers and snoopers from stealing your usernames, passwords, credit card information on public WiFi networks.■ Hotspot Shield Premium (Elite)- 7-day free trial - free of charge; no commitment; cancel anytime- Payment will be charged to iTunes Account at confirmation of purchase- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the period- Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal- Monthly as low as 11.99 dollars- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase- No cancellation of the current subscription is allowed during active subscription perio- Yearly as low as 29.99 dollars- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication.■ ABOUT AnchorFree™AnchorFree is a privately held, venture-backed company based in the Silicon Valley. Anchorfree believes in placing consumers in control of their personal information online. Anchorfree provides millions of users with online security, privacy and access through its most popular VPN product - Hotspot Shield. ■ Follow us on…Google+: plus.google.com/+HotspotShieldFacebook: facebook.com/hotspotshieldWebsite: https://www.hotspotshield.com/Lean About VPN Technology: https://goo.gl/tgL10zPrivacy: https://www.hotspotshield.com/privacy/Terms: https://www.hotspotshield.com/terms/Copyright © 2016 AnchorFree, Inc. All Rights Reserved",
    "In App Purchases": "Yes",
    "Name": "Hotspot Shield Free Privacy & Security VPN Proxy",
    "Number of Reviews (All Time)": "28501",
    "Number of Reviews (Current Versions) ": "1678",
    "Overall Rating": "4.5",
    "Rank": "44",
    "Rating of Current Version": "4.5",
    "Release": "Feb 28, 2017",
    "Seller": "AnchorFree Inc.",
    "Size": " 69.6 MB",
    "Version": "3.7.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Hotspot Shield VPN is the World’s most trusted security, privacy and access app. -\tAccess all websites and apps securely and privately from anywhere in the World.-\tStay private and anonymous online, preventing anyone from tracking your online activities.-\tGet protected from hackers and snoopers on public WiFi connections.Hotspot Shield Free VPN Proxy for iOS:- No Logs Kept: Hotspot Shield doesn’t track or keep any logs of its users and their activities. You are completely private with Hotspot Shield.- FREE and UNLIMITED: You have the choice to use basic features for free (forever) and unlimited, or simply upgrade to Elite for more features!- Trusted by millions: Trusted by more than 400 million global users and featured by Fortune, Forbes, TechCrunch, New York Times and many more renowned media.- No sign up, no registration, no credit cards: To use the basic features of the app, you don’t need to create an account or have a credit card!- Unparalleled VPN Performance: Hotspot Shield fully own all VPN servers and the proprietary servers ensure fastest VPN speed, and most stable & secured connections.- Largest VPN Coverage: Powered by AnchorFree, Hotspot Shield offers largest VPN coverage from 17 countries including US, UK, JP, IN, AU, CA, CN, TR, UA and more!- Support: We are striving to be the best security, privacy and access app for you, so we are always open to feedbacks and suggestions. Any questions, simply shoot an email to support@hsselite.com!Get Hotspot Shield Free VPN Proxy Now! And if you love us, don’t forget to spread the love by giving us 5-stars!-------------------------------------------■ Why Hotspot Shield VPN?Hotspot Shield VPN is the most trusted security, privacy and access platform with top performance on speed, stability and security.  Hotspot Shield enables users’ online activities, sites visited, searches and personally identifiable information to always stay private and secured. Get complete protection from cybercriminals - Hotspot Shield’s banking-level encryption hides your IP address from snoopers- Access all websites and apps securely and privately at home, school, work or anywhere on the go.- Get complete protection from cybercriminals- Enjoy complete anonymity - hide your IP address, identity, and location from websites and online trackers.- Protect yourself from hackers and snoopers from stealing your usernames, passwords, credit card information on public WiFi networks.■ Hotspot Shield Premium (Elite)- 7-day free trial - free of charge; no commitment; cancel anytime- Payment will be charged to iTunes Account at confirmation of purchase- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the period- Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal- Monthly as low as 11.99 dollars- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase- No cancellation of the current subscription is allowed during active subscription perio- Yearly as low as 29.99 dollars- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication.■ ABOUT AnchorFree™AnchorFree is a privately held, venture-backed company based in the Silicon Valley. Anchorfree believes in placing consumers in control of their personal information online. Anchorfree provides millions of users with online security, privacy and access through its most popular VPN product - Hotspot Shield. ■ Follow us on…Google+: plus.google.com/+HotspotShieldFacebook: facebook.com/hotspotshieldWebsite: https://www.hotspotshield.com/Lean About VPN Technology: https://goo.gl/tgL10zPrivacy: https://www.hotspotshield.com/privacy/Terms: https://www.hotspotshield.com/terms/Copyright © 2016 AnchorFree, Inc. All Rights Reserved",
    "In App Purchases": "Yes",
    "Name": "Rolling Sky",
    "Number of Reviews (All Time)": "28501",
    "Number of Reviews (Current Versions) ": "1678",
    "Overall Rating": "4.5",
    "Rank": "45",
    "Rating of Current Version": "4.5",
    "Release": "Feb 28, 2017",
    "Seller": "AnchorFree Inc.",
    "Size": " 69.6 MB",
    "Version": "3.7.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Hotspot Shield VPN is the World’s most trusted security, privacy and access app. -\tAccess all websites and apps securely and privately from anywhere in the World.-\tStay private and anonymous online, preventing anyone from tracking your online activities.-\tGet protected from hackers and snoopers on public WiFi connections.Hotspot Shield Free VPN Proxy for iOS:- No Logs Kept: Hotspot Shield doesn’t track or keep any logs of its users and their activities. You are completely private with Hotspot Shield.- FREE and UNLIMITED: You have the choice to use basic features for free (forever) and unlimited, or simply upgrade to Elite for more features!- Trusted by millions: Trusted by more than 400 million global users and featured by Fortune, Forbes, TechCrunch, New York Times and many more renowned media.- No sign up, no registration, no credit cards: To use the basic features of the app, you don’t need to create an account or have a credit card!- Unparalleled VPN Performance: Hotspot Shield fully own all VPN servers and the proprietary servers ensure fastest VPN speed, and most stable & secured connections.- Largest VPN Coverage: Powered by AnchorFree, Hotspot Shield offers largest VPN coverage from 17 countries including US, UK, JP, IN, AU, CA, CN, TR, UA and more!- Support: We are striving to be the best security, privacy and access app for you, so we are always open to feedbacks and suggestions. Any questions, simply shoot an email to support@hsselite.com!Get Hotspot Shield Free VPN Proxy Now! And if you love us, don’t forget to spread the love by giving us 5-stars!-------------------------------------------■ Why Hotspot Shield VPN?Hotspot Shield VPN is the most trusted security, privacy and access platform with top performance on speed, stability and security.  Hotspot Shield enables users’ online activities, sites visited, searches and personally identifiable information to always stay private and secured. Get complete protection from cybercriminals - Hotspot Shield’s banking-level encryption hides your IP address from snoopers- Access all websites and apps securely and privately at home, school, work or anywhere on the go.- Get complete protection from cybercriminals- Enjoy complete anonymity - hide your IP address, identity, and location from websites and online trackers.- Protect yourself from hackers and snoopers from stealing your usernames, passwords, credit card information on public WiFi networks.■ Hotspot Shield Premium (Elite)- 7-day free trial - free of charge; no commitment; cancel anytime- Payment will be charged to iTunes Account at confirmation of purchase- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the period- Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal- Monthly as low as 11.99 dollars- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase- No cancellation of the current subscription is allowed during active subscription perio- Yearly as low as 29.99 dollars- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication.■ ABOUT AnchorFree™AnchorFree is a privately held, venture-backed company based in the Silicon Valley. Anchorfree believes in placing consumers in control of their personal information online. Anchorfree provides millions of users with online security, privacy and access through its most popular VPN product - Hotspot Shield. ■ Follow us on…Google+: plus.google.com/+HotspotShieldFacebook: facebook.com/hotspotshieldWebsite: https://www.hotspotshield.com/Lean About VPN Technology: https://goo.gl/tgL10zPrivacy: https://www.hotspotshield.com/privacy/Terms: https://www.hotspotshield.com/terms/Copyright © 2016 AnchorFree, Inc. All Rights Reserved",
    "In App Purchases": "Yes",
    "Name": "Mobile Strike",
    "Number of Reviews (All Time)": "28501",
    "Number of Reviews (Current Versions) ": "1678",
    "Overall Rating": "4.5",
    "Rank": "46",
    "Rating of Current Version": "4.5",
    "Release": "Feb 28, 2017",
    "Seller": "AnchorFree Inc.",
    "Size": " 69.6 MB",
    "Version": "3.7.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Hotspot Shield VPN is the World’s most trusted security, privacy and access app. -\tAccess all websites and apps securely and privately from anywhere in the World.-\tStay private and anonymous online, preventing anyone from tracking your online activities.-\tGet protected from hackers and snoopers on public WiFi connections.Hotspot Shield Free VPN Proxy for iOS:- No Logs Kept: Hotspot Shield doesn’t track or keep any logs of its users and their activities. You are completely private with Hotspot Shield.- FREE and UNLIMITED: You have the choice to use basic features for free (forever) and unlimited, or simply upgrade to Elite for more features!- Trusted by millions: Trusted by more than 400 million global users and featured by Fortune, Forbes, TechCrunch, New York Times and many more renowned media.- No sign up, no registration, no credit cards: To use the basic features of the app, you don’t need to create an account or have a credit card!- Unparalleled VPN Performance: Hotspot Shield fully own all VPN servers and the proprietary servers ensure fastest VPN speed, and most stable & secured connections.- Largest VPN Coverage: Powered by AnchorFree, Hotspot Shield offers largest VPN coverage from 17 countries including US, UK, JP, IN, AU, CA, CN, TR, UA and more!- Support: We are striving to be the best security, privacy and access app for you, so we are always open to feedbacks and suggestions. Any questions, simply shoot an email to support@hsselite.com!Get Hotspot Shield Free VPN Proxy Now! And if you love us, don’t forget to spread the love by giving us 5-stars!-------------------------------------------■ Why Hotspot Shield VPN?Hotspot Shield VPN is the most trusted security, privacy and access platform with top performance on speed, stability and security.  Hotspot Shield enables users’ online activities, sites visited, searches and personally identifiable information to always stay private and secured. Get complete protection from cybercriminals - Hotspot Shield’s banking-level encryption hides your IP address from snoopers- Access all websites and apps securely and privately at home, school, work or anywhere on the go.- Get complete protection from cybercriminals- Enjoy complete anonymity - hide your IP address, identity, and location from websites and online trackers.- Protect yourself from hackers and snoopers from stealing your usernames, passwords, credit card information on public WiFi networks.■ Hotspot Shield Premium (Elite)- 7-day free trial - free of charge; no commitment; cancel anytime- Payment will be charged to iTunes Account at confirmation of purchase- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the period- Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal- Monthly as low as 11.99 dollars- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase- No cancellation of the current subscription is allowed during active subscription perio- Yearly as low as 29.99 dollars- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication.■ ABOUT AnchorFree™AnchorFree is a privately held, venture-backed company based in the Silicon Valley. Anchorfree believes in placing consumers in control of their personal information online. Anchorfree provides millions of users with online security, privacy and access through its most popular VPN product - Hotspot Shield. ■ Follow us on…Google+: plus.google.com/+HotspotShieldFacebook: facebook.com/hotspotshieldWebsite: https://www.hotspotshield.com/Lean About VPN Technology: https://goo.gl/tgL10zPrivacy: https://www.hotspotshield.com/privacy/Terms: https://www.hotspotshield.com/terms/Copyright © 2016 AnchorFree, Inc. All Rights Reserved",
    "In App Purchases": "Yes",
    "Name": "Subway Surfers",
    "Number of Reviews (All Time)": "28501",
    "Number of Reviews (Current Versions) ": "1678",
    "Overall Rating": "4.5",
    "Rank": "47",
    "Rating of Current Version": "4.5",
    "Release": "Feb 28, 2017",
    "Seller": "AnchorFree Inc.",
    "Size": " 69.6 MB",
    "Version": "3.7.1"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Entertainment",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Hulu brings you instant access to all of your favorite television shows, the hottest new series and the latest movies, all streaming in one place. Watch TV shows, current episodes, full seasons of all the hit series you want on demand. Watch movies, trailers, kids shows, cartoons, family films and more. Hulu gives you the latest episodes of popular dramas like Nashville, Bones, The Bachelor, PowerPuff Girls, The Path, Empire and past seasons of hit shows like Seinfeld, South Park, and Parks and Recreation.Hulu has an amazing library of family entertainment including shows in HD from channels like FOX, NBC, HBO, NBC, Disney, ABC, CBS, Comedy Central, Cartoon Network, PBS, FX, USA Network, A&E, MTV, Miramax & many more.Features:• Catch up on the latest HD episodes of current television shows from channels like ABC, FOX, HBO and CBS like Empire, Grey’s Anatomy, Once Upon A Time and Blindspot. Watch VOD premium original drama series like The Path, 11.22.63, The Mindy Project, Casual, East Los High, Difficult People and much more.• Enjoy previous seasons on demand of great comedy classic Seinfeld, gripping crime series drama with CSI: Crime Scene Investigation, Law & Order: SVU and comedy like South Park.• Stream popular kids films, cartoons and television programs including Curious George, Adventure Time and classics such as Doug and Rugrats. Watch great entertainment with kids shows streaming from Cartoon Network, Disney, Nickelodeon and other great kids TV networks.• Keep your family safe; let your children watch Disney cartoons and all the CN shows they want, but set Kids Lock so they are kept in the Kids hub.• Episodes of some of TVs current greatest shows on demand as well as HD streams (when available).• Choose the latest popular programs or catch up on great entertainment classics from channels like FOX, NBC, HBO, ABC, CBS, Comedy Central, Cartoon Network, PBS, FX. Watch Disney, USA Network, A&E, MTV, Miramax all on-demand.There are also great hit movies and new trailers streaming on Hulu – from family and kids movies to drama, crime and horror to cartoons to comedy – Interstellar, Spectre, The Hunger Games and many more. Enjoy full seasons on demand of hit current shows from channels such as ABC, FOX, HBO, NBC and CBS, great films and cartoons, many in HD and VOD. With Hulu you can start enjoying the world of streaming entertainment instantly.If you are new to Hulu, your base Hulu subscription fee will be charged $7.99/month for our Limited Commercials plan or $13.99/month for our No Commercials plan through your iTunes account as a recurring transaction starting at the end of your 1 month free trial (unless you cancel during the free trial). Payment will automatically renew unless you cancel your account or turn off auto-renew at least 24 hours before the end of the current subscription month. You can manage your subscription, cancel anytime, or turn off auto-renewal by accessing your iTunes account. Hulu is available to US customers only.Terms of Use: http://www.hulu.com/termsPrivacy Policy: http://www.hulu.com/privacyThis app features third party software, enabling third parties to calculate measurement statistics (e.g., Nielsen’s TV Ratings). To learn more, please visit our privacy policy.We may work with mobile advertising companies to help deliver online and in-app advertisements tailored to your interests based on your activities on our website and apps and on other, unaffiliated website and apps. To learn more, visit www.aboutads.info. To opt-out of online interest-based advertising, visit www.aboutads.info/choices. To opt-out of cross-app advertising, download the App Choices app at www.aboutads.info/appchoices. We are committed to complying with the DAA’s Self-Regulatory Principles for Online Behavioral Advertising and the DAA’s Application of Self-Regulatory Principles for the Mobile Environment.",
    "In App Purchases": "Yes",
    "Name": "Hulu: Watch TV Shows & Stream the Latest Movies",
    "Number of Reviews (All Time)": "55401",
    "Number of Reviews (Current Versions) ": "412",
    "Overall Rating": "2",
    "Rank": "48",
    "Rating of Current Version": "2.5",
    "Release": "Feb 14, 2017",
    "Seller": "Information Not Available",
    "Size": " 99.6 MB",
    "Version": "4.10.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Six! is the latest title from Gram Games, makers of the global smash hits, 1010! and Merged!. This newest game is challenging, exciting, and even infuriating, at times. Like all great puzzles, Six! will keep you entertained for just a moment, or will keep you engaged for hours of fun.The game concept is simple: there is a tower of blocks of various shapes, upon which sits another hexagonal block. The aim of the game is to move the hexagon down the screen to earn points. To do this, you tap the different blocks, which will make them disappear. The hexagon can then fall into the empty space left behind.Sounds simple enough, right? Wrong. As the blocks are destroyed, the hexagon will start to wobble and roll, and the tower will begin to tilt. It is your job to keep the tower balanced, and the hexagon from gaining momentum and rolling of. To do so, remove blocks strategically, and ensure that their removal won’t throw everything off balance. If the hexagon tips into the abyss, it’s game over, and you’ll have to start over again.Challenging, exciting, and surprisingly simple to play, Six! will have you hooked immediately. Like Gram’s other hits, the gameplay is simple and fun, but earning a spot on the leaderboard and competing with friends provides both a challenge, and a reward.Key Features●    Easy to learn, and fun to master gameplay●    Challenge your friend’s high scores, challenge the world●    Fun, colorful and engaging graphics●    Exciting and addictive●    Fun four hours, or just a few minutes",
    "In App Purchases": "Yes",
    "Name": "Six!",
    "Number of Reviews (All Time)": "13483",
    "Number of Reviews (Current Versions) ": "223",
    "Overall Rating": "4.5",
    "Rank": "49",
    "Rating of Current Version": "4.5",
    "Release": "Mar 15, 2017",
    "Seller": "Gram Games Limited",
    "Size": " 113 MB",
    "Version": "2.1.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Create fun, one-of-a-kind layouts by remixing your own photos and sharing them with your friends. Choose photos from your camera roll—or use the built-in Photo Booth to take spur-of-the-moment shots—and instantly see them laid out in various combinations. Pick the layout you like best, then edit it to make it your own.Layout's smooth, intuitive process gives you complete creative control. Tap to mirror, flip or replace images, hold and drag to swap them, pinch to zoom in or out, or pull the handles to resize. You're the editor, so get creative—tell a story, show off an outfit or just splice, dice and change the look of your regular photos to convey a mood or theme. FEATURES* Re-mix up to 9 of your photos at a time to create fun, personalized layouts.* Use the Faces tab to quickly find photos with people in them.  * Capture the moment in Photo Booth mode with quick, spontaneous shots.  * Save your layouts to your camera roll and share them seamlessly to Instagram or other networks.* Easily see the last 30 photos you've selected in the Recents tab. * Pair your layouts with Instagram's filters and creative tools afterwards to make them stand out even more. * Download and start creating immediately. No signup or account required—and no clutter breaking up your flow.",
    "In App Purchases": "No",
    "Name": "Layout from Instagram",
    "Number of Reviews (All Time)": "11905",
    "Number of Reviews (Current Versions) ": "1650",
    "Overall Rating": "4.5",
    "Rank": "50",
    "Rating of Current Version": "4.5",
    "Release": "Dec 05, 2016",
    "Seller": "Instagram, Inc.",
    "Size": " 9.4 MB",
    "Version": "1.2.4"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Over 125,000,000 downloads worldwide!Play now the #1 addictive game of the year!Tap the ball carefully through each obstacle and your ball will switch color with some powerups.You must follow the color pattern on each obstacle to cross it ! Be careful not to pass through the wrong color, or you’ll have to start again.",
    "In App Purchases": "Yes",
    "Name": "Color Switch",
    "Number of Reviews (All Time)": "137610",
    "Number of Reviews (Current Versions) ": "721",
    "Overall Rating": "4.5",
    "Rank": "51",
    "Rating of Current Version": "4.5",
    "Release": "Mar 16, 2017",
    "Seller": "Fortafy Games DMCC",
    "Size": " 69.1 MB",
    "Version": "6.80"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "A New Kind of Mario game you can play with one hand.Mario constantly runs forward, while you time your taps to pull off stylish jumps and moves to gather coins and reach the goal!Super Mario Run can be downloaded for free and after you purchase the game, you will be able to play all the modes with no additional payment required. You can try out all the modes before purchase; “World Tour” the mode where you clear courses, “Toad Rally” where you compete with friends and players around the world, and “Kingdom Builder” where you can create your own kingdom.*Internet connectivity required to play. Data charges may apply.■World TourRun and jump with style to rescue Princess Peach from Bowser’s clutches! Travel through plains, caverns, Ghost Houses, airships, castles, and more …To reach Bowser’s Castle, clear 6 worlds filled with 24 brand-new courses designed for game play on the iPhone and iPad. There are many ways to enjoy the new courses, such as collecting the 3 different types of colored coins per level or by competing for the highest score against your friends.You can try course 1-1 to 1-3 for free, and after purchase, you gain access to play all 24 courses. ■Toad RallyShow off Mario’s stylish moves, compete against your friends and challenge people from all over the world.A challenge mode where the competition differs each time you play.Compete against the stylish moves of other players for the highest score as you gather coins and get cheered on by a crowd of Toads. Fill the gauge with stylish moves to enter “Coin Rush Mode” to get more coins. If you win the rally, the cheering Toads will come live in your kingdom. Rally tickets are necessary to play “Toad Rally”. You can get rally tickets in \"World Tour\" as well as in \"Kingdom Builder\" from bonus games and ? Block.■Kingdom BuilderGather coins and Toads to build your very own kingdom.Create your unique kingdom by using coins to acquire buildings and decorations that you acquire with the help of Toads gathered in “Toad Rally”. There are over 100 kinds of items in the Kingdom Builder mode. There are even buildings that add playable characters in World Tour and Toad Rally.■Additional Information＊We permit our third-party partners to collect data from this app for analytical purposes.",
    "In App Purchases": "Yes",
    "Name": "Super Mario Run",
    "Number of Reviews (All Time)": "83855",
    "Number of Reviews (Current Versions) ": "1142",
    "Overall Rating": "2.5",
    "Rank": "52",
    "Rating of Current Version": "3",
    "Release": "Feb 21, 2017",
    "Seller": "Nintendo Co., Ltd.",
    "Size": " 207 MB",
    "Version": "1.1.2"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Music",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get unlimited music and thousands of radio stations all in one app. Download iHeartRadio today and listen to top radio stations, music, news, podcasts, sports, talk and comedy shows. iHeartRadio is easy to use and best of all it’s FREE. Get The Best Local Radio Stations and Podcasts• Discover thousands of live AM and FM stations near you and from cities across the globe • Listen to sports radio stations like ESPN Radio, Fox Sports and more• Stream podcasts from famous personalities like Ryan Seacrest, Colin Cowherd, Sean Hannity, Elvis Duran and Bobby BonesPlay Free Artist StationsCreate personalized music stations based on today’s top artists using a library of millions of songs covering genres like Country, Top 40, Rap, EDM, Rock, Alternative and more.The Ultimate Station Made Just for YouMy Favorites Radio collects all of the songs you love in one free personalized station. Premium FeaturesTake control of your listening experience with millions of songs on demand. Choose the plan that’s right for you with iHeartRadio Plus™ and iHeartRadio All Access™.•\tSave and replay any song from the radio•\tEnjoy unlimited skips•\tListen offline•\tCreate unlimited playlistsJoin our community!• Facebook: http://on.fb.me/1F1TcFX• Instagram: http://bit.ly/1e1AOUS• Twitter: http://bit.ly/1HZk5KQ• Blog: http://bit.ly/1GiT59DFor Feedback and HelpTell us how we can improve by sharing your thoughts at http://help.iheartradio.com!For additional help and to find answers to common questions for iPhone and iPad devices, please visit https://help.iheart.com/hc/en-us/sections/204008308-iPhone-iPadPlease note: This app features Nielsen’s proprietary measurement software which may allow you to contribute to market research, like Nielsen's TV Ratings. To learn more about our digital measurement products and your choices in regard to them, please visit http://www.nielsen.com/digitalprivacy for more information.",
    "In App Purchases": "Yes",
    "Name": "iHeartRadio – Free Music & Radio Stations",
    "Number of Reviews (All Time)": "289527",
    "Number of Reviews (Current Versions) ": "427",
    "Overall Rating": "3.5",
    "Rank": "53",
    "Rating of Current Version": "4.5",
    "Release": "Mar 13, 2017",
    "Seller": "Information Not Available",
    "Size": " 119 MB",
    "Version": "7.2.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 6.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Winner of Apple Design Awards 2015!A strategic driving game from the award-winning maker’s of Smash Hit. Does not Commute is a temporal paradox in which you have no one to blame but yourself. What starts out as a relaxing commute in a small town of the 1970's quickly devolves into traffic chaos with hot dog trucks, sports cars, school buses and dozens of other vehicles. You drive them all. Plan ahead. Don't be late.In this small town, discover the characters and their secrets – what world-changing experiment is inventive dentist Dr Charles Schneider hiding? Will Mr Baker quit his job in advertising? What is that strange mask on Mrs Griffin's face? Will Mr Mayfield’s peculiar obsession with Yorkshire Terriers take over his life?Does Not Commute is playable at no cost and free from ads.  An optional premium upgrade is available through a one-time in-app purchase that will enable the ability to continue from checkpoints.",
    "In App Purchases": "Yes",
    "Name": "Does not Commute",
    "Number of Reviews (All Time)": "5486",
    "Number of Reviews (Current Versions) ": "1398",
    "Overall Rating": "4",
    "Rank": "54",
    "Rating of Current Version": "4.5",
    "Release": "Jan 15, 2016",
    "Seller": "Mediocre AB",
    "Size": " 87.5 MB",
    "Version": "1.4.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "“The best email app for the iPhone.” - The VergeMeet Outlook for iOS, the app that helps millions of users connect all their email accounts, calendars and files in one convenient spot. Newly redesigned, Outlook for iOS lets you do more from one powerful inbox.See what matters most first with the Focused inbox that keeps the important messages on top. Switch between your emails and calendar to schedule your next meeting or share your availability with just a few taps. Or grab a document from your Files list and attach it to an email seamlessly.With everything you need only a tap away, managing your busy days is now easier than ever. Outlook for iOS works with Microsoft Exchange, Office 365, Outlook.com (including Hotmail and MSN), Gmail, Yahoo Mail, and iCloud.--Here’s what you’ll love about Outlook for iOS: Seamless inbox management- A “Focused” inbox that displays your most important messages first. The more you use it, the smarter it gets. - Swipe gestures to quickly schedule, delete and archive messages. - Smart filters to help you sort through your inbox.Easy access to calendar and files- Share your meeting availability with just a tap and easily find times to meet with others.- View and attach any file from your email, OneDrive, Dropbox, and more, without having to download them to your phone.Work on the go- Open Word, Excel, or other Office document attachments to edit them directly in the corresponding app and attach them back to an email. - Set your Out of Office messages directly from your iPhone or iPad. - Multitask seamlessly on iPad with full Split View support in iOS 9.--Like Outlook?Try other great Microsoft apps for iOS: Word, Excel, PowerPoint, OneNote, OneDrive, Skype, and Wunderlist.",
    "In App Purchases": "No",
    "Name": "Microsoft Outlook - email and calendar",
    "Number of Reviews (All Time)": "30775",
    "Number of Reviews (Current Versions) ": "147",
    "Overall Rating": "3.5",
    "Rank": "55",
    "Rating of Current Version": "3",
    "Release": "Mar 14, 2017",
    "Seller": "Information Not Available",
    "Size": " 172 MB",
    "Version": "2.16.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Photo & Video",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "“The best email app for the iPhone.” - The VergeMeet Outlook for iOS, the app that helps millions of users connect all their email accounts, calendars and files in one convenient spot. Newly redesigned, Outlook for iOS lets you do more from one powerful inbox.See what matters most first with the Focused inbox that keeps the important messages on top. Switch between your emails and calendar to schedule your next meeting or share your availability with just a few taps. Or grab a document from your Files list and attach it to an email seamlessly.With everything you need only a tap away, managing your busy days is now easier than ever. Outlook for iOS works with Microsoft Exchange, Office 365, Outlook.com (including Hotmail and MSN), Gmail, Yahoo Mail, and iCloud.--Here’s what you’ll love about Outlook for iOS: Seamless inbox management- A “Focused” inbox that displays your most important messages first. The more you use it, the smarter it gets. - Swipe gestures to quickly schedule, delete and archive messages. - Smart filters to help you sort through your inbox.Easy access to calendar and files- Share your meeting availability with just a tap and easily find times to meet with others.- View and attach any file from your email, OneDrive, Dropbox, and more, without having to download them to your phone.Work on the go- Open Word, Excel, or other Office document attachments to edit them directly in the corresponding app and attach them back to an email. - Set your Out of Office messages directly from your iPhone or iPad. - Multitask seamlessly on iPad with full Split View support in iOS 9.--Like Outlook?Try other great Microsoft apps for iOS: Word, Excel, PowerPoint, OneNote, OneDrive, Skype, and Wunderlist.",
    "In App Purchases": "No",
    "Name": "Mixtiles",
    "Number of Reviews (All Time)": "30775",
    "Number of Reviews (Current Versions) ": "147",
    "Overall Rating": "3.5",
    "Rank": "56",
    "Rating of Current Version": "3",
    "Release": "Mar 14, 2017",
    "Seller": "Information Not Available",
    "Size": " 172 MB",
    "Version": "2.16.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "musical.ly is the world’s largest creative platform. The platform makes it super easy for everyone to make awesome videos and share with friends or to the world. Top categories on musical.ly include:musiccomedytalent (sing, dance, magic, etc.) fashion & beautyvloganimals* Any feedback? Contact us at support@musical.ly or tweet us @musicallyapp* Requires iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch. Optimised for iPhone 6, iPhone 6s, iPhone 7 and latest models. Performance of this app on iPhone 5c or earlier iOS device is not fine-tuned.",
    "In App Purchases": "Yes",
    "Name": "musical.ly - your video social network",
    "Number of Reviews (All Time)": "100212",
    "Number of Reviews (Current Versions) ": "105",
    "Overall Rating": "4.5",
    "Rank": "57",
    "Rating of Current Version": "4",
    "Release": "Mar 20, 2017",
    "Seller": "musical.ly inc.",
    "Size": " 231 MB",
    "Version": "5.4.2"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Health & Fitness",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Lose weight with MyFitnessPal, the fastest and easiest-to-use calorie counter for iOS. With the largest food database by far (over 5,000,000 foods) and amazingly fast and easy food and exercise entry, we'll help you take those extra pounds off! And it's FREE! There is no better diet app - period. • Consumer Reports #1 rated diet• PC Magazine Editor’s Choice Selection• #1 Health and Fitness app for 4 years straightAlso featured in the NY Times, Wall Street Journal, Wired, USA Today, Family Circle, Marie Claire, NBC, CNET, Shape, the Today Show and more.USER REVIEWS• “The first diet tool that has ever worked for me! I’ve lost 30 pounds!”• “This is the best calorie counter, free or paid, and I’ve tried them all.”• “The food database is HUGE! I’ve NEVER had a missing food.”• “This app takes seconds to use, it’s that simple.”WHY WE’RE BETTER THAN OTHER APPS• FREE – sign up with no strings attached• Track your diet and exercise in less than 5 minutes a day! It's that fast and easy• Largest food database of any iPhone calorie counter – over 5,000,000 foods and growing daily• Easiest and fastest food entry – remembers your favorites, add multiple foods at once, save and add entire meals, and more. THERE IS NO FASTER OR EASIER APP THAN MYFITNESSPAL.• Connect with over 50 devices and apps including Apple Health, Fitbit, Jawbone UP, Garmin, MapMyFitness, Runkeeper, Strava, Runtastic, Misfit, Withings, and more! • Recipe importer - cook a lot? Our recipe importer lets you visit any recipe on the web and easily import and track it with just a tap! It feels like magic!• Built-in step tracker - iPhone 5S/6/6+ users can track steps right from their phone, no separate tracker required• MYFITNESSPAL WORKS – our members have lost almost 200 MILLION POUNDS combined! EASIEST APP TO TRACK DIET & EXERCISE• 5,000,000+ food database of global items and cuisines. Virtually every food you eat is in our database already• Barcode scanner - track a food just by scanning it's barcode. Over 4 million barcodes recognized!• Step tracker - iPhone 5S and iPhone 6/6+ users can track steps and overall calorie burn right from their phone. No separate tracker required!• Track all major nutrients: calories, fat, protein, carbs, sugar, fiber, cholesterol, and moreCONNECT APPS & DEVICES• Easily connects and seamless integrates with over 50 apps and devices including Apple Health, Fitbit, Jawbone UP, Garmin, MapMyFitness, Runkeeper, Strava, Runtastic, Misfit, Withings, and more! Works with virtually every fitness app and device.GET SUPPORT • Connect with friends and easily track and motivate each other, or meet new friends from the MyFitnessPal community!GOALS & REPORTS• Received personalized goals based on your individual diet profile, or enter your own goals if you’ve gotten specific recommendations from a doctor, nutritionist, etc.• Gain insights into where your calories and nutrients are coming from and how to make healthier choices• View charts of your progress over time for motivationWhy wait? It is free to sign up so you have nothing to lose except those extra pounds! Download us and start leading a healthier life today!SUBSCRIPTION PRICING & TERMSMyFitnessPal is free to download and use. Should you choose to upgrade to MyFitnessPal Premium, we offer two auto-renewing subscription options:$9.99/month$49.99/yearPayment will be charged to your credit card through your iTunes account at confirmation of purchase. Subscription renews automatically unless cancelled at least 24 hours prior to the end of the subscription period. There is no increase in price when renewing.Subscriptions can be managed and auto-renewal turned off in Account Settings in iTunes after purchase. Once purchased, refunds will not be provided for any unused portion of the term.Read our full Terms of Service and our Privacy Policy at http://www.myfitnesspal.com/account/terms_and_privacy.",
    "In App Purchases": "Yes",
    "Name": "Calorie Counter & Diet Tracker by MyFitnessPal",
    "Number of Reviews (All Time)": "502901",
    "Number of Reviews (Current Versions) ": "850",
    "Overall Rating": "4.5",
    "Rank": "58",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Information Not Available",
    "Size": " 137 MB",
    "Version": "7.10"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Finance",
    "Compatibility": "iOS 9.3 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Venmo is the simple and fun way to send and receive money between friends. Whether you’re splitting a dinner bill, concert tickets, or the cost of a road trip, Venmo removes the awkward talks over who owes what.Just send or request your payment with a message or emoji combo of your choice, then comment on and like all your favorite splitting moments.“#1 app college students should download right now” – BuzzFeedA few more quotes that make us blush:“One of the 50 Best Apps of the Year” – Time“The crown jewel of all finance apps” – Forbes“Revolutionized the mobile payment space” – Vanity Fair\"Just Venmo me” has become synonymous with \"pay me back\" or \"I got it.\" - Business InsiderThe Venmo magic:• Transfer money easily and quickly using a friend's name, @username, phone, or email.• Find friends automatically by syncing your Facebook or phone contacts.• Stay in control of what you owe, what friends owe you and what you’ve bought.• Make purchases in select apps using Venmo, so you can split and share your finds with friends more easily.• Venmo uses data encryption to protect your financial information. That means we keep your actual card or bank information private by not sharing it when you send money or make purchases.Venmo is a service of PayPal, Inc., a licensed provider of money transfer services. All money transmission is provided by PayPal, Inc. pursuant to PayPal, Inc.'s licenses. Visit https://venmo.com/legal/us-licenses/ for additional information. © 2017 PayPal.",
    "In App Purchases": "No",
    "Name": "Venmo",
    "Number of Reviews (All Time)": "15612",
    "Number of Reviews (Current Versions) ": "62",
    "Overall Rating": "4.5",
    "Rank": "59",
    "Rating of Current Version": "3.5",
    "Release": "Mar 20, 2017",
    "Seller": "The Delancey Corporation, LLC",
    "Size": " 64.6 MB",
    "Version": "7.0.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Social Networking",
    "Compatibility": "iOS 9.3 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Venmo is the simple and fun way to send and receive money between friends. Whether you’re splitting a dinner bill, concert tickets, or the cost of a road trip, Venmo removes the awkward talks over who owes what.Just send or request your payment with a message or emoji combo of your choice, then comment on and like all your favorite splitting moments.“#1 app college students should download right now” – BuzzFeedA few more quotes that make us blush:“One of the 50 Best Apps of the Year” – Time“The crown jewel of all finance apps” – Forbes“Revolutionized the mobile payment space” – Vanity Fair\"Just Venmo me” has become synonymous with \"pay me back\" or \"I got it.\" - Business InsiderThe Venmo magic:• Transfer money easily and quickly using a friend's name, @username, phone, or email.• Find friends automatically by syncing your Facebook or phone contacts.• Stay in control of what you owe, what friends owe you and what you’ve bought.• Make purchases in select apps using Venmo, so you can split and share your finds with friends more easily.• Venmo uses data encryption to protect your financial information. That means we keep your actual card or bank information private by not sharing it when you send money or make purchases.Venmo is a service of PayPal, Inc., a licensed provider of money transfer services. All money transmission is provided by PayPal, Inc. pursuant to PayPal, Inc.'s licenses. Visit https://venmo.com/legal/us-licenses/ for additional information. © 2017 PayPal.",
    "In App Purchases": "No",
    "Name": "Skype for iPhone",
    "Number of Reviews (All Time)": "15612",
    "Number of Reviews (Current Versions) ": "62",
    "Overall Rating": "4.5",
    "Rank": "60",
    "Rating of Current Version": "3.5",
    "Release": "Mar 20, 2017",
    "Seller": "The Delancey Corporation, LLC",
    "Size": " 64.6 MB",
    "Version": "7.0.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Shopping",
    "Compatibility": "iOS 9.3 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Venmo is the simple and fun way to send and receive money between friends. Whether you’re splitting a dinner bill, concert tickets, or the cost of a road trip, Venmo removes the awkward talks over who owes what.Just send or request your payment with a message or emoji combo of your choice, then comment on and like all your favorite splitting moments.“#1 app college students should download right now” – BuzzFeedA few more quotes that make us blush:“One of the 50 Best Apps of the Year” – Time“The crown jewel of all finance apps” – Forbes“Revolutionized the mobile payment space” – Vanity Fair\"Just Venmo me” has become synonymous with \"pay me back\" or \"I got it.\" - Business InsiderThe Venmo magic:• Transfer money easily and quickly using a friend's name, @username, phone, or email.• Find friends automatically by syncing your Facebook or phone contacts.• Stay in control of what you owe, what friends owe you and what you’ve bought.• Make purchases in select apps using Venmo, so you can split and share your finds with friends more easily.• Venmo uses data encryption to protect your financial information. That means we keep your actual card or bank information private by not sharing it when you send money or make purchases.Venmo is a service of PayPal, Inc., a licensed provider of money transfer services. All money transmission is provided by PayPal, Inc. pursuant to PayPal, Inc.'s licenses. Visit https://venmo.com/legal/us-licenses/ for additional information. © 2017 PayPal.",
    "In App Purchases": "No",
    "Name": "Groupon - Deals, Coupons & Discount Shopping App",
    "Number of Reviews (All Time)": "15612",
    "Number of Reviews (Current Versions) ": "62",
    "Overall Rating": "4.5",
    "Rank": "61",
    "Rating of Current Version": "3.5",
    "Release": "Mar 20, 2017",
    "Seller": "The Delancey Corporation, LLC",
    "Size": " 64.6 MB",
    "Version": "7.0.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Lifestyle",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "You’re not just looking for a house. You’re looking for a place for your life to happen™. Zillow’s top-rated real estate app opens the door to millions of homes for sale and rent across the U.S., including real estate listings you won’t find anywhere else. Compare industry-exclusive Zestimate® home values for more than 100 million homes nationwide. Using our app’s real estate search options, you can view photos and videos of listed homes near top-rated schools, find apartments near the city center or discover your dream vacation home with a view. The Zillow app helps you stay on top of your local real estate market with up-to-date listings and instant notifications about new homes in your search area, price changes and more.Zillow also has tools to help you determine your budget and find and contact a local real estate agent or property manager. We also make the home buying process easier with tools to connect you with trusted lenders for mortgage pre-approval and custom mortgage quotes.The Zillow real estate app has everything you need to find your way home while on the go.Key features:• Browse U.S. homes for sale and for rent, including more than 1 million listings you won’t find on an MLS.• See the Zestimate® of nearly any home in the U.S. and see Rent Zestimates® (estimated monthly rental prices) on most homes and apartments.• Receive instant notifications when new listings hit the market, drop in price or are sold. • Find a local lender in minutes who can pre-approve you for a mortgage. Getting pre-approved can show sellers that you’re a serious and credible buyer.• Access mortgage calculators, real-time mortgage rates and personalized loan quotes.• Looking for a home with family or friends? Try Zillow for iMessage to easily share homes you’ve recently viewed or saved, get immediate feedback and make plans to visit. To enable the feature, tap the app store logo within Messages and navigate to the Manage tab.• Get detailed ratings and reviews on public and private schools in your desired area. Use custom search tools to find homes based on school ratings and boundaries.• Create a Renter Profile to grab the attention of potential landlords and property managers, and increase your chance of securing the perfect rental.• Only on Zillow: Get FREE access to foreclosure information across the nation. View foreclosure listings in your area, including pre-foreclosures, foreclosure auctions and bank-owned properties. • For Apple Watch users, receive instant notifications about nearby homes and saved searches directly on your watch. Use your watch to browse photos and home details, favorite a home or check the Zestimate® of a nearby home.• Find every type of property: single-family homes, apartments, townhomes, condos and more. • Search three ways: Search from where you are (via GPS locator), type in an address or draw a custom region on the map.• Filter searches by price, beds, baths, keywords and more.• Save your favorite homes and searches, then view them on Zillow.com or any mobile device.• Contact a local agent to tour a home.Note: Continued use of GPS running in the background can dramatically decrease battery life.",
    "In App Purchases": "No",
    "Name": "Zillow Real Estate - Homes for Sale & for Rent",
    "Number of Reviews (All Time)": "226894",
    "Number of Reviews (Current Versions) ": "464",
    "Overall Rating": "4",
    "Rank": "62",
    "Rating of Current Version": "4",
    "Release": "Mar 13, 2017",
    "Seller": "Information Not Available",
    "Size": " 135 MB",
    "Version": "10.3.5"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Dropbox is the place for your photos, docs, videos, and other files. Files you keep in Dropbox are safely backed up and you can get to them from all your devices. It’s easy to send large files to anyone, even if they don’t have a Dropbox account.Features:\t•\tAccess your files on any device, even if you’re offline\t•\tCreate and edit Microsoft Office files from your iPhone or iPad\t•\tShare links to your largest files without using email attachmentsWe offer in-app purchases for Dropbox Pro, which includes 1 TB of storage and additional features. The amount will be charged to your iTunes account and will vary by plan and country. You’ll see the total price before completing payment.Dropbox Pro subscriptions purchased in-app renew monthly or yearly depending on your plan. Plans are priced at $9.99USD monthly and $99.99USD yearly (pricing may vary in countries other than the U.S.). To avoid renewal, you must turn off auto-renew at least 24 hours before your subscription ends. You can turn off auto-renew at any time from your iTunes account settings. Dropbox also offers one-month trials for monthly subscriptions.Terms of Service: https://www.dropbox.com/pricing_termsPrivacy Policy: https://www.dropbox.com/privacy",
    "In App Purchases": "Yes",
    "Name": "Dropbox",
    "Number of Reviews (All Time)": "49371",
    "Number of Reviews (Current Versions) ": "75",
    "Overall Rating": "3.5",
    "Rank": "63",
    "Rating of Current Version": "3",
    "Release": "Mar 08, 2017",
    "Seller": "Dropbox, Inc.",
    "Size": " 156 MB",
    "Version": "38.3"
  },
  {
    "Age Restriction": "Rated 9+ ",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Enter the Arena! From the creators of Clash of Clans comes a real-time multiplayer game starring the Royales, your favorite Clash characters and much, much more.Collect and upgrade dozens of cards featuring the Clash of Clans troops, spells and defenses you know and love, as well as the Royales: Princes, Knights, Baby Dragons and more. Knock the enemy King and Princesses from their towers to defeat your opponents and win Trophies, Crowns and glory in the Arena. Form a Clan to share cards and build your very own battle community. Lead the Clash Royale Family to victory!PLEASE NOTE! Clash Royale is free to download and play, however, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings. Also, under our Terms of Service and Privacy Policy, you must be at least 13 years of age to play or download Clash Royale. A network connection is also required. FEATURES● Duel players from around the world in real-time and take their Trophies● Earn chests to unlock rewards, collect powerful new cards and upgrade existing ones● Destroy opponent’s towers and win Crowns to earn epic Crown chests● Build and upgrade your card collection with the Clash Royale Family along with dozens of your favorite Clash troops, spells and defenses● Construct your ultimate Battle Deck to defeat your opponents● Progress through multiple Arenas all the way to the top● Form a Clan to share cards and build your very own battle community● Challenge your Clanmates and friends to a private duel● Learn different battle tactics by watching the best duels on TV RoyaleSupportAre you having problems? Visit http://supercell.helpshift.com/a/clash-royale/ or http://supr.cl/ClashRoyaleForum or contact us in game by going to Settings > Help and Support.Privacy Policy: http://supercell.com/en/privacy-policy/Terms of Service:http://supercell.com/en/terms-of-service/Parent’s Guide:http://supercell.com/en/parents/",
    "In App Purchases": "Yes",
    "Name": "Clash Royale",
    "Number of Reviews (All Time)": "249422",
    "Number of Reviews (Current Versions) ": "2591",
    "Overall Rating": "4.5",
    "Rank": "64",
    "Rating of Current Version": "4",
    "Release": "Mar 16, 2017",
    "Seller": "Supercell Oy",
    "Size": " 114 MB",
    "Version": "1.8.1"
  },
  {
    "Age Restriction": "Rated 9+ ",
    "Category": "Shopping",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Enter the Arena! From the creators of Clash of Clans comes a real-time multiplayer game starring the Royales, your favorite Clash characters and much, much more.Collect and upgrade dozens of cards featuring the Clash of Clans troops, spells and defenses you know and love, as well as the Royales: Princes, Knights, Baby Dragons and more. Knock the enemy King and Princesses from their towers to defeat your opponents and win Trophies, Crowns and glory in the Arena. Form a Clan to share cards and build your very own battle community. Lead the Clash Royale Family to victory!PLEASE NOTE! Clash Royale is free to download and play, however, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings. Also, under our Terms of Service and Privacy Policy, you must be at least 13 years of age to play or download Clash Royale. A network connection is also required. FEATURES● Duel players from around the world in real-time and take their Trophies● Earn chests to unlock rewards, collect powerful new cards and upgrade existing ones● Destroy opponent’s towers and win Crowns to earn epic Crown chests● Build and upgrade your card collection with the Clash Royale Family along with dozens of your favorite Clash troops, spells and defenses● Construct your ultimate Battle Deck to defeat your opponents● Progress through multiple Arenas all the way to the top● Form a Clan to share cards and build your very own battle community● Challenge your Clanmates and friends to a private duel● Learn different battle tactics by watching the best duels on TV RoyaleSupportAre you having problems? Visit http://supercell.helpshift.com/a/clash-royale/ or http://supr.cl/ClashRoyaleForum or contact us in game by going to Settings > Help and Support.Privacy Policy: http://supercell.com/en/privacy-policy/Terms of Service:http://supercell.com/en/terms-of-service/Parent’s Guide:http://supercell.com/en/parents/",
    "In App Purchases": "Yes",
    "Name": "Walmart App: Shopping, Savings Catcher, & More",
    "Number of Reviews (All Time)": "249422",
    "Number of Reviews (Current Versions) ": "2591",
    "Overall Rating": "4.5",
    "Rank": "65",
    "Rating of Current Version": "4",
    "Release": "Mar 16, 2017",
    "Seller": "Supercell Oy",
    "Size": " 114 MB",
    "Version": "1.8.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "The world’s best multiplayer Basketball game on mobile, from the creators of multiple smash-hit online sports games!Dribble, shoot, score, WIN! Grab the ball and take on the world with BASKETBALL STARS.Play fast-paced, authentic 1v1 multiplayer basketball! Show your skills, moves and fakes to juke out your opponent and shoot for the basket! On defense, stay in the face of the attacker, steal the ball, and time your leaps to block their shots! All in REAL-TIME!REALISTIC 3D GRAPHICSBasketball on mobile has never looked this good: fully customisable 3D players and a variety of environments to play in!COMPETE 1-ON-1 IN TWO AWESOME MULTIPLAYER GAME MODESTest your duelling instincts in 1v1 Attacker-Defender battles, or rush to shoot hoops in a time-based 1v1 Shooting Race.INCREDIBLE REWARDS AND HUNDREDS OF UNIQUE ITEMSPlaying like an all-star? Enter higher-ranked matches with bigger stakes, and unlock special basketballs and unique wearables to grow your power and style.LEVEL UPStart out on the Underdog court and play your way up to the top. Gain access to more  exclusive courts and compete with the best Basketball Stars players out there!KEY FEATURESTrue 1-on-1 basketball gameplayRealistic 3D graphics2 different online multiplayer game modesEasy to pick-up, challenging to master400+ customisation items = thousands of unique looks!40+ unlockable basketballsDribble, feint, shoot, steal, block and get powerful bonuses off the backboardFree to play!-- Download Basketball Stars by Miniclip NOW! --Requirement: iPhone 4S or newer, iPod Touch 5th gen, iPad 2 or newerThis game needs an internet connection to playDon’t miss out on the latest news:Like Miniclip: http://facebook.com/miniclipFollow us on Twitter: http://twitter.com/miniclip------------------------------------Find out more about Miniclip: http://www.miniclip.comTERMS AND CONDITIONS: http://www.miniclip.com/terms-and-conditionsPRIVACY POLICY: http://www.miniclip.com/privacy",
    "In App Purchases": "Yes",
    "Name": "Basketball Stars™",
    "Number of Reviews (All Time)": "23849",
    "Number of Reviews (Current Versions) ": "1570",
    "Overall Rating": "4",
    "Rank": "66",
    "Rating of Current Version": "4.5",
    "Release": "Mar 06, 2017",
    "Seller": "Miniclip SA",
    "Size": " 142 MB",
    "Version": "1.7.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Finance",
    "Compatibility": "iOS 8.1 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "DescriptionTAP INTO YOUR MONEYSend money or pay online to almost anywhere in the world in just seconds. Manage all the ways you send, receive, and spend money at a glance – download the PayPal payment app today.SEND MONEY IN SECONDSTransfer money to PayPal account holders in over 100 countries using just their email address or mobile number. When the money arrives in their account (usually in seconds), they can spend the money online or withdraw it with just a tap. And it’s completely free when you send money to friends in the US from your bank account or PayPal balance.GET PAID WITH EASESend a request for money that allows people to pay you back with just a tap. Whether you’re collecting money for a group gift or something you sold online, PayPal mobile app makes it easy for them and even easier for you. STAY ON TOP OF IT ALLWhenever you send, receive, and spend money with PayPal, the app sends an instant notification to help you keep track of it all. Whether you use PayPal Credit, your balance, your bank, or your debit and credit cards to pay with PayPal - you can find everything and anything you need to simply manage it all in this secure payment app.",
    "In App Purchases": "No",
    "Name": "PayPal - Send and request money safely",
    "Number of Reviews (All Time)": "114360",
    "Number of Reviews (Current Versions) ": "543",
    "Overall Rating": "4",
    "Rank": "67",
    "Rating of Current Version": "4.5",
    "Release": "Mar 14, 2017",
    "Seller": "PayPal, Inc.",
    "Size": " 216 MB",
    "Version": "6.10.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 6.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "From the creator of SpellTower, comes a new and completely original word game!Anagrams meets Word Search, with a sprinkle of Crosswords.Typeshift is the modern anagram puzzle; re-imagined from the ground up, combining wordplay, modern game design, and a mobile-first approach.In most anagram games, you search for new combinations within a single word, but in Typeshift, you search within three to five words stacked & scrambled up together.  Shift columns of letters up and down as you try to spell words in the center row. Play continues until you have used all letters in a puzzle at least once.Special Clue Puzzles combine Crosswords with Anagrams as you match clever clues provided by Typeshift's various puzzle authors.- Daily Word Game Play with Global Leaderboards - Typeshift features a free daily challenge with global leaderboards. The easiest challenge for the week appears on Monday, and progressively more challenging puzzles build throughout the week.Compare your fastest Typeshift daily solving times with players around the globe!------WHATS IN THE “BOX”?Typeshift comes with over a hundred free puzzles, with more coming soon, plus new free daily puzzles every day.Additional puzzle packs may be purchased in-app.Purchasing any puzzle pack removes ads, and unlocks themes & detailed statistics.------A WORD FROM THE DEVELOPERTypeshift continues my quest to re-imagine classic newspaper games in the digital era. Where SpellTower tackled word search and Really Bad Chess handled chess puzzles, Typeshift re-examines Anagrams and Crosswords.Typeshift has been a joy to develop, and I hope you have as much fun playing it as I had making it.As always, thanks so much for your support!-zach",
    "In App Purchases": "Yes",
    "Name": "TypeShift",
    "Number of Reviews (All Time)": "57",
    "Number of Reviews (Current Versions) ": "15",
    "Overall Rating": "4",
    "Rank": "68",
    "Rating of Current Version": "4.5",
    "Release": "Mar 20, 2017",
    "Seller": "Zach Gage",
    "Size": " 78.4 MB",
    "Version": "1.0.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Food & Drink",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get the food you want, from the restaurants you love, delivered at Uber speed.Food you want: We’re working with over a hundred restaurants in your city to put great local food all in one place. If you’re craving it, you can find it on UberEATS.Speed you need: It’s Uber fast from app tap to table. Through the Uber network, you can get anything from our roster of local restaurants, within minutes.Service you love: When you’re ready to place your order, you’ll see a total that includes the food and delivery price. There’s no need to tip. Pay with your Uber account and watch your order come right to you through the app. UberEATS is currently available in Amsterdam, Bangkok, Bogota, Brussels, Capetown, Dubai, Johannesburg, Hong Kong, London, Sao Paulo, Singapore, Stockholm, Taipei, Tokyo, Madrid, Milan, Vienna, and multiple cities in the US, Australia, Canada, France, and Mexico.",
    "In App Purchases": "No",
    "Name": "UberEATS: Uber for Food Delivery",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "13263",
    "Overall Rating": "Information Not Available",
    "Rank": "69",
    "Rating of Current Version": "4",
    "Release": "Mar 21, 2017",
    "Seller": "Uber Technologies, Inc.",
    "Size": " 69.8 MB",
    "Version": "1.76.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Lifestyle",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get the food you want, from the restaurants you love, delivered at Uber speed.Food you want: We’re working with over a hundred restaurants in your city to put great local food all in one place. If you’re craving it, you can find it on UberEATS.Speed you need: It’s Uber fast from app tap to table. Through the Uber network, you can get anything from our roster of local restaurants, within minutes.Service you love: When you’re ready to place your order, you’ll see a total that includes the food and delivery price. There’s no need to tip. Pay with your Uber account and watch your order come right to you through the app. UberEATS is currently available in Amsterdam, Bangkok, Bogota, Brussels, Capetown, Dubai, Johannesburg, Hong Kong, London, Sao Paulo, Singapore, Stockholm, Taipei, Tokyo, Madrid, Milan, Vienna, and multiple cities in the US, Australia, Canada, France, and Mexico.",
    "In App Purchases": "No",
    "Name": "Tinder",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "13263",
    "Overall Rating": "Information Not Available",
    "Rank": "70",
    "Rating of Current Version": "4",
    "Release": "Mar 21, 2017",
    "Seller": "Uber Technologies, Inc.",
    "Size": " 69.8 MB",
    "Version": "1.76.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Utilities",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get the food you want, from the restaurants you love, delivered at Uber speed.Food you want: We’re working with over a hundred restaurants in your city to put great local food all in one place. If you’re craving it, you can find it on UberEATS.Speed you need: It’s Uber fast from app tap to table. Through the Uber network, you can get anything from our roster of local restaurants, within minutes.Service you love: When you’re ready to place your order, you’ll see a total that includes the food and delivery price. There’s no need to tip. Pay with your Uber account and watch your order come right to you through the app. UberEATS is currently available in Amsterdam, Bangkok, Bogota, Brussels, Capetown, Dubai, Johannesburg, Hong Kong, London, Sao Paulo, Singapore, Stockholm, Taipei, Tokyo, Madrid, Milan, Vienna, and multiple cities in the US, Australia, Canada, France, and Mexico.",
    "In App Purchases": "No",
    "Name": "Norton WiFi Privacy VPN",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "13263",
    "Overall Rating": "Information Not Available",
    "Rank": "71",
    "Rating of Current Version": "4",
    "Release": "Mar 21, 2017",
    "Seller": "Uber Technologies, Inc.",
    "Size": " 69.8 MB",
    "Version": "1.76.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Photo & Video",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Introducing Stickers! These are just like the Free To Edit images that have revolutionized social photo editing on PicsArt, but for stickers! Free To Edit Stickers can be created by anyone for everyone. Make your own stickers and share with your friends, or grab something others have made and put your own twist on it. There are thousands of user-created stickers of literally everything you can imagine. If you can't find exactly what you want, quickly and easily make your own, and get ready to take your sticker game to the next level! 400 million+ installs strong, PicsArt is the #1 all-in-one picture editor, pic collage maker, camera, meme maker, clipart and drawing tool. With PicsArt, you can remix Free To Edit pictures into awesome collages and memes.Millions use PicsArt because it offers hundreds of filters for pictures, collage layouts and powerful photo editing tools like picture blending, picture cropping, adding text and more. Discover thousands of free clipart packs, fonts, stickers, emojis, collage templates - integrated into a powerful photo editor, and it's free! PicsArt’s photo editor, collage maker, clipart and drawing tools are the best way to transform your photos into works of art and to express your creativity with the world.Step up your photo editing game with PicsArt, make awesome pictures and collages and join the movement to go WAY beyond the filter!* 1000s of amazing photo editing features that are fun and easy to use* Remix images with friends. It’s cool.* New magic AI-powered Magic Effects turn photos into art* Make any #FreeToEdit image your own. Do it, we dare you. \u2028\u2028* Photo grid, free form collage, and collage layouts* Free and premium photo stickers and collage packs* Add text with multiple fonts and text effects* Brand new AI and Prisma style effects* Freely share to PicsArt, Instagram, Facebook, WhatsApp and more!Apply various clipart and stickers to your images and memes:* Check out our Spring stickers - trees, flowers and a lot more!* 1000s of free clipart bundles, fonts to add text on photos, stickers, collage backgrounds and emojis * Free To Edit Stickers that are available to use, remix, and share. Discover thousands of stickers from others that you can personalize for your pictures and use in Remix Chat messages.  Do cool things like:* Make your photos spring-tacular with Spring clipart, frames and backgrounds!* Make memes and have fun - using text and stickers* Create a double exposure - turn two photos into a unique work of art* Mix an awesome collage - arrange a selection of cool images and tell a story* Draw - illustrate pictures, apply effects and share with friendsSo. Much. Inspo. * See how others get creative with photo and editing challenges.* Discover pictures you love and learn to make them. * Check out new tutorials every week. We got you!* Read our blog (picsart.com/blog) for all the latest news* Follow our Instagram (instagram.com/picsart/) for daily visual inspiration",
    "In App Purchases": "Yes",
    "Name": "PicsArt Photo Studio: Picture Editor Collage Maker",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "28314",
    "Overall Rating": "Information Not Available",
    "Rank": "72",
    "Rating of Current Version": "4.5",
    "Release": "Mar 21, 2017",
    "Seller": "PicsArt, Inc.",
    "Size": " 150 MB",
    "Version": "9.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Introducing Stickers! These are just like the Free To Edit images that have revolutionized social photo editing on PicsArt, but for stickers! Free To Edit Stickers can be created by anyone for everyone. Make your own stickers and share with your friends, or grab something others have made and put your own twist on it. There are thousands of user-created stickers of literally everything you can imagine. If you can't find exactly what you want, quickly and easily make your own, and get ready to take your sticker game to the next level! 400 million+ installs strong, PicsArt is the #1 all-in-one picture editor, pic collage maker, camera, meme maker, clipart and drawing tool. With PicsArt, you can remix Free To Edit pictures into awesome collages and memes.Millions use PicsArt because it offers hundreds of filters for pictures, collage layouts and powerful photo editing tools like picture blending, picture cropping, adding text and more. Discover thousands of free clipart packs, fonts, stickers, emojis, collage templates - integrated into a powerful photo editor, and it's free! PicsArt’s photo editor, collage maker, clipart and drawing tools are the best way to transform your photos into works of art and to express your creativity with the world.Step up your photo editing game with PicsArt, make awesome pictures and collages and join the movement to go WAY beyond the filter!* 1000s of amazing photo editing features that are fun and easy to use* Remix images with friends. It’s cool.* New magic AI-powered Magic Effects turn photos into art* Make any #FreeToEdit image your own. Do it, we dare you. \u2028\u2028* Photo grid, free form collage, and collage layouts* Free and premium photo stickers and collage packs* Add text with multiple fonts and text effects* Brand new AI and Prisma style effects* Freely share to PicsArt, Instagram, Facebook, WhatsApp and more!Apply various clipart and stickers to your images and memes:* Check out our Spring stickers - trees, flowers and a lot more!* 1000s of free clipart bundles, fonts to add text on photos, stickers, collage backgrounds and emojis * Free To Edit Stickers that are available to use, remix, and share. Discover thousands of stickers from others that you can personalize for your pictures and use in Remix Chat messages.  Do cool things like:* Make your photos spring-tacular with Spring clipart, frames and backgrounds!* Make memes and have fun - using text and stickers* Create a double exposure - turn two photos into a unique work of art* Mix an awesome collage - arrange a selection of cool images and tell a story* Draw - illustrate pictures, apply effects and share with friendsSo. Much. Inspo. * See how others get creative with photo and editing challenges.* Discover pictures you love and learn to make them. * Check out new tutorials every week. We got you!* Read our blog (picsart.com/blog) for all the latest news* Follow our Instagram (instagram.com/picsart/) for daily visual inspiration",
    "In App Purchases": "Yes",
    "Name": "Bean's Quest",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "28314",
    "Overall Rating": "Information Not Available",
    "Rank": "73",
    "Rating of Current Version": "4.5",
    "Release": "Mar 21, 2017",
    "Seller": "PicsArt, Inc.",
    "Size": " 150 MB",
    "Version": "9.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Health & Fitness",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Introducing Stickers! These are just like the Free To Edit images that have revolutionized social photo editing on PicsArt, but for stickers! Free To Edit Stickers can be created by anyone for everyone. Make your own stickers and share with your friends, or grab something others have made and put your own twist on it. There are thousands of user-created stickers of literally everything you can imagine. If you can't find exactly what you want, quickly and easily make your own, and get ready to take your sticker game to the next level! 400 million+ installs strong, PicsArt is the #1 all-in-one picture editor, pic collage maker, camera, meme maker, clipart and drawing tool. With PicsArt, you can remix Free To Edit pictures into awesome collages and memes.Millions use PicsArt because it offers hundreds of filters for pictures, collage layouts and powerful photo editing tools like picture blending, picture cropping, adding text and more. Discover thousands of free clipart packs, fonts, stickers, emojis, collage templates - integrated into a powerful photo editor, and it's free! PicsArt’s photo editor, collage maker, clipart and drawing tools are the best way to transform your photos into works of art and to express your creativity with the world.Step up your photo editing game with PicsArt, make awesome pictures and collages and join the movement to go WAY beyond the filter!* 1000s of amazing photo editing features that are fun and easy to use* Remix images with friends. It’s cool.* New magic AI-powered Magic Effects turn photos into art* Make any #FreeToEdit image your own. Do it, we dare you. \u2028\u2028* Photo grid, free form collage, and collage layouts* Free and premium photo stickers and collage packs* Add text with multiple fonts and text effects* Brand new AI and Prisma style effects* Freely share to PicsArt, Instagram, Facebook, WhatsApp and more!Apply various clipart and stickers to your images and memes:* Check out our Spring stickers - trees, flowers and a lot more!* 1000s of free clipart bundles, fonts to add text on photos, stickers, collage backgrounds and emojis * Free To Edit Stickers that are available to use, remix, and share. Discover thousands of stickers from others that you can personalize for your pictures and use in Remix Chat messages.  Do cool things like:* Make your photos spring-tacular with Spring clipart, frames and backgrounds!* Make memes and have fun - using text and stickers* Create a double exposure - turn two photos into a unique work of art* Mix an awesome collage - arrange a selection of cool images and tell a story* Draw - illustrate pictures, apply effects and share with friendsSo. Much. Inspo. * See how others get creative with photo and editing challenges.* Discover pictures you love and learn to make them. * Check out new tutorials every week. We got you!* Read our blog (picsart.com/blog) for all the latest news* Follow our Instagram (instagram.com/picsart/) for daily visual inspiration",
    "In App Purchases": "Yes",
    "Name": "Fitbit",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "28314",
    "Overall Rating": "Information Not Available",
    "Rank": "74",
    "Rating of Current Version": "4.5",
    "Release": "Mar 21, 2017",
    "Seller": "PicsArt, Inc.",
    "Size": " 150 MB",
    "Version": "9.0"
  },
  {
    "Age Restriction": "You must be at least 17 years old to download this app.",
    "Category": "Music",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "YouTube Music lets you watch and listen to a nearly endless catalog in an app designed for music discovery.Enjoy music for free with ads, or get YouTube Red.A YouTube built just for music• Every video starts a non-stop station• Personalized stations learn your tastes• See concert footage and live recordingsA nearly endless catalog• New artists, classic favorites, and everything in between• Classic live recordings that span decades• Official music videos, playlists, remixes, covers, and moreAmplify your experience with YouTube Red• Enjoy your music without ads• The music keeps playing even when your screen is off• Take your music on-the-go with offline mixtapeGet 1 month of YouTube Red for free. Existing YouTube Red or Google Play Music members and users of either service who have already received this 30 day trial are not eligible. Monthly charges apply for YouTube Red membership outside of trial periods.Monthly price: $12.99 USD / $14.99 AUD / $15.99 NZD / $139 pesos MXN / $9.89 USD (KR only)YouTube paid service terms: https://www.youtube.com/t/terms_paidservicePrivacy policy: https://www.google.com/policies/privacy",
    "In App Purchases": "Yes",
    "Name": "YouTube Music",
    "Number of Reviews (All Time)": "6745",
    "Number of Reviews (Current Versions) ": "70",
    "Overall Rating": "3.5",
    "Rank": "75",
    "Rating of Current Version": "3.5",
    "Release": "Mar 09, 2017",
    "Seller": "Google, Inc.",
    "Size": " 118 MB",
    "Version": "1.68"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Social Networking",
    "Compatibility": "iOS 8.1 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get connected. Kik is way more than just messaging. It’s the easiest way to connect with your friends, stay in the loop, and explore – all through chat. No phone numbers, just pick a username.• Choose who to chat with one-on-one and in groups• Share pics, videos, gifs, games, and more• Meet new friends with similar interestsGet on Kik now. Start chatting!",
    "In App Purchases": "No",
    "Name": "Kik",
    "Number of Reviews (All Time)": "259692",
    "Number of Reviews (Current Versions) ": "274",
    "Overall Rating": "4",
    "Rank": "76",
    "Rating of Current Version": "4",
    "Release": "Mar 15, 2017",
    "Seller": "Kik Interactive Inc.",
    "Size": " 160 MB",
    "Version": "11.11.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Finance",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get your free credit scores, reports and more on Credit Karma. Checking your own credit won’t affect your score, and we’ll never ask for your credit card info. Apple ® named it one of 2016's 10 Best Apps of the Year, and it now has a bright new look! Free, Helpful Features for Your Credit:• Free credit monitoring – We’ll send you alerts about important changes on your TransUnion credit report.• Direct Dispute™ – If you notice an error on your TransUnion report, you can submit a dispute without leaving Credit Karma.• Free education, tips and tools – We’ll help you understand your scores and reports so you can make informed financial decisions.• Personalized recommendations – Use our Approval Odds to find credit cards and loans you’re more likely to be approved for. Join more than 60 million members on the path to financial progress. Learn more and sign up at creditkarma.com.",
    "In App Purchases": "No",
    "Name": "Credit Karma: Free Credit Scores, Reports & Alerts",
    "Number of Reviews (All Time)": "97513",
    "Number of Reviews (Current Versions) ": "289",
    "Overall Rating": "5",
    "Rank": "77",
    "Rating of Current Version": "5",
    "Release": "Mar 17, 2017",
    "Seller": "Credit Karma, Inc.",
    "Size": " 79.9 MB",
    "Version": "4.8"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Shopping",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get your free credit scores, reports and more on Credit Karma. Checking your own credit won’t affect your score, and we’ll never ask for your credit card info. Apple ® named it one of 2016's 10 Best Apps of the Year, and it now has a bright new look! Free, Helpful Features for Your Credit:• Free credit monitoring – We’ll send you alerts about important changes on your TransUnion credit report.• Direct Dispute™ – If you notice an error on your TransUnion report, you can submit a dispute without leaving Credit Karma.• Free education, tips and tools – We’ll help you understand your scores and reports so you can make informed financial decisions.• Personalized recommendations – Use our Approval Odds to find credit cards and loans you’re more likely to be approved for. Join more than 60 million members on the path to financial progress. Learn more and sign up at creditkarma.com.",
    "In App Purchases": "No",
    "Name": "eBay: Buy, Sell, Save! Electronics, Fashion & More",
    "Number of Reviews (All Time)": "97513",
    "Number of Reviews (Current Versions) ": "289",
    "Overall Rating": "5",
    "Rank": "78",
    "Rating of Current Version": "5",
    "Release": "Mar 17, 2017",
    "Seller": "Credit Karma, Inc.",
    "Size": " 79.9 MB",
    "Version": "4.8"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get your free credit scores, reports and more on Credit Karma. Checking your own credit won’t affect your score, and we’ll never ask for your credit card info. Apple ® named it one of 2016's 10 Best Apps of the Year, and it now has a bright new look! Free, Helpful Features for Your Credit:• Free credit monitoring – We’ll send you alerts about important changes on your TransUnion credit report.• Direct Dispute™ – If you notice an error on your TransUnion report, you can submit a dispute without leaving Credit Karma.• Free education, tips and tools – We’ll help you understand your scores and reports so you can make informed financial decisions.• Personalized recommendations – Use our Approval Odds to find credit cards and loans you’re more likely to be approved for. Join more than 60 million members on the path to financial progress. Learn more and sign up at creditkarma.com.",
    "In App Purchases": "No",
    "Name": "Hardway - Endless Road Builder",
    "Number of Reviews (All Time)": "97513",
    "Number of Reviews (Current Versions) ": "289",
    "Overall Rating": "5",
    "Rank": "79",
    "Rating of Current Version": "5",
    "Release": "Mar 17, 2017",
    "Seller": "Credit Karma, Inc.",
    "Size": " 79.9 MB",
    "Version": "4.8"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Reference",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get your free credit scores, reports and more on Credit Karma. Checking your own credit won’t affect your score, and we’ll never ask for your credit card info. Apple ® named it one of 2016's 10 Best Apps of the Year, and it now has a bright new look! Free, Helpful Features for Your Credit:• Free credit monitoring – We’ll send you alerts about important changes on your TransUnion credit report.• Direct Dispute™ – If you notice an error on your TransUnion report, you can submit a dispute without leaving Credit Karma.• Free education, tips and tools – We’ll help you understand your scores and reports so you can make informed financial decisions.• Personalized recommendations – Use our Approval Odds to find credit cards and loans you’re more likely to be approved for. Join more than 60 million members on the path to financial progress. Learn more and sign up at creditkarma.com.",
    "In App Purchases": "No",
    "Name": "Google Translate",
    "Number of Reviews (All Time)": "97513",
    "Number of Reviews (Current Versions) ": "289",
    "Overall Rating": "5",
    "Rank": "80",
    "Rating of Current Version": "5",
    "Release": "Mar 17, 2017",
    "Seller": "Credit Karma, Inc.",
    "Size": " 79.9 MB",
    "Version": "4.8"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get your free credit scores, reports and more on Credit Karma. Checking your own credit won’t affect your score, and we’ll never ask for your credit card info. Apple ® named it one of 2016's 10 Best Apps of the Year, and it now has a bright new look! Free, Helpful Features for Your Credit:• Free credit monitoring – We’ll send you alerts about important changes on your TransUnion credit report.• Direct Dispute™ – If you notice an error on your TransUnion report, you can submit a dispute without leaving Credit Karma.• Free education, tips and tools – We’ll help you understand your scores and reports so you can make informed financial decisions.• Personalized recommendations – Use our Approval Odds to find credit cards and loans you’re more likely to be approved for. Join more than 60 million members on the path to financial progress. Learn more and sign up at creditkarma.com.",
    "In App Purchases": "No",
    "Name": "Guns of Mercy",
    "Number of Reviews (All Time)": "97513",
    "Number of Reviews (Current Versions) ": "289",
    "Overall Rating": "5",
    "Rank": "81",
    "Rating of Current Version": "5",
    "Release": "Mar 17, 2017",
    "Seller": "Credit Karma, Inc.",
    "Size": " 79.9 MB",
    "Version": "4.8"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get your free credit scores, reports and more on Credit Karma. Checking your own credit won’t affect your score, and we’ll never ask for your credit card info. Apple ® named it one of 2016's 10 Best Apps of the Year, and it now has a bright new look! Free, Helpful Features for Your Credit:• Free credit monitoring – We’ll send you alerts about important changes on your TransUnion credit report.• Direct Dispute™ – If you notice an error on your TransUnion report, you can submit a dispute without leaving Credit Karma.• Free education, tips and tools – We’ll help you understand your scores and reports so you can make informed financial decisions.• Personalized recommendations – Use our Approval Odds to find credit cards and loans you’re more likely to be approved for. Join more than 60 million members on the path to financial progress. Learn more and sign up at creditkarma.com.",
    "In App Purchases": "No",
    "Name": "Boomerang from Instagram",
    "Number of Reviews (All Time)": "97513",
    "Number of Reviews (Current Versions) ": "289",
    "Overall Rating": "5",
    "Rank": "82",
    "Rating of Current Version": "5",
    "Release": "Mar 17, 2017",
    "Seller": "Credit Karma, Inc.",
    "Size": " 79.9 MB",
    "Version": "4.8"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Easy rule but unlimited fun! Enjoy the world's most beloved puzzle game for FREE!This is a new Block puzzle game created by BitMango.“Block! Hexa Puzzle” is a tetris style exciting block puzzle game.Easy to play, and pleasurable game for all ages.Move blocks to fill up the square and collect block pieces to level up!HOW TO PLAY• Drag the blocks to move them.• Try to fit them all in the frame• Blocks can't be rotated.• Don't worry! No time limits!FEATURES• BLOCK PUZZLE- Smoth effect for block puzzle game!- Play easily and quickly.• TONS OF UNIQUE LEVELS- Over 300+ puzzles are unique and full of fun and amazing challenges!• EASY AND FUN PLAY- Easy to learn and fun to master gameplay• NO TIME LIMIT- Enjoy game for any time, anywhere and a short time.• NO WIFI? NO PROBLEM!- You can play offline in anytime.• STUNNING GRAPHICS- Soothing sounds and gorgeous visual effectsSUPPORT UNIVERSAL APP• Enjoy the game with various devices. (Phones and Tablets)NOTES• Block! Hexa Puzzle contains the ads like banner, interstitial, video and house ads.• Block! Hexa Puzzle is free to play, but you can purchase In-app items like  AD FREE and Hints.E-MAIL• contact@bitmango.comHOMEPAGE• http://www.bitmango.com/Like us on FACEBOOK• https://www.facebook.com/BitMangoGamesThank you.",
    "In App Purchases": "Yes",
    "Name": "Block! Hexa Puzzle",
    "Number of Reviews (All Time)": "23458",
    "Number of Reviews (Current Versions) ": "113",
    "Overall Rating": "4.5",
    "Rank": "83",
    "Rating of Current Version": "4.5",
    "Release": "Mar 19, 2017",
    "Seller": "BitMango Corporation",
    "Size": " 119 MB",
    "Version": "1.3.8"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Music",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Easy rule but unlimited fun! Enjoy the world's most beloved puzzle game for FREE!This is a new Block puzzle game created by BitMango.“Block! Hexa Puzzle” is a tetris style exciting block puzzle game.Easy to play, and pleasurable game for all ages.Move blocks to fill up the square and collect block pieces to level up!HOW TO PLAY• Drag the blocks to move them.• Try to fit them all in the frame• Blocks can't be rotated.• Don't worry! No time limits!FEATURES• BLOCK PUZZLE- Smoth effect for block puzzle game!- Play easily and quickly.• TONS OF UNIQUE LEVELS- Over 300+ puzzles are unique and full of fun and amazing challenges!• EASY AND FUN PLAY- Easy to learn and fun to master gameplay• NO TIME LIMIT- Enjoy game for any time, anywhere and a short time.• NO WIFI? NO PROBLEM!- You can play offline in anytime.• STUNNING GRAPHICS- Soothing sounds and gorgeous visual effectsSUPPORT UNIVERSAL APP• Enjoy the game with various devices. (Phones and Tablets)NOTES• Block! Hexa Puzzle contains the ads like banner, interstitial, video and house ads.• Block! Hexa Puzzle is free to play, but you can purchase In-app items like  AD FREE and Hints.E-MAIL• contact@bitmango.comHOMEPAGE• http://www.bitmango.com/Like us on FACEBOOK• https://www.facebook.com/BitMangoGamesThank you.",
    "In App Purchases": "Yes",
    "Name": "Shazam - Discover music, artists, videos & lyrics",
    "Number of Reviews (All Time)": "23458",
    "Number of Reviews (Current Versions) ": "113",
    "Overall Rating": "4.5",
    "Rank": "84",
    "Rating of Current Version": "4.5",
    "Release": "Mar 19, 2017",
    "Seller": "BitMango Corporation",
    "Size": " 119 MB",
    "Version": "1.3.8"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Easy rule but unlimited fun! Enjoy the world's most beloved puzzle game for FREE!This is a new Block puzzle game created by BitMango.“Block! Hexa Puzzle” is a tetris style exciting block puzzle game.Easy to play, and pleasurable game for all ages.Move blocks to fill up the square and collect block pieces to level up!HOW TO PLAY• Drag the blocks to move them.• Try to fit them all in the frame• Blocks can't be rotated.• Don't worry! No time limits!FEATURES• BLOCK PUZZLE- Smoth effect for block puzzle game!- Play easily and quickly.• TONS OF UNIQUE LEVELS- Over 300+ puzzles are unique and full of fun and amazing challenges!• EASY AND FUN PLAY- Easy to learn and fun to master gameplay• NO TIME LIMIT- Enjoy game for any time, anywhere and a short time.• NO WIFI? NO PROBLEM!- You can play offline in anytime.• STUNNING GRAPHICS- Soothing sounds and gorgeous visual effectsSUPPORT UNIVERSAL APP• Enjoy the game with various devices. (Phones and Tablets)NOTES• Block! Hexa Puzzle contains the ads like banner, interstitial, video and house ads.• Block! Hexa Puzzle is free to play, but you can purchase In-app items like  AD FREE and Hints.E-MAIL• contact@bitmango.comHOMEPAGE• http://www.bitmango.com/Like us on FACEBOOK• https://www.facebook.com/BitMangoGamesThank you.",
    "In App Purchases": "Yes",
    "Name": "slither.io",
    "Number of Reviews (All Time)": "23458",
    "Number of Reviews (Current Versions) ": "113",
    "Overall Rating": "4.5",
    "Rank": "85",
    "Rating of Current Version": "4.5",
    "Release": "Mar 19, 2017",
    "Seller": "BitMango Corporation",
    "Size": " 119 MB",
    "Version": "1.3.8"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Easy rule but unlimited fun! Enjoy the world's most beloved puzzle game for FREE!This is a new Block puzzle game created by BitMango.“Block! Hexa Puzzle” is a tetris style exciting block puzzle game.Easy to play, and pleasurable game for all ages.Move blocks to fill up the square and collect block pieces to level up!HOW TO PLAY• Drag the blocks to move them.• Try to fit them all in the frame• Blocks can't be rotated.• Don't worry! No time limits!FEATURES• BLOCK PUZZLE- Smoth effect for block puzzle game!- Play easily and quickly.• TONS OF UNIQUE LEVELS- Over 300+ puzzles are unique and full of fun and amazing challenges!• EASY AND FUN PLAY- Easy to learn and fun to master gameplay• NO TIME LIMIT- Enjoy game for any time, anywhere and a short time.• NO WIFI? NO PROBLEM!- You can play offline in anytime.• STUNNING GRAPHICS- Soothing sounds and gorgeous visual effectsSUPPORT UNIVERSAL APP• Enjoy the game with various devices. (Phones and Tablets)NOTES• Block! Hexa Puzzle contains the ads like banner, interstitial, video and house ads.• Block! Hexa Puzzle is free to play, but you can purchase In-app items like  AD FREE and Hints.E-MAIL• contact@bitmango.comHOMEPAGE• http://www.bitmango.com/Like us on FACEBOOK• https://www.facebook.com/BitMangoGamesThank you.",
    "In App Purchases": "Yes",
    "Name": "Google Slides",
    "Number of Reviews (All Time)": "23458",
    "Number of Reviews (Current Versions) ": "113",
    "Overall Rating": "4.5",
    "Rank": "86",
    "Rating of Current Version": "4.5",
    "Release": "Mar 19, 2017",
    "Seller": "BitMango Corporation",
    "Size": " 119 MB",
    "Version": "1.3.8"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Finance",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Pay your friends instantly, and cash out to your bank for FREE! Standard deposits show up the very next business day. You can even spend directly from the app with a built-in Visa virtual card number.SAFE TO USEProtect payments with Touch ID or a passcodeINSTANT DEPOSITSOptionally cash out to your bank in seconds for a 1% feeGET STARTED FASTJust link your Visa, MasterCard, or Discover debit card to transfer money",
    "In App Purchases": "No",
    "Name": "Square Cash - Send Money for Free",
    "Number of Reviews (All Time)": "21707",
    "Number of Reviews (Current Versions) ": "419",
    "Overall Rating": "4.5",
    "Rank": "87",
    "Rating of Current Version": "4.5",
    "Release": "Mar 06, 2017",
    "Seller": "Information Not Available",
    "Size": " 78.7 MB",
    "Version": "2.14.4"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Welcome to the ultimate virtual universe powered by imagination. Over 30 million players come each month to explore amazing 3D virtual worlds with friends. Join the largest user-generated gaming community and play thousands of games, ranging from immersive multiplayer games and competitions, to interactive adventures where you can imagine what it’s like to be a dinosaur, a miner in a quarry, or an astronaut on a space exploration.THOUSANDS OF GAMESPlay something new every day. Explore the farthest reaches of the galaxy, battle against waves of the undead, star in a fashion show, hang out in a virtual club, the list goes on and on…MASSIVELY ONLINE MULTIPLAYERHang out with your friends and millions of other virtual explorers across computers, mobile devices, consoles, and VR in a wide variety of social games. ROBLOX is the largest user-generated gaming community, where over 700,000 creators are producing an infinite variety of immersive experiences just waiting to be played.CUSTOMIZABLE CHARACTERSTake on a new persona and dress up your avatar with thousands of different hats, shirts, faces, gear, and much, much more!CHAT WITH FRIENDSConnect with your friends online with in-game chat features, private messages, and groups!FREE-TO-PLAYROBLOX is free-to-play with in-app purchases.PRIVACY POLICYROBLOX Corporate Site: http://www.roblox.com/Info/Privacy.aspxPARENT’S GUIDEROBLOX Corporate Site: http://corp.roblox.com/parentsSUPPORTHelp: https://en.help.roblox.com/hc/en-us",
    "In App Purchases": "Yes",
    "Name": "ROBLOX",
    "Number of Reviews (All Time)": "147826",
    "Number of Reviews (Current Versions) ": "2193",
    "Overall Rating": "4",
    "Rank": "88",
    "Rating of Current Version": "4.5",
    "Release": "Mar 16, 2017",
    "Seller": "Roblox Corporation",
    "Size": " 117 MB",
    "Version": "2.282.109386"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Here comes new BRAIN TEASERS from the maker of Block!, Pipe Lines : Hexa & Words Crush: Hidden Word!.Roll The Ball: slide puzzle is a simple addictive unblock puzzle game, keep you playing it!Do you like the game genres as below? Great! Roll the Ball has all the elements. ;)• Sliding Puzzles, Just move and move!• Puzzle Games, Thought-provoking fun.• Brain Teasers, Test yourself. Exercise your brain.• Escape Games, Can you get out? Let's go.• Hidden Object Games, Find the hidden path.• Physics Puzzler, Physics-based gaming.• Match-3 Puzzle, Easy to learn but hard to master.• Retro Games, Revisit the classics• Rule the Rotation, Spinning games.• Exam Prep & Tutoring, Practice makes perfect. Train you brain to active mind.• Family Puzzle Games, Enjoy the game with you family.Move the blocks with your finger to create a path for moving the ball to the red GOAL block. But riveted blocks can't be moved. Are you ready to play? Download and start solving puzzles now!FEATURES• SLIDING PUZZLE: An essential is for the adult to kids of all ages.• TONS OF EPIC LEVELS: You can enjoy the game enough.• NO TIME LIMIT: Play at your own pace.• NO WIFI? NO PROBLEM! Games you can play offline.• MORE VARIATIONS: Moving, Rotation mode to challenge & Star mode to relax.• USEFUL IN-GAME FUNCTIONS:-- RESTART: Just restart a level quickly.-- UNDO : Have a mistake? Don't worry, just put it back.-- HINTS : It's a good friend. Of course, it may be wrong.• GET 7 DAILY BONUS & GIFTS: The Santa may give gifts to you. Check a message box often.• ANNOYING ADS? NO PROBLEM! Buy AD FREE(USD 1.99) or Participate in ads improvement program by in-game Email.• OPTIMIZED to App Store-- Support both iPhones, iPads & iPod Touches-- Support both 32 & 64 bit DEVICES.-- LEADERBOARDS & ACHIEVEMENTS from Game Center.NOTES• Roll the Ball contains the ads like banner, interstitial, video and house ads.• Roll the Ball sells In-app products like AD FREE, Hints and level packages.E-MAIL• contact@bitmango.comHOMEPAGE• http://www.bitmango.comLike us on FACEBOOK• https://www.facebook.com/BitMangoGamesLet's ROLL THE BALL. Let's CRUSH THE PUZZLE. lol",
    "In App Purchases": "Yes",
    "Name": "Roll the Ball™ - slide puzzle",
    "Number of Reviews (All Time)": "16198",
    "Number of Reviews (Current Versions) ": "3706",
    "Overall Rating": "4.5",
    "Rank": "89",
    "Rating of Current Version": "4.5",
    "Release": "Feb 10, 2017",
    "Seller": "BitMango Corporation",
    "Size": " 183 MB",
    "Version": "1.6.5"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Reference",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "On more than 180 million devices around the world, people are reading, listening to, watching, and sharing the Bible using the #1 rated Bible App—completely free. Over 1,000 Bible versions, in hundreds of languages. Hundreds of Reading Plans, in over 40 languages. Add your own Verse Images, highlights, bookmarks, and public or private notes.Customize your reading experience. Access everything when you’re connected, or download specific versions for offline use.The Bible App lets you explore the Bible with your closest friends. Share honest conversations about Scripture with a community of people you know and trust. Learn along with them as you see what they’re discovering.READ THE BIBLE* Set your Bible App’s interface for your choice of more than 30 languages.* Easily select from hundreds of Bible versions, in over 775 languages.* Choose from popular versions like the NIV, NASB, ESV, NKJV, NLT, KJV, The Message, and more.* Offline Bibles: Read even without network access (available for select versions).* Listen to audio Bibles and enjoy all-new skip, playback speed, and timer controls. (Audio Bibles available for select versions and are not downloadable).USE THE BIBLE WITH YOUR FRIENDS* Put the Bible at the center of your closest relationships with mutual friendships in the Bible App* See a stream of Bible activity that shows what you and your friends are noting, bookmarking, and highlighting* Comment to share your thoughts, ask questions, and have meaningful conversations in the app as you study God’s Word togetherSTUDY THE BIBLE* Hundreds of Plans: you’ll find devotionals, as well as Plans that lead you through specific topics, portions of the Bible, or even the entire Bible in a year.* Watch and share clips from ‘The Bible’ TV miniseries, the world-changing ‘JESUS’ film, and ‘The Lumo Project.’* Search the Bible using keywords.CUSTOMIZE YOUR BIBLE* All-new Themes let you select a color palette for your entire Bible App experience.* Verse Images: Turn Bible verses into shareable art.* Highlight with custom colors—just like a paper Bible.* Bookmark passages: Share, memorize, or just keep track of your favorites.* Share verses with friends using social networks, email, or SMS (text).* Add notes to passages: Keep them private so only you can see them, or make them public to share with friends.* With a free YouVersion account, see all of your notes, highlights, bookmarks, and reading plans on any supported device through cloud syncing.* Read easier with settings like fonts, text size, and contrast for bright or low-light conditions.CONNECT WITH YOUVERSION* Contact support from directly inside the Bible App.* Like us on Facebook: http://facebook.com/youversion* Follow us on Twitter: http://twitter.com/youversion* Catch up on the latest on our blog: http://blog.youversion.com* Use YouVersion online: http://bible.comDownload the world’s #1 Bible App now and enjoy the Bible reading experience loved by millions!",
    "In App Purchases": "No",
    "Name": "Bible",
    "Number of Reviews (All Time)": "953734",
    "Number of Reviews (Current Versions) ": "32107",
    "Overall Rating": "4.5",
    "Rank": "90",
    "Rating of Current Version": "5",
    "Release": "Feb 13, 2017",
    "Seller": "Information Not Available",
    "Size": " 89.5 MB",
    "Version": "7.3"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Travel",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "On more than 180 million devices around the world, people are reading, listening to, watching, and sharing the Bible using the #1 rated Bible App—completely free. Over 1,000 Bible versions, in hundreds of languages. Hundreds of Reading Plans, in over 40 languages. Add your own Verse Images, highlights, bookmarks, and public or private notes.Customize your reading experience. Access everything when you’re connected, or download specific versions for offline use.The Bible App lets you explore the Bible with your closest friends. Share honest conversations about Scripture with a community of people you know and trust. Learn along with them as you see what they’re discovering.READ THE BIBLE* Set your Bible App’s interface for your choice of more than 30 languages.* Easily select from hundreds of Bible versions, in over 775 languages.* Choose from popular versions like the NIV, NASB, ESV, NKJV, NLT, KJV, The Message, and more.* Offline Bibles: Read even without network access (available for select versions).* Listen to audio Bibles and enjoy all-new skip, playback speed, and timer controls. (Audio Bibles available for select versions and are not downloadable).USE THE BIBLE WITH YOUR FRIENDS* Put the Bible at the center of your closest relationships with mutual friendships in the Bible App* See a stream of Bible activity that shows what you and your friends are noting, bookmarking, and highlighting* Comment to share your thoughts, ask questions, and have meaningful conversations in the app as you study God’s Word togetherSTUDY THE BIBLE* Hundreds of Plans: you’ll find devotionals, as well as Plans that lead you through specific topics, portions of the Bible, or even the entire Bible in a year.* Watch and share clips from ‘The Bible’ TV miniseries, the world-changing ‘JESUS’ film, and ‘The Lumo Project.’* Search the Bible using keywords.CUSTOMIZE YOUR BIBLE* All-new Themes let you select a color palette for your entire Bible App experience.* Verse Images: Turn Bible verses into shareable art.* Highlight with custom colors—just like a paper Bible.* Bookmark passages: Share, memorize, or just keep track of your favorites.* Share verses with friends using social networks, email, or SMS (text).* Add notes to passages: Keep them private so only you can see them, or make them public to share with friends.* With a free YouVersion account, see all of your notes, highlights, bookmarks, and reading plans on any supported device through cloud syncing.* Read easier with settings like fonts, text size, and contrast for bright or low-light conditions.CONNECT WITH YOUVERSION* Contact support from directly inside the Bible App.* Like us on Facebook: http://facebook.com/youversion* Follow us on Twitter: http://twitter.com/youversion* Catch up on the latest on our blog: http://blog.youversion.com* Use YouVersion online: http://bible.comDownload the world’s #1 Bible App now and enjoy the Bible reading experience loved by millions!",
    "In App Purchases": "No",
    "Name": "Airbnb",
    "Number of Reviews (All Time)": "953734",
    "Number of Reviews (Current Versions) ": "32107",
    "Overall Rating": "4.5",
    "Rank": "91",
    "Rating of Current Version": "5",
    "Release": "Feb 13, 2017",
    "Seller": "Information Not Available",
    "Size": " 89.5 MB",
    "Version": "7.3"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Impress friends with amazing videos and photo video slideshows plus free popular music! Get featured & become famous with fun challenges for every talent - like dance, beauty, art, comedy, music, animals, lip-sync and more. 200 million people have already come to Flipagram to create half a billion amazing video stories and counting. Pick fun video effects and share your videos privately or with friends and fans across all your socials.Highlights:- Fast, simple video editor to combine photos, videos, effects and free music - Upload video clips and photos from your camera roll or shoot a flipagram directly with our in-app camera- Longer free music clips than any other app, so you can pick the perfect soundtrack for your videos- Adjust speed, add filters, reorder moments and zoom/crop your photos and videos- Use Vibes™ and Beatbrushes™, sound-activated filters and brushes that react to the beat and liven up your photos and videos- Meet and collaborate with creative, fun people and improve your skills- Get Featured, climb the Top Flipsters leaderboard, gain fans, get likes, and become a star- Celebrate friendships, relationships, birthdays, holidays, and all the people you love- Turn all your selfies and snaps into one video with your favorite song- Share instantly to all your favorite apps: Instagram, Facebook, Twitter, YouTube, Tumblr, Email, Text, Pinterest, FB Messenger, WhatsApp, KIK, or LINE.We’re looking for creative, high-quality Flipsters to feature and make famous.Show off your creativity & talent in challenges and  tag #featuremyflip to get noticed!Feedback? Email support@flipagram.com or tweet @FlipagramHelp.",
    "In App Purchases": "Yes",
    "Name": "Flipagram",
    "Number of Reviews (All Time)": "78776",
    "Number of Reviews (Current Versions) ": "245",
    "Overall Rating": "4.5",
    "Rank": "92",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Flipagram, Inc.",
    "Size": " 79.7 MB",
    "Version": "8.15.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Productivity",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Impress friends with amazing videos and photo video slideshows plus free popular music! Get featured & become famous with fun challenges for every talent - like dance, beauty, art, comedy, music, animals, lip-sync and more. 200 million people have already come to Flipagram to create half a billion amazing video stories and counting. Pick fun video effects and share your videos privately or with friends and fans across all your socials.Highlights:- Fast, simple video editor to combine photos, videos, effects and free music - Upload video clips and photos from your camera roll or shoot a flipagram directly with our in-app camera- Longer free music clips than any other app, so you can pick the perfect soundtrack for your videos- Adjust speed, add filters, reorder moments and zoom/crop your photos and videos- Use Vibes™ and Beatbrushes™, sound-activated filters and brushes that react to the beat and liven up your photos and videos- Meet and collaborate with creative, fun people and improve your skills- Get Featured, climb the Top Flipsters leaderboard, gain fans, get likes, and become a star- Celebrate friendships, relationships, birthdays, holidays, and all the people you love- Turn all your selfies and snaps into one video with your favorite song- Share instantly to all your favorite apps: Instagram, Facebook, Twitter, YouTube, Tumblr, Email, Text, Pinterest, FB Messenger, WhatsApp, KIK, or LINE.We’re looking for creative, high-quality Flipsters to feature and make famous.Show off your creativity & talent in challenges and  tag #featuremyflip to get noticed!Feedback? Email support@flipagram.com or tweet @FlipagramHelp.",
    "In App Purchases": "Yes",
    "Name": "Yahoo Mail - Keeps You Organized!",
    "Number of Reviews (All Time)": "78776",
    "Number of Reviews (Current Versions) ": "245",
    "Overall Rating": "4.5",
    "Rank": "93",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Flipagram, Inc.",
    "Size": " 79.7 MB",
    "Version": "8.15.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Impress friends with amazing videos and photo video slideshows plus free popular music! Get featured & become famous with fun challenges for every talent - like dance, beauty, art, comedy, music, animals, lip-sync and more. 200 million people have already come to Flipagram to create half a billion amazing video stories and counting. Pick fun video effects and share your videos privately or with friends and fans across all your socials.Highlights:- Fast, simple video editor to combine photos, videos, effects and free music - Upload video clips and photos from your camera roll or shoot a flipagram directly with our in-app camera- Longer free music clips than any other app, so you can pick the perfect soundtrack for your videos- Adjust speed, add filters, reorder moments and zoom/crop your photos and videos- Use Vibes™ and Beatbrushes™, sound-activated filters and brushes that react to the beat and liven up your photos and videos- Meet and collaborate with creative, fun people and improve your skills- Get Featured, climb the Top Flipsters leaderboard, gain fans, get likes, and become a star- Celebrate friendships, relationships, birthdays, holidays, and all the people you love- Turn all your selfies and snaps into one video with your favorite song- Share instantly to all your favorite apps: Instagram, Facebook, Twitter, YouTube, Tumblr, Email, Text, Pinterest, FB Messenger, WhatsApp, KIK, or LINE.We’re looking for creative, high-quality Flipsters to feature and make famous.Show off your creativity & talent in challenges and  tag #featuremyflip to get noticed!Feedback? Email support@flipagram.com or tweet @FlipagramHelp.",
    "In App Purchases": "Yes",
    "Name": "Sweet Jelly Candy",
    "Number of Reviews (All Time)": "78776",
    "Number of Reviews (Current Versions) ": "245",
    "Overall Rating": "4.5",
    "Rank": "94",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Flipagram, Inc.",
    "Size": " 79.7 MB",
    "Version": "8.15.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Social Networking",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Impress friends with amazing videos and photo video slideshows plus free popular music! Get featured & become famous with fun challenges for every talent - like dance, beauty, art, comedy, music, animals, lip-sync and more. 200 million people have already come to Flipagram to create half a billion amazing video stories and counting. Pick fun video effects and share your videos privately or with friends and fans across all your socials.Highlights:- Fast, simple video editor to combine photos, videos, effects and free music - Upload video clips and photos from your camera roll or shoot a flipagram directly with our in-app camera- Longer free music clips than any other app, so you can pick the perfect soundtrack for your videos- Adjust speed, add filters, reorder moments and zoom/crop your photos and videos- Use Vibes™ and Beatbrushes™, sound-activated filters and brushes that react to the beat and liven up your photos and videos- Meet and collaborate with creative, fun people and improve your skills- Get Featured, climb the Top Flipsters leaderboard, gain fans, get likes, and become a star- Celebrate friendships, relationships, birthdays, holidays, and all the people you love- Turn all your selfies and snaps into one video with your favorite song- Share instantly to all your favorite apps: Instagram, Facebook, Twitter, YouTube, Tumblr, Email, Text, Pinterest, FB Messenger, WhatsApp, KIK, or LINE.We’re looking for creative, high-quality Flipsters to feature and make famous.Show off your creativity & talent in challenges and  tag #featuremyflip to get noticed!Feedback? Email support@flipagram.com or tweet @FlipagramHelp.",
    "In App Purchases": "Yes",
    "Name": "Wishbone - Compare Anything",
    "Number of Reviews (All Time)": "78776",
    "Number of Reviews (Current Versions) ": "245",
    "Overall Rating": "4.5",
    "Rank": "95",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Flipagram, Inc.",
    "Size": " 79.7 MB",
    "Version": "8.15.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "PicCollage has everything you need to create amazing collages with your photos. With our new layout and clean design, it’s even easier to unleash your creativity. Play with our seasonal stickers, backgrounds, and templates. Enjoy exclusive content from huge brands such as Hello Kitty, Packman, tokidoki and many more! We’ve improved our grid options and optimized our phone case templates so you can easily create a custom case for your phone.Use our powerful web search feature to find the perfect photos to add to your creations, add GIFs and stickers, share on social media, or print your collages at home with the touch of a button by connecting to your wireless printer! Join over 130 MILLION people who love to create using PicCollage.Awesome features:* New easy-to-use layout and clean design* Message stickers for PicCollage are available on iOS10* Optimized custom phone case templates to help you create awesome phone cases from your collages.* Fun face detection templates - Add party hats to your collages* Improved grid options* Import photos from your photo library, Instagram, Facebook and web image search.* Add text with lots of NEW fun fonts to choose from.* Simple touch gestures to rotate, resize, flick to delete.* Double-tap a photo to edit with Aviary effects, clip photo, adjust borders, copy/paste images, and \"flip\" stickers.* Just tap on the lower-left Frame icon, and swipe to select a frame to make an instant collage!* Clip photos by outlining the area you want with your finger.* An ever-growing library of backgrounds and stickers to choose from!* Choose Templates to create themed collages.* Share your creations to Instagram, Facebook, Twitter, SMS, email, and more.Recent updates include:* New FREE fonts, stickers, and backgrounds!* Fun seasonal sticker packs (Valentines incoming!)* New stickers from Hello Kitty, Tokidoki, and more* Seasonal backgrounds* Improved photo grid options* Increased scrap limit from 30 to 50* Magic dot feature: Make it easier to scale or rotate scraps with one finger! Just move the dot to arrange your photos, stickers or text scraps easily.* Print your collages by connecting AirPrint printer at home.* Powerful Bing web search to help you find relevant photos.* Make your creations into personalized products- phone cases, prints, magnet, greeting cards or posters!For teachers and parents, we have a \"School Settings\" feature that allows you to: * Disable \"Photos from Web\" * Disable all social features such as the Explore and Profile tabs * Disable ads... Perfect for young kids and classrooms!\"Whether you're 6 or 106, you'll find the free Pic Collage app an excellent way to dress up your photo collection and share your handiwork.\" - USA Today\"You can impress your mother, brag to your co-workers, and make your vacation look even better than it really was, all before you pack your suitcase to return home ... It could be the fastest way you'll ever find to organize a batch of photos ... Also makes gorgeous emails and can turn your image into a real postcard.\" - LA Times and NewsdayPicCollage(TM) and “Pic Collage” are trademarks of Cardinal Blue Software. For more detailed terms of service: http://cardinalblue.com/tos",
    "In App Purchases": "Yes",
    "Name": "PicCollage - Photo Collage Maker & Picture Editor",
    "Number of Reviews (All Time)": "119726",
    "Number of Reviews (Current Versions) ": "362",
    "Overall Rating": "5",
    "Rank": "96",
    "Rating of Current Version": "5",
    "Release": "Mar 14, 2017",
    "Seller": "Cardinal Blue Software, Inc",
    "Size": " 112 MB",
    "Version": "7.8.6"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Entertainment",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Stream and download popular movies and TV shows including Amazon exclusives like The Grand Tour, The Man in the High Castle, and Emmy award winner Tumble Leaf.  Customers in the US can also use this app to watch videos purchased or rented on Amazon, and videos included with a subscription paid for on Amazon such as HBO, SHOWTIME and STARZ.  App features:-Download movies and TV shows over Wi-Fi or cellular to watch anywhere, anytime.-Prime members in India can enjoy hundreds of top Bollywood and regional Indian hits like Sultan, Baar Baar Dekho, Kabali, Dhoom series and more!-View IMDB data about the actors, songs and trivia related to your videos during playback with X-Ray-Stream the first episode of select TV shows for free. First Episode Free videos include advertising before and during your videos-Watch on your Apple TV using AirPlay (requires Apple TV 2nd generation or later) (US only)-Access hundreds of thousands of movies and TV episodes you bought or rented including new release movies or the latest TV programming, with the ability to download titles for offline viewing (US only)-Watch on your TV using HDMI and your Apple Digital AV Adapter -Stream the first episode of selected TV shows for free. First Episode Free videos include advertising before and during your videos (US only)-Add videos to Your Watchlist from any Amazon Prime Video compatible device for later viewing -Start watching the next episode of the show you are currently streaming automatically with Auto Play.This app is designed for an unmodified version of iOS.",
    "In App Purchases": "No",
    "Name": "Amazon Prime Video",
    "Number of Reviews (All Time)": "40828",
    "Number of Reviews (Current Versions) ": "786",
    "Overall Rating": "4",
    "Rank": "97",
    "Rating of Current Version": "4",
    "Release": "Mar 02, 2017",
    "Seller": "AMZN Mobile LLC",
    "Size": " 69.3 MB",
    "Version": "4.2"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "News",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Stream and download popular movies and TV shows including Amazon exclusives like The Grand Tour, The Man in the High Castle, and Emmy award winner Tumble Leaf.  Customers in the US can also use this app to watch videos purchased or rented on Amazon, and videos included with a subscription paid for on Amazon such as HBO, SHOWTIME and STARZ.  App features:-Download movies and TV shows over Wi-Fi or cellular to watch anywhere, anytime.-Prime members in India can enjoy hundreds of top Bollywood and regional Indian hits like Sultan, Baar Baar Dekho, Kabali, Dhoom series and more!-View IMDB data about the actors, songs and trivia related to your videos during playback with X-Ray-Stream the first episode of select TV shows for free. First Episode Free videos include advertising before and during your videos-Watch on your Apple TV using AirPlay (requires Apple TV 2nd generation or later) (US only)-Access hundreds of thousands of movies and TV episodes you bought or rented including new release movies or the latest TV programming, with the ability to download titles for offline viewing (US only)-Watch on your TV using HDMI and your Apple Digital AV Adapter -Stream the first episode of selected TV shows for free. First Episode Free videos include advertising before and during your videos (US only)-Add videos to Your Watchlist from any Amazon Prime Video compatible device for later viewing -Start watching the next episode of the show you are currently streaming automatically with Auto Play.This app is designed for an unmodified version of iOS.",
    "In App Purchases": "No",
    "Name": "TopBuzz: Best Viral Videos, GIFs, TV & News",
    "Number of Reviews (All Time)": "40828",
    "Number of Reviews (Current Versions) ": "786",
    "Overall Rating": "4",
    "Rank": "98",
    "Rating of Current Version": "4",
    "Release": "Mar 02, 2017",
    "Seller": "AMZN Mobile LLC",
    "Size": " 69.3 MB",
    "Version": "4.2"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Health & Fitness",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Stream and download popular movies and TV shows including Amazon exclusives like The Grand Tour, The Man in the High Castle, and Emmy award winner Tumble Leaf.  Customers in the US can also use this app to watch videos purchased or rented on Amazon, and videos included with a subscription paid for on Amazon such as HBO, SHOWTIME and STARZ.  App features:-Download movies and TV shows over Wi-Fi or cellular to watch anywhere, anytime.-Prime members in India can enjoy hundreds of top Bollywood and regional Indian hits like Sultan, Baar Baar Dekho, Kabali, Dhoom series and more!-View IMDB data about the actors, songs and trivia related to your videos during playback with X-Ray-Stream the first episode of select TV shows for free. First Episode Free videos include advertising before and during your videos-Watch on your Apple TV using AirPlay (requires Apple TV 2nd generation or later) (US only)-Access hundreds of thousands of movies and TV episodes you bought or rented including new release movies or the latest TV programming, with the ability to download titles for offline viewing (US only)-Watch on your TV using HDMI and your Apple Digital AV Adapter -Stream the first episode of selected TV shows for free. First Episode Free videos include advertising before and during your videos (US only)-Add videos to Your Watchlist from any Amazon Prime Video compatible device for later viewing -Start watching the next episode of the show you are currently streaming automatically with Auto Play.This app is designed for an unmodified version of iOS.",
    "In App Purchases": "No",
    "Name": "Headspace: Guided Meditation and Mindfulness",
    "Number of Reviews (All Time)": "40828",
    "Number of Reviews (Current Versions) ": "786",
    "Overall Rating": "4",
    "Rank": "99",
    "Rating of Current Version": "4",
    "Release": "Mar 02, 2017",
    "Seller": "AMZN Mobile LLC",
    "Size": " 69.3 MB",
    "Version": "4.2"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Love home decorating? Play Design Home! If you daydream about designing beautiful, unique interiors for your many fantastic homes, you can now bring your design dreams to life in this visually stunning 3D experience. Join millions of design and home decor lovers to discover, shop items you love, style gorgeous rooms and get recognized for your creativity! In Design Home, you can express your unique design style by using furniture and decor items from real, high-end brands to design beautiful, photo-realistic interiors. You can even discover and vote on new looks and styles created by other players and win exclusive in-game prizes for the designs that you have created.It’s fun, it’s quick and you can share design ideas with friends!SHOP THE BEST DECOR BRANDS. We’ve partnered with high-end brands like Design Within Reach, Serena & Lily, Kathy Kuo Home, Noir and Loloi (to name a few!) to bring your design dreams to life. With new furniture and decor added every day, you are sure to discover styles that you love!DESIGN THE PERFECT ROOM. Choose from thousands of pieces of high-end furniture and decor, rugs, plants and wall art - in an endless variety of colors and styles - to design incredible interiors that range from chic metropolitan high-rises to exotic beach-front estates and cozy mountain retreats. VOTE ON THE BEST DESIGNS. Cast your vote and decide what’s hot in the Design Home community. With thousands of entries for each design challenge, you get to decide if a design is 5-star worthy or if it missed the mark. Get feedback, ideas and inspiration from other players and watch your interior design skills improve every day!Love the items in your favorite design? You can shop for them directly through Design Home! Click any piece you love and buy it for your own home. With new pieces added every day, Design Home literally puts the best home decor directly at your fingertips. Not only can you discover brands and trends, you can own them, too!Download Design Home now and start crafting the beautiful rooms of your dreams!",
    "In App Purchases": "Yes",
    "Name": "Design Home",
    "Number of Reviews (All Time)": "14975",
    "Number of Reviews (Current Versions) ": "1750",
    "Overall Rating": "4.5",
    "Rank": "100",
    "Rating of Current Version": "4.5",
    "Release": "Mar 01, 2017",
    "Seller": "Crowdstar Inc",
    "Size": " 158 MB",
    "Version": "1.01.39"
  }
]