[
  {
    "Age Restriction": "Rated 4+",
    "Category": "Sports",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "The #1 bracket app is back and better than ever for the 2017 NCAA Men's College Basketball Tournament! Create up to 25 brackets and compete for a chance to win $10,000 and a trip to Hawaii for the Maui Invitational! Compete for bragging rights against professional athletes, celebrities and our very own ESPN talent to see who tops the leaderboard. Download ESPN Tournament Challenge and start your march to the Final Four. What do you get with ESPN Tournament Challenge?- Optimized bracket experience, including new bracket performance information and updated matchup previews for each game of the tournament. - 'My Bracket' to quickly create and access your brackets, groups, and more. - Use 'Bracketcast', ESPN's one-of-a-kind live scoring experience for brackets, to follow upsets and underdogs and see how they impact your brackets and your group members' brackets. - Auto-fill feature within the bracket to create brackets in just a few taps. Pick your bracket but want to make another and just change the champion? Import your bracket, change the champion, and submit another bracket! Boom! - 'Leaders' tab shows you how you stack up against the competition--friends, family and celebrities!- 'More Games' for quick access to Women's Tournament Challenge, Tournament Challenge Second Chance, the ESPN Fantasy app and more! - Join up to 3 groups with each of your brackets. You can join celebrity groups with ESPN talent and professional athletes, fan groups for colleges and universities across the country, or create your own group for family and friends!Download the app now and start playing today!Terms of Use: http://disneytermsofuse.com/Privacy Policy: https://disneyprivacycenter.com/Before you download this app, please consider that it includes advertising, some of which may be targeted advertising, some of which may be targeted to your interests. You may choose to control targeted advertising within mobile applications by using your mobile device settings (for example, by re-setting your device's advertising identifier and/or opting out of interest based ads).",
    "In App Purchases": "No",
    "Name": "ESPN Tournament Challenge",
    "Number of Reviews (All Time)": "39218",
    "Number of Reviews (Current Versions) ": "28",
    "Overall Rating": "4",
    "Rank": "1",
    "Rating of Current Version": "3",
    "Release": "Mar 15, 2017",
    "Seller": "ESPN Inc.",
    "Size": " 69.1 MB",
    "Version": "5.5.3"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Utilities",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Bitmoji is your own personal emoji.• Create an expressive cartoon avatar• Choose from a huge library of stickers – all featuring YOU• Use Bitmoji in Snapchat, iMessage and wherever else you chatUsing Bitmoji in Snapchat unlocks friendmoji – 2-person bitmojis featuring you and your friends!",
    "In App Purchases": "No",
    "Name": "Bitmoji - Your Personal Emoji",
    "Number of Reviews (All Time)": "36789",
    "Number of Reviews (Current Versions) ": "246",
    "Overall Rating": "4.5",
    "Rank": "2",
    "Rating of Current Version": "3.5",
    "Release": "Mar 06, 2017",
    "Seller": "Bitstrips Inc.",
    "Size": " 80.9 MB",
    "Version": "10.3"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Photo & Video",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Life's more fun when you live in the moment :) Happy Snapping!* * *Please note: Snapchatters can always capture or save your messages, such as by taking a screenshot or using a camera. Be mindful of what you Snap!",
    "In App Purchases": "No",
    "Name": "Snapchat",
    "Number of Reviews (All Time)": "305774",
    "Number of Reviews (Current Versions) ": "113",
    "Overall Rating": "2.5",
    "Rank": "3",
    "Rating of Current Version": "3",
    "Release": "Mar 15, 2017",
    "Seller": "Snap, Inc.",
    "Size": " 191 MB",
    "Version": "10.4.1.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Instagram is a simple way to capture and share the world’s moments. Follow your friends and family to see what they’re up to, and discover accounts from all over the world that are sharing things you love. Join the community of over 500 million people and express yourself by sharing all the moments of your day––the highlights and everything in between, too.Use Instagram to:* Post photos and videos you want to keep on your profile grid. Edit them with filters and creative tools and combine multiple clips into one video.* Share multiple photos and videos (as many as you want!) to your story. Bring them to life with text and drawing tools. They disappear after 24 hours and won't appear on your profile grid or in feed. * Go live to connect with your friends and followers right now. When you're done, live stories disappear.* Send disappearing photos and videos, text messages and posts from your feed to groups and friends with Instagram Direct.* Watch stories and live videos from the people you follow in a bar at the top of your feed.* Discover stories, photos and videos you might like and follow new accounts on the Explore tab.* Enable Handoff to switch between your Apple Watch and your iPhone.",
    "In App Purchases": "No",
    "Name": "Instagram",
    "Number of Reviews (All Time)": "2140015",
    "Number of Reviews (Current Versions) ": "1271",
    "Overall Rating": "4.5",
    "Rank": "4",
    "Rating of Current Version": "3.5",
    "Release": "Mar 13, 2017",
    "Seller": "Information Not Available",
    "Size": " 94.7 MB",
    "Version": "10.12"
  },
  {
    "Age Restriction": "You must be at least 17 years old to download this app.",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get the official YouTube app for iPhone and iPad.See what the world is watching in music, gaming, entertainment, news and more. Subscribe to channels, share with friends, edit and upload videos, and watch on any device.You can also create playlists, check out what’s trending, express yourself with comments, share videos with friends, cast a video to your TV, and more – all from inside the app.FIND VIDEOS YOU LOVE FAST- Browse personal recommendations on the home tab- See the latest from the creators you follow on the subscriptions tab- Discover the world’s hottest videos on the trending tab- Look up videos you watched or liked on the library tabCONNECT AND SHARE- Let people know how you feel with likes, comments, or shares- Edit, add filters or music, and upload your own videos all inside the appGet 1 month of YouTube Red for free. Existing YouTube Red or Google Play Music members and users of either service who have already received this 30 day trial are not eligible. Monthly charges apply for YouTube Red membership outside of trial periods.Monthly price: $12.99 USD / $14.99 AUD / $15.99 NZD / $139 pesos MXN / $9.89 USD (KR only)If you subscribe via iTunes:Payment will be charged to iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period. Account will be charged for renewal within 24 hours prior to the end of the current period at the rate of the selected plan. Subscriptions and auto-renewal may be managed  by going to Account Settings after purchaseAny unused portion of a free trial period will be forfeited when purchasing a subscription.YouTube paid service terms: https://www.youtube.com/t/terms_paidservicePrivacy policy: https://www.google.com/policies/privacy",
    "In App Purchases": "Yes",
    "Name": "YouTube - Watch, Upload and Share Videos",
    "Number of Reviews (All Time)": "266571",
    "Number of Reviews (Current Versions) ": "247",
    "Overall Rating": "2.5",
    "Rank": "5",
    "Rating of Current Version": "3",
    "Release": "Mar 15, 2017",
    "Seller": "Google, Inc.",
    "Size": " 114 MB",
    "Version": "12.09"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Social Networking",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Instantly reach the people in your life—for free. Messenger is just like texting, but you don't have to pay for every message (it works with your data plan). Not just for Facebook friends: Message people in your phone book and just enter a phone number to add a new contact.Group chats: Create groups for the people you message most. Name them, set group photos and keep them all in one place.Photos and videos: Shoot videos and snap selfies or other photos right from the app and send them with one tap.Free calls: Talk as long as you want, even with people in other countries. (Calls are free over Wi-Fi. Otherwise, standard data charges apply.)Even more ways to message: Bring your conversations to life with stickers. Preview your camera roll photos and videos without leaving the conversation--then choose the perfect ones to send.Record voice messages when you have more to say.Extra features:Know when people have seen your messages.Forward messages or photos to people who weren't in the conversation.Search for people and groups to quickly get back to them.Turn on location to let people know when you're nearby.See who's available on Messenger and who's active on Facebook. Turn off notifications when you're working, sleeping or just need a break.Stay logged in so you never miss a message.Continued use of GPS running in the background can dramatically decrease battery life. Messenger uses location data to make features work, help people connect and more.",
    "In App Purchases": "No",
    "Name": "Messenger",
    "Number of Reviews (All Time)": "344373",
    "Number of Reviews (Current Versions) ": "307",
    "Overall Rating": "3",
    "Rank": "6",
    "Rating of Current Version": "3",
    "Release": "Mar 15, 2017",
    "Seller": "Information Not Available",
    "Size": " 265 MB",
    "Version": "109.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Navigation",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Google Maps makes navigating your world faster and easier. Find the best places in town and the information you need to get there.Get there faster with real-time updates• Beat traffic with real-time ETAs and traffic conditions• Catch your bus, train, or ride-share with real-time transit info• Save time with automatic re-routing based on live traffic, incidents, and road closures• Don't miss a turn or exit with lane guidance• Find pit stops along your route like gas stations and coffee spotsDiscover places and explore like a local• Find top-rated restaurants and local businesses, wherever you are• Decide on the best places to go with reviews, ratings, and pictures of foods and interiors• Plan your visit and see menus, make reservations, and find when places are typically busiest• Help others discover the best places by sharing reviews, photos and more• Save places you want to or often visit, and quickly find them later from any computer or deviceExperience the Google Maps difference• Offline maps to search and navigate without an internet connection• Street View and indoor imagery for restaurants, shops, museums and more• Indoor maps to quickly find your way inside big places like airports, malls and stadiums• Comprehensive, accurate maps in 220 countries and territories• Transit schedules and maps for over 15,000 cities• Detailed business information on over 100 million places* Some features not available in all countries**Continued use of GPS running in the background can dramatically decrease battery life.",
    "In App Purchases": "No",
    "Name": "Google Maps - Navigation & Transit",
    "Number of Reviews (All Time)": "150771",
    "Number of Reviews (Current Versions) ": "991",
    "Overall Rating": "4.5",
    "Rank": "7",
    "Rating of Current Version": "4",
    "Release": "Feb 28, 2017",
    "Seller": "Information Not Available",
    "Size": " 102 MB",
    "Version": "4.28.1"
  },
  {
    "Age Restriction": "You must be at least 17 years old to download this app.",
    "Category": "Sports",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "CBS Sports -- Your one-stop sports app - available on iPhone, iPad, Apple Watch, and Apple TV.Get lightning fast scores, stats, news, tweets & push notifications for all major sports - personalized to your favorite teams. PLUS - all year long - watch live sporting events such as SEC football games (Sept-Dec), NCAA basketball (January-April), PGA TOUR (May-August), and shows (Jim Rome, Boomer and Carton, Fantasy Football Today, Fantasy Baseball Today).New! Play CBS Sports games for free in the app. You can compete each week for cash prizes in King of the Streak and Pick 4 Fantasy Golf. Or, face off against your friends to see who knows football best with an Office Pool Manager group.Highlights + Scores – Scoreboards and real time stats for for all major sports: - Football (NFL, NCAA, High School) - Baseball (MLB) - Basketball (NBA, NCAA) - Hockey (NHL) - Soccer (Premier League, MLS, Champions League, Bundesliga, La Liga, Serie A, Europa League, Ligue 1, Scottish Premier, Dutch Eredivisie, Mexican Primera, Brazilian Serie A, Argentina Primera, World Cup) - Golf (PGA) - Tennis (ATP & WTA)- Auto Racing (NASCAR, F1) - Plus, one “all sports” scoreboard shows you all the action in the world, in one place - follow up to 8 games on one screen! + Personalized Push Notifications: Set up your favorite teams to be notified of scoring updates as they happen, get team news alerts, and be the first to hear about breaking news. OR, set up single game alerts for games you care about by adding them to you \"Watchlist\".+ Live video – NCAA basketball (January-April), PGA TOUR (May-August), and SEC football games (Sept-Dec). Also get on-demand access to highlights, analysis, and original video programs. + CBS Sports Network - Optimum cable subscribers can now watch CBS Sports Network LIVE. Support for other cable providers is coming soon.+ CBS Sports Radio - Live streaming radio such as the Jim Rome Show, Doug Gottlieb and more.+ News - get team news and a personalized “My Team News” feed & Tweets+ Standings – Standings for every league, including rankings for college sports + Schedules – Team schedules are super easy to find and viewable at a glance + Special Events – Access to CBS Sports coverage of events like NCAA March Madness, The Masters, NBA Draft Day, PGA TOUR and more.+ ChromeCast enabled- You can cast CBS Sports on demand and live video to your TV, and control volume and video playback directly from the app.Download it now.",
    "In App Purchases": "No",
    "Name": "CBS Sports",
    "Number of Reviews (All Time)": "59375",
    "Number of Reviews (Current Versions) ": "97",
    "Overall Rating": "3",
    "Rank": "8",
    "Rating of Current Version": "2",
    "Release": "Mar 07, 2017",
    "Seller": "Information Not Available",
    "Size": " 112 MB",
    "Version": "10.1.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Travel",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Uber is a ridesharing app for fast, reliable rides in minutes—day or night. There’s no need to park or wait for a taxi or bus. With Uber, you just tap to request a ride, and it’s easy to pay with credit or cash in select cities.Whether you’re going to the airport or across town, there’s an Uber for every occasion. Uber is available in more than 500 cities worldwide—download the app and take your first trip today.Requesting your Uber is easy—here’s how it works:- Just open the app and tell us where you’re going.- The app uses your location so your driver knows where to pick you up.- You’ll see your driver’s picture, vehicle details, and can track their arrival on the map.- Payment can be made by credit card, cash in select cities, Apple Pay, PayPal, and more.- After the ride, you can rate your driver and provide feedback to help us improve the Uber experience. You’ll also get a receipt by email.Need a simple way to get from A to B quickly? Take uberX, our most affordable individual option. Want to save money on your ride? Take uberPOOL—you’ll travel with other riders headed your way and enjoy a lower fare. Want to elevate your experience? Take a high-end vehicle with UberBLACK. And there’s still more options—whether you’re traveling with a big group, or need a vehicle with accessibility features.See if Uber is available in your city at https://www.uber.com/citiesFollow us on Twitter at https://twitter.com/uberLike us on Facebook at https://www.facebook.com/uberHave a question? Visit uber.com/help.Note: Continued use of GPS running in the background can dramatically decrease battery life.",
    "In App Purchases": "No",
    "Name": "Uber",
    "Number of Reviews (All Time)": "46901",
    "Number of Reviews (Current Versions) ": "474",
    "Overall Rating": "3.5",
    "Rank": "9",
    "Rating of Current Version": "2",
    "Release": "Mar 06, 2017",
    "Seller": "Information Not Available",
    "Size": " 220 MB",
    "Version": "3.235.1"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Build your own Bit City! Start from a tiny town and grow to a thriving metropolis in this city building idle game from the creators of Tiny Tower. Collect profits and invest in upgrades that keep your city growing. Fill your city with new types of cars, planes and ships. Unlock cool new buildings, including famous landmarks to customize the look of your city. What are you waiting for? Start building YOUR own Bit City now!",
    "In App Purchases": "Yes",
    "Name": "Bit City",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "701",
    "Overall Rating": "Information Not Available",
    "Rank": "10",
    "Rating of Current Version": "4",
    "Release": "Mar 13, 2017",
    "Seller": "NimbleBit LLC",
    "Size": " 206 MB",
    "Version": "1.0.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Social Networking",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Keeping up with friends is faster than ever. • See what friends are up to• Share updates, photos and video• Get notified when friends like and comment on your posts• Watch and interact with live video• Play games and use your favorite appsRead our Data Use Policy, Terms and other important info in the legal section of our App Store description. Continued use of GPS running in the background can dramatically decrease battery life. Facebook doesn't run GPS in the background unless you give us permission by turning on optional features that require this.",
    "In App Purchases": "No",
    "Name": "Facebook",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "2961613",
    "Overall Rating": "Information Not Available",
    "Rank": "11",
    "Rating of Current Version": "3.5",
    "Release": "Mar 16, 2017",
    "Seller": "Facebook, Inc.",
    "Size": " 328 MB",
    "Version": "84.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "World's best words puzzle game \"Word Cookies\"This is a new word puzzle game created by BitMango, the creator of HIT app, Roll the Ball™ - slide puzzle and Block hexa puzzle !Word Cookies is a very fun and exciting word puzzle game, it makes you keep playing for FREE!The aim of the game is to find all hidden words.With this game you can easily improve your vocabulary, concentration and spelling skills.The KING of BRAIN TEASERS!Do you enjoy the word puzzle games? Do you like cookies? Do you like challenge?Here comes the perfect game for you, Word Cookies!Are you ready to find delicious words cookies at your kitchen oven?Embrace your brain power to discover words.HOW TO PLAY• Words can be vertical, horizontal, diagonal and even backwards.• Simply swipe your finger over a word to select it.• If you've found a valid word it will remain highlighted and marked on the word list as found.FEATURES• Discover hidden words from mixed letters.• Find derived words from main words and develop your brain & vocabulary skills.• Visually pleasing to play cookies in various kinds! • Feel achievement with Increased point by making more cookies!• Simple and Easy!• Daily bonus rewards• Free 200 coins payments, at the first game• Great exercise for the brain• Support both Phones and Tablets.• FREE Update!• EASY AND FUN PLAY- Easy to learn and fun to master gameplay• NO TIME LIMIT- Enjoy game for any time, anywhere and a short time.• NO WIFI? NO PROBLEM!- You can play offline in anytime.• TONS OF UNIQUE LEVELS- 32packages and over 580 awesome levels! Updates will be continued!NOTES• Enjoy the game with various devices (Phones and Tablets).• \"Word Cookies\" contain ads like banner, interstitial, video and house ads.• \"Word Cookies\" is free to play, but you can purchase In-app items like  AD FREE and packages.E-MAIL• contact@bitmango.comHOMEPAGE• http://www.bitmango.com/Like us on FACEBOOK• https://www.facebook.com/BitMangoGamesThanks for playing!",
    "In App Purchases": "Yes",
    "Name": "Word Cookies!",
    "Number of Reviews (All Time)": "164145",
    "Number of Reviews (Current Versions) ": "16683",
    "Overall Rating": "4.5",
    "Rank": "12",
    "Rating of Current Version": "4.5",
    "Release": "Mar 09, 2017",
    "Seller": "BitMango Corporation",
    "Size": " 113 MB",
    "Version": "1.2"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Sports",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Easily make your picks for the 2017 NCAA® Division I Men's Basketball Tournament and be ready to watch every game live with the official app of March Madness for iPhone, iPad, Apple TV, Apple Watch and iMessage. March Madness Live is the only app that allows you to make picks and watch live games all in one place, so you never miss a moment.Play NCAA March Madness Bracket ChallengePlay the official bracket game of NCAA March Madness, the only place you can watch live games from your bracket.• New Bracket Challenge Game Commissioner Zone gives you more tools than ever to manage your groups. Customize your settings by selecting brackets per player and select from Traditional and new Upset Bonus scoring, where players get more points for larger upsets.• Create up to 5 brackets.• Make picks using our easier to navigate list view or enjoy a full bracket view.• Check brackets anytime during the tournament without leaving the app.Watch March Madness LiveWatch all 67 games across TBS, CBS, TNT and truTV. Log in with your TV provider after the free 3 hour preview ends to continue watching. (Paid TV subscription required for games broadcast on TBS, TNT and truTV after 3 hour preview ends; CBS games do not require a paid TV subscription.)• AirPlay or Cast live games and video on-demand to your TV using AirPlay and Google Cast.• Replay the latest highlights while you’re watching the game live and follow along with our live blog.• Listen to a live radio broadcast from every game of the tournament.• Watch exclusive March Madness video on-demand, including classic games, in-depth analysis, highlights, and behind-the-scenes features. (Live video is only available in the US, its territories, and Bermuda.)• Receive live game notifications for upsets, overtime games, close games, and your favorite teams. • Follow up-to-the-minute scores and stats, and the official tournament bracket.• View team rosters and watch all your favorite team’s videos.Available for Apple Watch:• Get alerts for your favorite teams so you never miss an upset or close game.• Quick access to live scores and schedule. New! iMessage Stickers: • Share your excitement on iMessage with our exclusive NCAA March Madness sticker pack.----FEEDBACKWe love hearing from fans. If you have suggestions on how we can improve, please get in touch!E-mail: mmlivehelp@turner.comTwitter: @MMLive_HelpIf you're enjoying your 2017 NCAA March Madness Live experience, please let us know by rating and reviewing us in the App Store.---- SUPPORTQuestions?E-mail: mmlivehelp@turner.comPhone: 855-5MM-LIVE (855-566-5483)Twitter: @MMLive_Help(Please remember that Twitter is a public forum and information you post there will be made public. Do not post information to Twitter if you do not want it to be made public.)",
    "In App Purchases": "No",
    "Name": "NCAA March Madness Live - Men's College Basketball",
    "Number of Reviews (All Time)": "13129",
    "Number of Reviews (Current Versions) ": "101",
    "Overall Rating": "3",
    "Rank": "13",
    "Rating of Current Version": "2.5",
    "Release": "Mar 09, 2017",
    "Seller": "Information Not Available",
    "Size": " 112 MB",
    "Version": "7.0.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "The official Gmail app brings the best of Gmail to your iPhone or iPad with real-time notifications, multiple account support and search that works across all your mail.With the Gmail app, you can:- Undo Send, to prevent embarrassing mistakes- Switch between multiple accounts- Get notified of new mail fast, with notification center, badge and lock screen options- Search your mail faster with instant results, predictions as you type & spelling suggestions - Swipe to archive/delete, to quickly clear out your inbox- Read your mail with threaded conversations- Auto-complete contact names as you type from your Google contacts or your phone- Respond to Google Calendar invites right from the app- Organize your mail by archiving, labeling, starring, deleting and reporting spam- Send and receive attachments- See profile pictures as part of the conversation",
    "In App Purchases": "No",
    "Name": "Gmail - email by Google: secure, fast & organized",
    "Number of Reviews (All Time)": "130924",
    "Number of Reviews (Current Versions) ": "1912",
    "Overall Rating": "4",
    "Rank": "14",
    "Rating of Current Version": "4.5",
    "Release": "Mar 02, 2017",
    "Seller": "Google, Inc.",
    "Size": " 219 MB",
    "Version": "5.0.13"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Entertainment",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Subscribe Now on Your iPhone® or iPad®Watch TV shows and movies recommended just for you, including award-winning Netflix original series, movies, and documentaries.  Netflix has something for everyone. There’s even a safe watching experience just for kids with family-friendly entertainment. How does Netflix work? • Netflix adds TV shows and movies all the time. Browse titles or search for your favorites. • The more you watch, the better Netflix gets at recommending TV shows and movies that you’ll love—just for you. • You can create up to five individual profiles within a single Netflix account. Profiles allow different members of your household to have their own personalized Netflix experience built around the movies and TV shows they enjoy. • Instantly stream on iOS devices or on the web.Try us free for 1 month! If you enjoy your Netflix trial, do nothing and your membership will automatically continue for as long as you choose to remain a member. Netflix membership is a month-to-month subscription that begins at sign up. You can easily cancel anytime, online, 24 hours a day. There are no long-term contracts or cancellation fees. Just sign up to get started! If you subscribe via iTunes:Payment will be charged to iTunes Account at confirmation of purchase. Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period at the rate of your selected plan above. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings on the device. If you haven’t subscribed through iTunes, you can manage your subscription through Netflix.Choose the plan that’s right for you:1 Screen $7.99/month2 Screens + HD $9.99/month4 screens + ULTRA HD$11.99/monthPrivacy policy:  https://help.netflix.com/legal/privacyTerms of use:  https://help.netflix.com/legal/termsofuse",
    "In App Purchases": "Yes",
    "Name": "Netflix",
    "Number of Reviews (All Time)": "302505",
    "Number of Reviews (Current Versions) ": "120",
    "Overall Rating": "3.5",
    "Rank": "15",
    "Rating of Current Version": "3",
    "Release": "Mar 14, 2017",
    "Seller": "Netflix, Inc.",
    "Size": " 84.3 MB",
    "Version": "9.10.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Music",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Spotify is the best way to listen to music on mobile or tablet. Search for any track, artist or album and listen for free. Make and share playlists. Build your biggest, best ever music collection. Get inspired with personal recommendations, and readymade playlists for just about everything.Listen absolutely free with ads, or get Spotify Premium.Free on mobile• Play any artist, album, or playlist in shuffle mode.Free on tablet• Play any song, any time.Premium features• Play any song, any time on any device: mobile, tablet or computer.• Enjoy ad-free music. • Listen offline. • Get better sound quality.Please note: This app features Nielsen’s audience measurement software which will allow you to contribute to market research, such as Nielsen’s Audio Measurement. If you don't want to participate, you can opt-out within the app settings. To learn more about our digital audience measurement products and your choices in regard to them, please visit http://www.nielsen.com/digitalprivacy for more information.Privacy policy: http://www.spotify.com/legal/privacy-policy/Terms of use: https://www.spotify.com/legal/end-user-agreement/Love Spotify? Like us on Facebook: http://www.facebook.com/spotify Follow us on Twitter: http://twitter.com/spotify",
    "In App Purchases": "Yes",
    "Name": "Spotify Music",
    "Number of Reviews (All Time)": "846315",
    "Number of Reviews (Current Versions) ": "1466",
    "Overall Rating": "4.5",
    "Rank": "16",
    "Rating of Current Version": "4.5",
    "Release": "Mar 13, 2017",
    "Seller": "Spotify",
    "Size": " 124 MB",
    "Version": "7.9.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Music",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Powered by the Music Genome Project®, the most comprehensive music analysis ever undertaken, Pandora gives you personalized radio that plays what you love and continually evolves with your tastes.• Create personalized stations from artists, songs, genres, or comedians• Browse hundreds of curated genre stations to find the perfect match for your mood or activity• Create an account and listen on desktop, mobile, TVs and home devices, or in your car• With Pandora Plus™ (formerly Pandora One), you can listen ad-free, skip and replay all you want, and enjoy your favorite stations offline — all for only $4.99/month (new Plus features are currently only available for our US listeners).Your Pandora Plus subscription will automatically renew each month and your credit card will be charged through your iTunes account. You can turn off auto-renew at any time from your iTunes account settings. Please go to www.pandora.com/privacy and pandora.com/legal_apple for more information.Note: Pandora may use large amounts of data, and carrier data charges may apply. For best results, we recommend you connect your device to trusted Wi-Fi networks when available.",
    "In App Purchases": "Yes",
    "Name": "Pandora - Music & Radio",
    "Number of Reviews (All Time)": "1115261",
    "Number of Reviews (Current Versions) ": "177",
    "Overall Rating": "4",
    "Rank": "17",
    "Rating of Current Version": "4",
    "Release": "Mar 15, 2017",
    "Seller": "Information Not Available",
    "Size": " 127 MB",
    "Version": "8.3"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Relax your brain with the champion of time killer!Swipe your finger to throw the balls and break the bricks.Try to break as many bricks as possible before they move down to the bottom. Collect all the items to get additional balls and make an endless ball chain!The level of bricks will be increased after each round you throw the balls.Very easy to play but very hard to reach high scores. Don't forget the angle is the key point!Game Features:◉ Free to play◉ Endless gameplay◉ Simple ball control◉ Challenge your friends with the best highscore",
    "In App Purchases": "Yes",
    "Name": "Ballz",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "1644",
    "Overall Rating": "Information Not Available",
    "Rank": "18",
    "Rating of Current Version": "4.5",
    "Release": "Feb 18, 2017",
    "Seller": "Ketchapp",
    "Size": " 141 MB",
    "Version": "1.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Shopping",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Comprehensive Browse, search, get product details, read reviews and purchase millions of products available from Amazon.com and other merchants. Convenient Sign in with your existing Amazon account to access your cart, payment and shipping options. Create or find a baby or wedding registry.  No need to create a new account to manage your 1-Click settings and wish lists, track your orders and use your Prime membership benefits. Shop just as you do on the web. Fast Compare prices and check availability instantly by scanning a barcode, snapping a picture or typing your search. Apple Watch customers can now use their voice to search for products, buy with 1-Click and build a shopping list on their watch.  Secure All purchases are routed through Amazon's secure servers. Universal Shop Amazon.ca, Amazon.co.uk, Amazon.de, Amazon.fr, Amazon.com, Amazon.it, Amazon.es, Amazon.cn, Amazon.co.jp or Amazon.in from a single app.",
    "In App Purchases": "No",
    "Name": "Amazon App: shop, scan, compare, and read reviews",
    "Number of Reviews (All Time)": "125045",
    "Number of Reviews (Current Versions) ": "38",
    "Overall Rating": "3.5",
    "Rank": "19",
    "Rating of Current Version": "3",
    "Release": "Mar 14, 2017",
    "Seller": "Information Not Available",
    "Size": " 140 MB",
    "Version": "9.4.2"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Social Networking",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Pinterest is the world’s catalog of ideas. Find and save recipes, parenting hacks, style inspiration and other ideas to try! Just some of the things you can do with Pinterest:• Find everyday ideas you love—what to make for dinner, what to put on your walls, what to wear and more ideas for every part of your life.• Save ideas for later—organize ideas you save by topic, so they’re always easy to find.• Collaborate with friends—save ideas together for your next group trip, party or project.• Search for an idea even if you don’t know what it’s called—built-in search guides help point your search in the right direction.• Save ideas you find around the web—just use the Pinterest’s Save button on your mobile browser.",
    "In App Purchases": "No",
    "Name": "Pinterest",
    "Number of Reviews (All Time)": "1050953",
    "Number of Reviews (Current Versions) ": "351",
    "Overall Rating": "4.5",
    "Rank": "20",
    "Rating of Current Version": "4",
    "Release": "Mar 13, 2017",
    "Seller": "Pinterest, Inc.",
    "Size": " 75.3 MB",
    "Version": "6.21"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Challenge your friends in the new hot trivia game!Discover 1000s of themes and find more answers than your opponent to win the match. Use jokers to give you an edge and revelation wands to learn from your mistakes. Check your stats and make it to N°1 amongst your friends and worldwide!● Play against real players online● Discover 1000s of themes● Check your progress, stats and ranking● Use Jokers and revelation wands● Chat with your friends",
    "In App Purchases": "Yes",
    "Name": "Fight List",
    "Number of Reviews (All Time)": "1759",
    "Number of Reviews (Current Versions) ": "852",
    "Overall Rating": "3.5",
    "Rank": "21",
    "Rating of Current Version": "3.5",
    "Release": "Mar 08, 2017",
    "Seller": "Voodoo",
    "Size": " 32.2 MB",
    "Version": "2.15.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "•The World's #1 Pool game - now on iOS!•Play with friends! Play with Legends. Play the hit Miniclip 8 Ball Pool game on your mobile and become the best!COMPETE 1-ON-1 OR IN 8 PLAYER TOURNAMENTSRefine your skills in the practice arena, take on the world in 1-vs-1 matches, or enter tournaments to win trophies and exclusive cues! PLAY FOR POOL COINS AND EXCLUSIVE ITEMSCustomize your cue and table! In every competitive 1-vs-1 match you play, there’ll be Pool Coins at stake – win the match and the Coins are yours. You can use these to enter higher ranked matches with bigger stakes, or to buy new items in the Pool Shop.CHALLENGE YOUR FRIENDSPlaying friends is easy: sign in with your Miniclip or Facebook account and you’ll be able to challenge your friends straight from the game. Challenge friends anytime, anywhere and show off your skills.LEVEL UP8 Ball Pool’s level system means you’re always facing a challenge. Play matches to increase your ranking and get access to more exclusive match locations, where you play against only the best Pool players.iMessage PLAY8 Ball Pool is now available for iMessage! Just add 8 Ball Pool to your iMessage app drawer to play with your friends.--Download Pool by Miniclip NOW!--*This game requires internet connection.Play on the Web at miniclip.com/poolDon’t miss out on the latest news:Like 8 Ball Pool: http://on.fb.me/Wx4f23Like Miniclip: http://facebook.com/miniclipFollow us on Twitter: http://twitter.com/miniclip------------------------------------Find out more about Miniclip: http://www.miniclip.comTERMS AND CONDITIONS: http://www.miniclip.com/terms-and-conditionsPRIVACY POLICY: http://www.miniclip.com/privacyThis game requires internet connection",
    "In App Purchases": "Yes",
    "Name": "8 Ball Pool™",
    "Number of Reviews (All Time)": "405361",
    "Number of Reviews (Current Versions) ": "6063",
    "Overall Rating": "4.5",
    "Rank": "22",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Miniclip SA",
    "Size": " 86.8 MB",
    "Version": "3.9.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Social Networking",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone.",
    "Description": "WhatsApp Messenger is a FREE messaging app available for iPhone and other smartphones. WhatsApp uses your phone's Internet connection (4G/3G/2G/EDGE or Wi-Fi, as available) to let you message and call friends and family. Switch from SMS to WhatsApp to send and receive messages, calls, photos, videos, and Voice Messages. WHY USE WHATSAPP:  • NO FEES: WhatsApp uses your phone's Internet connection (4G/3G/2G/EDGE or Wi-Fi, as available) to let you message and call friends and family, so you don't have to pay for every message or call.* There are no subscription fees to use WhatsApp.• MULTIMEDIA: Send and receive photos, videos, and Voice Messages. • FREE CALLS: Call your friends and family for free with WhatsApp Calling, even if they're in another country.* WhatsApp calls use your phone's Internet connection rather than your cellular plan's voice minutes. (Note: Data charges may apply. Contact your provider for details. Also, you can't access 911 and other emergency service numbers through WhatsApp). • GROUP CHAT: Enjoy group chats with your contacts so you can easily stay in touch with your friends or family.• WHATSAPP WEB: You can also send and receive WhatsApp messages right from your computer's browser.• NO INTERNATIONAL CHARGES: There's no extra charge to send WhatsApp messages internationally. Chat with your friends around the world and avoid international SMS charges.* • SAY NO TO USERNAMES AND PINS: Why bother having to remember yet another username or PIN? WhatsApp works with your phone number, just like SMS, and integrates seamlessly with your phone's existing address book. • ALWAYS LOGGED IN: With WhatsApp, you're always logged in so you don't miss messages. No more confusion about whether you're logged in or logged out. • QUICKLY CONNECT WITH YOUR CONTACTS: Your address book is used to quickly and easily connect you with your contacts who have WhatsApp so there's no need to add hard-to-remember usernames.• OFFLINE MESSAGES: Even if you miss your notifications or turn off your phone, WhatsApp will save your recent messages until the next time you use the app.• AND MUCH MORE: Share your location, exchange contacts, set custom wallpapers and notification sounds, email chat history, broadcast messages to multiple contacts at once, and more!*Data charges may apply. Contact your provider for details. --------------------------------------------------------- We're always excited to hear from you! If you have feedback, questions, or concerns, please email us at: iphone-support@whatsapp.com or follow us on twitter: http://twitter.com/WhatsApp@WhatsApp---------------------------------------------------------Note: WhatsApp is a telephony app, so iPod and iPad are not supported devices.",
    "In App Purchases": "No",
    "Name": "WhatsApp Messenger",
    "Number of Reviews (All Time)": "186663",
    "Number of Reviews (Current Versions) ": "1422",
    "Overall Rating": "4",
    "Rank": "23",
    "Rating of Current Version": "3",
    "Release": "Feb 28, 2017",
    "Seller": "WhatsApp Inc.",
    "Size": " 137 MB",
    "Version": "2.17.7"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Shopping",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Over 100 million people are getting trending items 50-80% cheaper than what you pay at the local mall. Get the hottest products at incredible prices delivered directly to your door. Wish is the #1 shopping mall in Europe and North America allowing you to browse a worldwide selection of trending fashion, accessories, and electronics directly at your fingertips.",
    "In App Purchases": "No",
    "Name": "Wish - Shopping Made Fun",
    "Number of Reviews (All Time)": "131750",
    "Number of Reviews (Current Versions) ": "335",
    "Overall Rating": "4.5",
    "Rank": "24",
    "Rating of Current Version": "4.5",
    "Release": "Mar 13, 2017",
    "Seller": "ContextLogic Inc.",
    "Size": " 49.9 MB",
    "Version": "3.18.2"
  },
  {
    "Age Restriction": "Rated 9+ ",
    "Category": "Books",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "HOOKED lets you read amazing chat stories FREE. These are gripping, edge-of-your seat thrillers that will keep you reading for hours. Or, write your own story and get lots of fans! Every HOOKED story is told as a bite-sized text message conversation, as if you were reading someone else's chat history.HOOKED also lets you create your own chat stories from your iPhone. Share stories from your life, funny texts or creepy crawly conversations from your worst nightmares. HOOKED is your very own chat diary, for the world to read!With Hooked's Fantasy Chat feature, you can even write stories WITH your friends! Choose a prompt, create your character, and invite your friends to play along with you. It's like improv on chat!We love reading, just like you, but we know it can get BORING when stories are too long. So we created this app to make reading snappy, spooky and fun.Drawing on the long tradition of epistolary literature, like Bram Stoker's Dracula, HOOKED stories unfold through back-and-forth conversations.If you can't get enough of books like Hunger Games, Divergent, The Fault In Our Stars and Harry Potter. Or if you're a fan of fanfic, like stories about One Direction. Or if you just can't put your Kindle down at night. You will love HOOKED. And even if you're not a big reader, but you love Snapchat, you should give HOOKED a try!New stories added daily!HOOKED UNLIMITED SUBSCRIPTION:- You can subscribe for unlimited access to our full story catalog and premium content- The subscriptions are $2.99 weekly, $7.99 monthly and $39.99 annually*- You'll be able to read unlimited stories for the duration of your subscription- Payment will be charged to your iTunes Account at confirmation of purchase- Subscription automatically renews unless auto-renew is turned off for at least 24-hours before the end of the current period- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase- No cancellation of the current subscription is allowed during active subscription period- You can read our privacy policy and terms of use at http://telepathic.tv/privacy.html- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication*Prices are equal to the value that \"Apple's App Store Matrix\" determines is the equivalent of the subscription price in $USD.By using Hooked, you agree to our Terms of Use and Community Guidelines available at http://www.telepathic.tv/terms-of-useQuestions? Email support@telepathic.tv for help!",
    "In App Purchases": "Yes",
    "Name": "HOOKED - Chat Stories",
    "Number of Reviews (All Time)": "29913",
    "Number of Reviews (Current Versions) ": "2065",
    "Overall Rating": "4.5",
    "Rank": "25",
    "Rating of Current Version": "4.5",
    "Release": "Mar 02, 2017",
    "Seller": "Information Not Available",
    "Size": " 84.9 MB",
    "Version": "2.22.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Travel",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Need a lift? Try Lyft for a friendly, affordable ride whenever you need one. Request a ride with the tap of a button, and get picked up by a nearby community driver who’ll take you to your destination within minutes. Yep, it's that easy.• Split the cost of a ride with friends. It’s easy, fast, and secure. • All Lyft drivers pass comprehensive background and DMV checks.• Drivers are rated by passengers and only the highest-rated drivers are allowed on the road.• Lyft provides a first-of-its-kind $1M liability insurance for total peace of mind.Join the millions who’ve taken 5-star rides. Download and take a ride today!—What people are saying:\"Ride-sharing programs like Lyft are providing commuters with less expensive and more social ways to get around. Users log into the app, specify where they’re heading, and a background-checked driver picks them up for less than a typical cab ride.\" - TODAY Show“Lyft is a real community — with both the drivers and riders being inherently social — making real friendships and saving money.” - Time\"In a city where taxis can be scarce and… black town cars are rampant but expensive, Lyft has quickly gained visibility due to low prices and quirky branding.\" - Ad Age\"Lyft's focus on the everyman has recently extended to the wildly successful Lyft Line carpool service aimed at commuters, which offers discounts of 30% to 60% for sharing a Lyft ride with others.\" - Fast Company—For Lyft drivers, continued use of GPS running in the background can dramatically decrease battery life.Prices vary based on market condition.",
    "In App Purchases": "No",
    "Name": "Lyft",
    "Number of Reviews (All Time)": "39321",
    "Number of Reviews (Current Versions) ": "209",
    "Overall Rating": "4.5",
    "Rank": "26",
    "Rating of Current Version": "4.5",
    "Release": "Mar 14, 2017",
    "Seller": "Information Not Available",
    "Size": " 146 MB",
    "Version": "4.22.3"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Music",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "SoundCloud is the world's largest music and audio streaming platform – 150 million tracks and growing. With a buzzing community of artists and musicians constantly uploading new music, SoundCloud is where you can find the next big artists alongside chart-topping albums, live sets, and mixes for every occasion.Our enormous catalog lets you discover amazing hip hop, electronic, rock, classical, jazz, podcasts, audiobooks, sports and much, much more.SoundCloud offers a family of products for all listeners and creators. Join our diverse community, connect with artists you love, and start discovering new music today.SOUNDCLOUD FREE:- Over 120 million tracks from emerging and established artists- Get suggested tracks based on your likes and listening habits- Discover incredible music in each genre with SoundCloud charts, from all-time greats to the newest and hottest tracks- Connect with friends and interact with your favorite artists directly- Create playlists for parties, workouts, on the way to work, or whatever mood you're inSOUNDCLOUD GO:- Discover, stream, and share a constantly expanding mix of music – anytime, anywhere- Over 120 million tracks from emerging and established artists- Take your collection offline, everywhere you go- No ads, for an uninterrupted listening experience- Support artists – a percentage of all revenue from SoundCloud Go is paid to creators on the platform- All for just $5.99/month*SOUNDCLOUD GO+:- Upgrade to Go+ for a fully expanded catalog of over 150 million tracks, including superstars from major labels and indies- Take your collection offline, everywhere you go- No more 30 second previews — all music on SoundCloud, including premium Go+ tracks, is fully accessible to stream and save offline- No ads- Support artists – a percentage of all revenue from SoundCloud Go+ is paid to creators on the platform- 30 days free, then $12.99/month**SOUNDCLOUD PULSE:Are you a creator? If you make music, podcasts or any type of audio and upload it to SoundCloud, this app provides an easy way to manage your account and keep your community humming:- Reply to comments on your tracks, on the go- Get up-to-date stats on the performance of your tracks- Share your uploaded sounds, both publicly and privately- Get it free on the App Store: https://itunes.apple.com/app/apple-store/id1074278256?mt=8 JOIN THE COMMUNITYSoundCloud Blog: http://blog.soundcloud.com Facebook: http://www.facebook.com/soundcloud Twitter: https://www.twitter.com/soundcloud Tumblr: http://soundcloud.tumblr.com Instagram: http://instagram.com/soundcloud G+: https://plus.google.com/+SoundCloud PROBLEMS? FEEDBACK?The more you tell us, the better SoundCloud gets.http://soundcloudcommunity.com http://help.soundcloud.com https://twitter.com/SCsupport *Get SoundCloud Go free for first 30 days, and $5.99/month after that. Free 30-day trial only available for users who haven't previously subscribed to SoundCloud Go. Trial must be canceled within 30 days of subscribing or will automatically renew for $5.99/month. Offer limited to users based in the US.**Get SoundCloud Go+ free for first 30 days, and $12.99/month after that. Free 30-day trial only available for users who haven't previously subscribed to SoundCloud Go or SoundCloud Go+. Trial must be canceled within 30 days of subscribing or will automatically renew for $12.99/month. Offer limited to users based in the US.Privacy Policy: https://soundcloud.com/pages/privacy Terms of Use: https://soundcloud.com/terms-of-use",
    "In App Purchases": "Yes",
    "Name": "SoundCloud - Music & Audio",
    "Number of Reviews (All Time)": "129670",
    "Number of Reviews (Current Versions) ": "2178",
    "Overall Rating": "4",
    "Rank": "27",
    "Rating of Current Version": "4.5",
    "Release": "Mar 01, 2017",
    "Seller": "SoundCloud Ltd",
    "Size": " 96.6 MB",
    "Version": "5.0.1"
  },
  {
    "Age Restriction": "You must be at least 17 years old to download this app.",
    "Category": "Utilities",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Browse fast on your iPhone and iPad with the Google Chrome browser you love on desktop. Pick up where you left off on your other devices, search by voice, and easily read webpages in any language.• SYNC ACROSS DEVICES - seamlessly access and open tabs and bookmarks from your laptop, phone or tablet• FASTER BROWSING - choose from search results that instantly appear as you type and quickly access previously visited pages• VOICE SEARCH - use the magic of Google voice search to find answers on-the-go without typing• TRANSLATE - easily read webpages in any language• UNLIMITED TABS - open as many tabs as your heart desires and quickly flip through them like a deck of cards• PRIVACY - use Incognito mode to browse without saving your history (learn more at http://goo.gl/WUx02)",
    "In App Purchases": "No",
    "Name": "Google Chrome – The Fast and Secure Web Browser",
    "Number of Reviews (All Time)": "54923",
    "Number of Reviews (Current Versions) ": "22",
    "Overall Rating": "3.5",
    "Rank": "28",
    "Rating of Current Version": "3.5",
    "Release": "Mar 14, 2017",
    "Seller": "Google, Inc.",
    "Size": " 94.3 MB",
    "Version": "57.0.2987.100"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "News",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "See what’s happening in the world right now. From breaking news and entertainment, sports and politics, to big events and everyday interests. If it’s happening anywhere, it’s happening on Twitter. Get the full story as it unfolds, with all the live commentary.Be part of what everyone is talking about and get videos, live footage and Moments, direct from the source.Join in on all the action by sharing what’s happening in your world. On Twitter you can post photos with stickers, GIFs, videos, and even stream live video with the Periscope button. There is no better way to have your voice heard.",
    "In App Purchases": "No",
    "Name": "Twitter",
    "Number of Reviews (All Time)": "350811",
    "Number of Reviews (Current Versions) ": "341",
    "Overall Rating": "3.5",
    "Rank": "29",
    "Rating of Current Version": "4",
    "Release": "Mar 09, 2017",
    "Seller": "Information Not Available",
    "Size": " 189 MB",
    "Version": "6.73.2"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Episode lets you LIVE your stories. One choice YOU make can change everything! The world’s largest home of visual stories where YOU choose your path. Or, become a creator and write your own! Wouldn’t it be amazing if YOU were a character in your favorite story? Episode lets you do just that, with over 35,000 gripping stories. In each, create your own character and make choices that matter. From your favorite movie titles like Mean Girls to fan faves such as Bad Boy’s Girl, Episode will keep you interacting for hours. If you love Snapchat or Netflix, give Episode a try!With all your favorite genres, there’s no time like the present to fall in love, rise to fame, or solve a decade-old mystery. Better yet, join this incredible community and become a creator of your own -- writing and publishing stories, amassing lots of fans along the way!Episode is LIT. Join our #episodesquad for #episodelife.FOLLOW US:instagram.com/episodefacebook.com/TheEpisodeAppIf you haven’t checked it out yet, start reading PRETTY LITTLE LIARS! - CREATE YOUR PERSONAL LOOK and choose your best outfits.- MAKE FRIENDS WITH THE LIARS and hang out with the coolest clique.- EXPERIENCE THE SUSPENSE and uncover the mysterious “A”.- DATE THE HOT GUY and decide your path to romance.OTHER FEATURED STORIES:MEAN GIRLS: SENIOR YEAR. Step inside girl world, right where the Mean Girls movie left off, and navigate the drama and romance of Senior Year at North Shore High. As you battle Regina George, you will get to know characters from the Mean Girls movie like Cady, Janis, Damian, and of course the Plastics. You will also meet the guy of your dreams, but Regina won't let you get him that easily. DEMI LOVATO: PATH TO FAME. Star in your very own tour! After winning a spot on Demi’s tour as her opening act, it’s time to embrace your true self and define your dream career. As Demi shares her advice on taking control of destiny, what choices will you make as you become a role model for aspiring stars?FALLING FOR THE DOLAN TWINS. On your first day in LA, you meet the cutest guy you've ever seen—and then you meet his twin brother. As you get closer and closer to internet stars Ethan and Grayson Dolan, the sparks start to fly... which one will you choose? HOLLYWOOD DAYS WITH HAYES, featuring internet sensation Hayes Grier. Your choices determine how you rise in the Hollywood ranks. As the lines blur between fantasy and reality, how will you manage? Let's see what you've got! You might even fall in love as your adventure unfolds…iMESSAGE STICKERS are here! OMG! Yaaaas! Do you Slay every day? Thought so. Are you a Pretty Little Liars fan? Here’s a secret. How about Mean Girls? Come sit with us. We’ve got your favorite characters, sayings, and slayings from Episode in a brand new 28 sticker pack, so you can tell your old stickers, “Boy, BYE.” Download directly from the App Store for iMessage or enable from Settings in Episode. PRETTY LITTLE LIARS and all related characters and elements © & ™ Warner Bros. Entertainment Inc. (s16)TM & ©2016 Paramount Pictures. All Rights Reserved.PLEASE NOTE: Episode lets you purchase items within the game for real money. Please disable in-app purchases on your device if you do not want this feature to be accessible. Your use of this application is governed by the Terms of Service available at http://pocketgems.com/episode-terms-of-service/. Collection and use of your data are subject to the Privacy Policy available at http://pocketgems.com/episode-privacy-policy/.",
    "In App Purchases": "Yes",
    "Name": "Episode - Choose Your Story",
    "Number of Reviews (All Time)": "141262",
    "Number of Reviews (Current Versions) ": "714",
    "Overall Rating": "4.5",
    "Rank": "30",
    "Rating of Current Version": "4.5",
    "Release": "Mar 14, 2017",
    "Seller": "Episode Interactive, LLC",
    "Size": " 178 MB",
    "Version": "5.80"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Create, edit, and collaborate with others on documents from your iPod, iPhone, or iPad with the free Google Docs app. With Google Docs you can:* Create new documents or edit any that were created on the web or on another device * Share documents and work together with others in the same document at the same time* Open, edit, and save Microsoft Word documents* Get stuff done anytime -- even without an internet connection* Add and respond to comments* Never worry about losing your work -- everything is automatically saved as you type * Protect your documents with a 4-digit passcode",
    "In App Purchases": "No",
    "Name": "Google Docs",
    "Number of Reviews (All Time)": "59805",
    "Number of Reviews (Current Versions) ": "576",
    "Overall Rating": "4.5",
    "Rank": "31",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Google, Inc.",
    "Size": " 194 MB",
    "Version": "1.2017.08204"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Shopping",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Buy. Sell. Simple. • The biggest mobile marketplace for local buyers and sellers.• List an item using your phone or tablet in as little as 30 seconds.• Know who you’re dealing with through reputation and safety features.• Browse local items with thousands of new postings daily.• Message buyers and sellers securely from within the app.• Build reputation with your unique seller profile page.• Browse items by image and sort by category or location.• Join millions of people using OfferUp across the country.OfferUp is the easiest way to buy and sell locally.\"I have found several items at a great price on OfferUp, saving me tons of money\"-Elaine\"We offered up 3 items in minutes and sold them within 48 hours. Doesn't get much easier than that!\"- Summer\"I made $1,000 by offering up my daughter's unused items on OfferUp\"- Claudia",
    "In App Purchases": "Yes",
    "Name": "OfferUp - Buy. Sell. Simple.",
    "Number of Reviews (All Time)": "50175",
    "Number of Reviews (Current Versions) ": "744",
    "Overall Rating": "4.5",
    "Rank": "32",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "OfferUp Inc.",
    "Size": " 69.3 MB",
    "Version": "2.10.9"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Discover Voodoo's new game: Paper.io.Your goal? To conquer as much territory as possible. It's initially very simple, and the game can be mastered immediately, but watch out: there's competition, and not everyone can win!Whether you're bold or more careful, you have to be more cunning than your adversaries by finding the best strategy to conquer the most space. But be careful! You have a weak spot: your tail. If an enemy touches it, that's the end for you.Try to stay ahead, because victory in Paper.io is never certain until you possess all the territory. Stealing is allowed, and your enemies won't hesitate to do so.After the success of Quiz Run, 1 Pic 8 Words, and Bool, Voodoo now offers you a new gaming and graphics experience inspired by io type games (made popular by agar.io). Enjoy the simplicity and strategy of an io game in a world with unique graphics.Paper.io is for the whole family and doesn't require an Internet connection.",
    "In App Purchases": "Yes",
    "Name": "Paper.io",
    "Number of Reviews (All Time)": "14191",
    "Number of Reviews (Current Versions) ": "2387",
    "Overall Rating": "3.5",
    "Rank": "33",
    "Rating of Current Version": "4",
    "Release": "Feb 24, 2017",
    "Seller": "Voodoo",
    "Size": " 267 MB",
    "Version": "2.5"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Shopping",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "letgo: Buy & Sell Second Hand StuffEasily make money selling what you don’t need and find great deals nearby on what you do. Electronics, games, clothes, automobiles, furniture, décor and much more. Featured by TechCrunch, Wired, New York Times, Wall Street Journal, USA Today, Apartment Therapy and others.letgo’s not just a different way to buy and sell, it’s the amazingly simple way. Tens of millions have already downloaded letgo. Here’s why:• FAST AND CUTTING-EDGE: Post an item for sale in just a few seconds. letgo’s the only app of its kind with cutting-edge image recognition and artificial intelligence to title and tag your items so you don’t have to.• EASY, SLEEK AND INTUITIVE: letgo shows you great deals nearby on a huge variety of items. Browse your area or search for something specific. Chat instantly with other buyers and sellers right in the app.• FUN: Only letgo lets you instantly create and share hilarious, custom, Hollywood-style ads for your items with the letgo Commercializer. That leather jacket you never wear anymore and the bike you haven’t ridden in years deserve their own eye-catching ads.• BIG AND GETTING BIGGER: Join the tens of millions already using letgo worldwide to post and buy hundreds of thousands of items every day.the letgo Team",
    "In App Purchases": "No",
    "Name": "letgo: Buy & Sell Second Hand Stuff",
    "Number of Reviews (All Time)": "31744",
    "Number of Reviews (Current Versions) ": "1469",
    "Overall Rating": "4.5",
    "Rank": "34",
    "Rating of Current Version": "4.5",
    "Release": "Mar 02, 2017",
    "Seller": "Ambatana INC",
    "Size": " 92.9 MB",
    "Version": "1.17.2"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Travel",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Yelp has over 100 million reviews of businesses worldwide and is available for iPhone, iPad, and Apple Watch.Whether you’re looking for a pizzeria that just opened or a coffee shop nearby, Yelp is your local guide to finding the perfect place to eat, shop, drink, relax and play.Yelp features:Find Restaurants• Find the newest and hottest restaurants in your area• Make reservations, pick up food and order for delivery, all from your phone• Filter restaurant search results by price, location and moreSearch for Nearby Businesses• Discover great local businesses• Read millions of reviews by the Yelp community• Find great deals offered by local businessesSearch Filters • Filter your search results by neighborhood, distance, rating, price and hours of operation• Look up addresses and phone numbers, call a business or make reservations directly from the appOther Features• Read expert user reviews and browse through beautiful photos of each business• Write and read reviews, check-in to local businesses, upload photos and add tips for other Yelp usersFind local restaurants, read expert customer reviews and start searching for businesses near you with Yelp.Need Help? Contact Yelp at https://www.yelp-support.com/?l=en_USNote: Continued use of GPS running can dramatically decrease battery life.",
    "In App Purchases": "No",
    "Name": "Yelp: The Best Local Food, Drinks, Services & More",
    "Number of Reviews (All Time)": "208339",
    "Number of Reviews (Current Versions) ": "2171",
    "Overall Rating": "3.5",
    "Rank": "35",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Information Not Available",
    "Size": " 167 MB",
    "Version": "11.10.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get started with Google Drive for free and have all your files within reach from any smartphone, tablet, or computer. All your files in Drive – like your videos, photos, and documents – are backed up safely so you can’t lose them. Easily invite others to view, edit, or leave comments on any of your files or folders.With Drive, you can:• View documents, PDFs, photos, videos, and more• Search for files by name and content• Easily share files and folders with others• Set sharing permissions to view, comment, or edit• Quickly access recent files• See file details and activity • Enable viewing of files offline",
    "In App Purchases": "Yes",
    "Name": "Google Drive - free online storage",
    "Number of Reviews (All Time)": "56355",
    "Number of Reviews (Current Versions) ": "607",
    "Overall Rating": "4.5",
    "Rank": "36",
    "Rating of Current Version": "4.5",
    "Release": "Mar 03, 2017",
    "Seller": "Google, Inc.",
    "Size": " 184 MB",
    "Version": "4.2017.05216"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Solitaire by Harpan is the #1 Solitaire card game app. Solitaire is a popular and classic single player card game also known as Klondike Solitaire and Patience.  With crisp, clear graphics, and a straight forward layout, this app is one you do not want to be without.Popular features of Solitaire· include:- Draw 1 card - Draw 3 cards- Single tap or drag and drop to move a card- Undo feature - Large or regular card font size- Auto finish a completed puzzle once all facedown cards are flipped over- Card animations can be set to slow, fast, or off- Sound that can be turned on/off- Unlimited free games- Personal stats- Turn on/off time, score, and moves- And so much more!Apple Watch Features:-Full Single Card Solitaire-Tap on a card to move it (Dragging cards is not supported on Apple Watch)-Undo-Push Game to iPhone-Supports Handoff-StatisticsSee what some of our many users have to say about this popular Solitaire· game:- Very nice app, simple to play.  Lots of fun for many hours.  Addictive, if you like solitaire- Captivating game. Lots of fun. Really enjoy the game- Easy to play and a lot of fun.  Recommended for everyone- Great fun and addictive- Terrific game - so enjoyable and easy to play- Once you start playing it is hard to stop- Best game and for free!  Play all the time- Fun can't stop playing!!- Best game out there!See for yourself why so many others love this game.",
    "In App Purchases": "No",
    "Name": "Solitaire·",
    "Number of Reviews (All Time)": "58784",
    "Number of Reviews (Current Versions) ": "54080",
    "Overall Rating": "4.5",
    "Rank": "37",
    "Rating of Current Version": "4.5",
    "Release": "Jul 08, 2015",
    "Seller": "Information Not Available",
    "Size": " 19.7 MB",
    "Version": "2.5"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Navigation",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Join 100 million Wazers who save time & money with Waze navigation by avoiding traffic jams, police, accidents and construction for free. Use the #1 real-time GPS today!Just by driving with Waze open, you're already contributing tons of real-time traffic information to your local community. You can also actively report accidents, police traps and other hazards you see on the road. Get road alerts along your route and find the cheapest gas prices around you shared by the community. Plus, you can add friends, send locations or keep others posted on your arrival time.- Live routing based on community driven, real-time traffic & road info- Community reported alerts including accidents, hazards, police traps, road closures, and more- Turn-by-turn voice guided navigation- Live maps, consistently edited and updated by Waze community map editors- Automatic rerouting as conditions change on the road - Send your ETA & real-time drive to update those you’re meeting- Learns your frequent destinations, commuting hours, and preferred routes- Find the cheapest gas station on your route - Add information on local places and businesses- Add Facebook friends and sync Contacts- See friends’ ETA when driving to the same destination- One tap navigation to Facebook & Calendar events- Earn points as you contribute road info and climb the ranks in your community Waze is all about contributing to and benefiting from the common good, so hop on board and get involved! Note: Continued use of GPS running in the background can dramatically decrease battery life. Waze will automatically shut down if you run it in the background and haven't driven for a while. Learn more about the Waze privacy policy, including what information is accessed and how it is used. With Waze, you have full control over your privacy settings. http://www.waze.com/legal/privacy/",
    "In App Purchases": "No",
    "Name": "Waze - GPS Navigation, Maps & Real-time Traffic",
    "Number of Reviews (All Time)": "329153",
    "Number of Reviews (Current Versions) ": "3161",
    "Overall Rating": "4.5",
    "Rank": "38",
    "Rating of Current Version": "4.5",
    "Release": "Mar 05, 2017",
    "Seller": "waze",
    "Size": " 88.7 MB",
    "Version": "4.20"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "One choice can change everything! Fall in love, solve crimes, or embark on epic fantasy adventures in immersive visual stories where YOU control what happens next! Current stories include:THE FRESHMAN, BOOK 1. Welcome to Hartfeld University! You'll make friends for life, and maybe even find true love. Will you date bookish James, party girl Kaitlyn, football hero Chris... or all three at once?- Dress to impress with fashion forward outfits.- Choose a date for the elegant and romantic Winter Formal.- Support new friends as you tackle freshman adventures together!THE CROWN & THE FLAME, BOOK 1. Your enemies stole your kingdom, but now the time has come for you to raise an army, master magic, and reclaim your crown!- Form alliances to build your army.- Master unique weapons.- Choose between elegant ball gowns and powerful armor.- Crush your enemies in an epic battle!MOST WANTED, BOOK 1. The heat is on when a no-nonsense Texas Marshal and a Hollywood detective are thrown together to stop a deranged hitman. Can you catch the killer?- Play as Detective Dave Reyes and U.S. Marshal Sam Massey.- Investigate a mystery with twists you won't see coming.- Examine evidence at crime scenes.- Stop the killer before he can claim another victim!...PLUS more new stories and chapters EACH WEEK!Choices is by the team that first created story games for mobile over a decade ago. Later we created Surviving High School and Cause of Death, the first games with episodes, for EA.Both games hit the Top 25 and were inspirations for other companies. After leaving EA, our team regrouped in a small office and with the quacking of nearby ducklings we set out to create story driven games with heart. As Pixelberry, we launched two hit games, High School Story and Hollywood U.Our team has now grown to over a dozen of the most experienced game writers in the industry. In our 10 years of creating story games together, we’ve seen heartbreak, marriages, great adventures, and even Pixelbabies.But even through diaper changes and late nights, we think we’ve created our best work to date. We hope you’ll fall in love with our newest characters, Chris, James, Kaitlyn, Dave, and Sam just as we have.Enjoy,- The Pixelberry Team",
    "In App Purchases": "Yes",
    "Name": "Choices: Stories You Play",
    "Number of Reviews (All Time)": "21684",
    "Number of Reviews (Current Versions) ": "6745",
    "Overall Rating": "4.5",
    "Rank": "39",
    "Rating of Current Version": "4.5",
    "Release": "Feb 01, 2017",
    "Seller": "Pixelberry Studios",
    "Size": " 99.6 MB",
    "Version": "1.7.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.2 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "○ \"A game so intelligent, I might call it sexy\" — HoldingOut4Updates○ “Unlike anything you’ve ever played before” —App Advice○ \"Constant how-did-they-do-that moments\" —Skottk○ \"Utterly diabolical and utterly brilliant\" —CNET○ “Undeniably unique” —Todays iPhone○ “Devilishly clever” —Six ColorsExplore 70 unique puzzles (with more coming) without touch… Tilt, shout, click, snap, wait, reflect, and hike your way to success; expand your creative thinking; ponder colorful visual clues; discover secrets along the way…-==============================-BEAUTIFULLY CLEVERWith ample satisfying \"ah hah!\" moments and puzzles as artful and clever as they are challenging, Blackbox is as delightful to play as it is to look at and hold.SATISFYINGLY SURPRISINGFrustrating, fun, and full of surprises… There’s more to Blackbox than meets the eye. Can you find all the meta challenges?HINTSEvery challenge has been tuned to be on the cusp of maddening but always solvable. Some challenges take time, perseverance, and perspective to understand, but if you’re really stumped rest assured there are hints. To enjoy the game to it’s fullest, only use them as a last resort!LEVEL PACKSBlackbox is jam-packed with 46 free challenges. Get far enough and you'll get the option to pay to unlock more advanced challenges and support the game's future development (and keep it ad free)!Good luck,~Ryan-==============================-More challenges are in the works!ADD ME ON INSTAGRAMinstagram.com/blackboxpuzzlesLET'S BE FACEBOOK FRIENDSfacebook.com/blackboxpuzzlesFOLLOW THE LATEST ON TWITTERtwitter.com/blackboxpuzzles",
    "In App Purchases": "Yes",
    "Name": "Blackbox - think outside the box",
    "Number of Reviews (All Time)": "43000",
    "Number of Reviews (Current Versions) ": "12654",
    "Overall Rating": "5",
    "Rank": "40",
    "Rating of Current Version": "5",
    "Release": "Feb 28, 2017",
    "Seller": "Ryan McLeod",
    "Size": " 66.5 MB",
    "Version": "1.3.8"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Social Networking",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Monkey is like omegle except for making new friends on Snapchat! When you're connected with a new person, you can add time to keep chatting. If the other person adds time too, the call goes on. You can also mutually add your new friends on Snapchat!",
    "In App Purchases": "No",
    "Name": "Monkey — have fun chats",
    "Number of Reviews (All Time)": "1380",
    "Number of Reviews (Current Versions) ": "314",
    "Overall Rating": "4.5",
    "Rank": "41",
    "Rating of Current Version": "4",
    "Release": "Feb 02, 2017",
    "Seller": "Monkey Squad, LLC.",
    "Size": " 55.1 MB",
    "Version": "1.4.1"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Entertainment",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Hulu brings you instant access to all of your favorite television shows, the hottest new series and the latest movies, all streaming in one place. Watch TV shows, current episodes, full seasons of all the hit series you want on demand. Watch movies, trailers, kids shows, cartoons, family films and more. Hulu gives you the latest episodes of popular dramas like Nashville, Bones, The Bachelor, PowerPuff Girls, The Path, Empire and past seasons of hit shows like Seinfeld, South Park, and Parks and Recreation.Hulu has an amazing library of family entertainment including shows in HD from channels like FOX, NBC, HBO, NBC, Disney, ABC, CBS, Comedy Central, Cartoon Network, PBS, FX, USA Network, A&E, MTV, Miramax & many more.Features:• Catch up on the latest HD episodes of current television shows from channels like ABC, FOX, HBO and CBS like Empire, Grey’s Anatomy, Once Upon A Time and Blindspot. Watch VOD premium original drama series like The Path, 11.22.63, The Mindy Project, Casual, East Los High, Difficult People and much more.• Enjoy previous seasons on demand of great comedy classic Seinfeld, gripping crime series drama with CSI: Crime Scene Investigation, Law & Order: SVU and comedy like South Park.• Stream popular kids films, cartoons and television programs including Curious George, Adventure Time and classics such as Doug and Rugrats. Watch great entertainment with kids shows streaming from Cartoon Network, Disney, Nickelodeon and other great kids TV networks.• Keep your family safe; let your children watch Disney cartoons and all the CN shows they want, but set Kids Lock so they are kept in the Kids hub.• Episodes of some of TVs current greatest shows on demand as well as HD streams (when available).• Choose the latest popular programs or catch up on great entertainment classics from channels like FOX, NBC, HBO, ABC, CBS, Comedy Central, Cartoon Network, PBS, FX. Watch Disney, USA Network, A&E, MTV, Miramax all on-demand.There are also great hit movies and new trailers streaming on Hulu – from family and kids movies to drama, crime and horror to cartoons to comedy – Interstellar, Spectre, The Hunger Games and many more. Enjoy full seasons on demand of hit current shows from channels such as ABC, FOX, HBO, NBC and CBS, great films and cartoons, many in HD and VOD. With Hulu you can start enjoying the world of streaming entertainment instantly.If you are new to Hulu, your base Hulu subscription fee will be charged $7.99/month for our Limited Commercials plan or $13.99/month for our No Commercials plan through your iTunes account as a recurring transaction starting at the end of your one week free trial (unless you cancel during the free trial). Payment will automatically renew unless you cancel your account or turn off auto-renew at least 24 hours before the end of the current subscription month. You can manage your subscription, cancel anytime, or turn off auto-renewal by accessing your iTunes account. Hulu is available to US customers only.Terms of Use: http://www.hulu.com/termsPrivacy Policy: http://www.hulu.com/privacyThis app features third party software, enabling third parties to calculate measurement statistics (e.g., Nielsen’s TV Ratings). To learn more, please visit our privacy policy.We may work with mobile advertising companies to help deliver online and in-app advertisements tailored to your interests based on your activities on our website and apps and on other, unaffiliated website and apps. To learn more, visit www.aboutads.info. To opt-out of online interest-based advertising, visit www.aboutads.info/choices. To opt-out of cross-app advertising, download the App Choices app at www.aboutads.info/appchoices. We are committed to complying with the DAA’s Self-Regulatory Principles for Online Behavioral Advertising and the DAA’s Application of Self-Regulatory Principles for the Mobile Environment.",
    "In App Purchases": "Yes",
    "Name": "Hulu: Watch TV Shows & Stream the Latest Movies",
    "Number of Reviews (All Time)": "55356",
    "Number of Reviews (Current Versions) ": "363",
    "Overall Rating": "2",
    "Rank": "42",
    "Rating of Current Version": "2.5",
    "Release": "Feb 14, 2017",
    "Seller": "Information Not Available",
    "Size": " 99.6 MB",
    "Version": "4.10.1"
  },
  {
    "Age Restriction": "You must be at least 17 years old to download this app.",
    "Category": "Utilities",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "The best of Google in one app. Say “Ok Google” and find everything from nearby restaurants to the calories in cheesecake. Google also shows you the info you need before you ask, like updates on your favorite teams and traffic alerts.Talk instead of type:• Say “Ok Google” then ask a question* • Google will speak the answer aloudAsk Google to help you do things:• “What are good restaurants nearby?”• “Where is my package?”Personalize your feed and get notifications:• Start your morning with weather, news & traffic• Get updates on sports, movies & eventsMore about the Google app: http://www.google.com/search/about* requires iPhone 4s or later",
    "In App Purchases": "No",
    "Name": "Google — Search made just for mobile",
    "Number of Reviews (All Time)": "478630",
    "Number of Reviews (Current Versions) ": "186",
    "Overall Rating": "3.5",
    "Rank": "43",
    "Rating of Current Version": "3.5",
    "Release": "Mar 06, 2017",
    "Seller": "Google, Inc.",
    "Size": " 180 MB",
    "Version": "23.1"
  },
  {
    "Age Restriction": "Rated 9+ ",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "“Love You to Bits” is a crazy cute, purely visual, puzzle-filled, point-and-click, sci-fi adventure spanning all around the universe.You will follow the journey of Kosmo, a clumsy, rookie space explorer in search of Nova, his robot girlfriend. After a fatal accident, all of Nova’s pieces get scattered in outer space!  So now Kosmo wants to retrieve all Nova’s bits, rebuild her, and get back together. Explore the strangest worlds and planets, full of fantastic aliens, space-time puzzles, and hidden objects to collect. As you complete levels, you will discover Kosmo and Nova’s heartbreaking love story!UniversalExplore enigmatic planets full of mind-boggling puzzles to be solved! Meet and outsmart dozens of bizarre creatures and aliens from all around the universe!BreathtakingExperience and rebuild a thrilling love story for all audiences: pure visual-storytelling with stylized visuals and a hair-raising soundtrack!CuteReconstruct the touching past of Kosmo and Nova by collecting dozens of their hidden love-tokens.EnduringComing soon, extra unique levels will be added to “Love You to Bits”! The adventure continues with no in-app purchases of any kind!**This game requires an iPad 2 (or newer), iPhone 4s (or newer), or iPod touch 5th Generation and iOS 8.0 (or newer).Developed by Alike Studio and Pati.io",
    "In App Purchases": "No",
    "Name": "Love You To Bits",
    "Number of Reviews (All Time)": "1505",
    "Number of Reviews (Current Versions) ": "1138",
    "Overall Rating": "5",
    "Rank": "44",
    "Rating of Current Version": "5",
    "Release": "Jul 13, 2016",
    "Seller": "Alike Studio S.L.",
    "Size": " 317 MB",
    "Version": "1.2.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Photo & Video",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Google Photos is a smarter home for all your photos and videos, made for the way you take photos today.“The best photo product on Earth” – The Verge“Google Photos is your new essential picture app” – Wired“Upload the pictures, and let Google Photos do the rest” – The New York Times• FREE UNLIMITED STORAGE: Back up unlimited photos and videos for free, up to 16 megapixels and 1080p HD. Access from any device and photos.google.com – your photos are safe, secure, and private to you.• FREE UP SPACE: Never worry about running out of space on your phone again. Photos that are safely backed up can be removed from your device’s storage in just a tap.• VISUAL SEARCH: Your photos are now searchable by the people, places and things in them – no tagging required.• BRING PHOTOS TO LIFE: Get automatically created movies, collages, GIFs, panoramas, and more from your photos. Or easily create them yourself.• ADVANCED EDITING: Transform photos with a tap. Use intuitive and powerful photo and video editing tools to apply content-aware filters, adjust lighting, and more.• MOTION STILLS: Advanced stabilization turns your Live Photos into beautiful looping videos or GIFs.• SMART AUTOMATIC ALBUMS: Automatically get new albums with just your best shots after an event or trip, then invite others to add their photos.• SEND PHOTOS IN SECONDS: Don’t waste data texting and emailing photos. Instantly share up to 1,500 photos with anyone.• REDISCOVER: It’s easier than ever to relive your memories. Get collages of photos you took a year ago on this day.• CAST: View your photos and videos on your TV with Chromecast support.Note: Face grouping is not available in all countries.Continued use of GPS running in the background can dramatically decrease battery life. Google Photos doesn't run GPS in the background unless you give us permission by turning on optional features that require this.For the latest updates from the team, follow us on Twitter at @googlephotos",
    "In App Purchases": "No",
    "Name": "Google Photos - free photo and video storage",
    "Number of Reviews (All Time)": "63839",
    "Number of Reviews (Current Versions) ": "2005",
    "Overall Rating": "5",
    "Rank": "45",
    "Rating of Current Version": "5",
    "Release": "Mar 08, 2017",
    "Seller": "Google, Inc.",
    "Size": " 158 MB",
    "Version": "2.11.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Six! is the latest title from Gram Games, makers of the global smash hits, 1010! and Merged!. This newest game is challenging, exciting, and even infuriating, at times. Like all great puzzles, Six! will keep you entertained for just a moment, or will keep you engaged for hours of fun.The game concept is simple: there is a tower of blocks of various shapes, upon which sits another hexagonal block. The aim of the game is to move the hexagon down the screen to earn points. To do this, you tap the different blocks, which will make them disappear. The hexagon can then fall into the empty space left behind.Sounds simple enough, right? Wrong. As the blocks are destroyed, the hexagon will start to wobble and roll, and the tower will begin to tilt. It is your job to keep the tower balanced, and the hexagon from gaining momentum and rolling of. To do so, remove blocks strategically, and ensure that their removal won’t throw everything off balance. If the hexagon tips into the abyss, it’s game over, and you’ll have to start over again.Challenging, exciting, and surprisingly simple to play, Six! will have you hooked immediately. Like Gram’s other hits, the gameplay is simple and fun, but earning a spot on the leaderboard and competing with friends provides both a challenge, and a reward.Key Features●    Easy to learn, and fun to master gameplay●    Challenge your friend’s high scores, challenge the world●    Fun, colorful and engaging graphics●    Exciting and addictive●    Fun four hours, or just a few minutes",
    "In App Purchases": "Yes",
    "Name": "Six!",
    "Number of Reviews (All Time)": "13314",
    "Number of Reviews (Current Versions) ": "51",
    "Overall Rating": "4.5",
    "Rank": "46",
    "Rating of Current Version": "4.5",
    "Release": "Mar 15, 2017",
    "Seller": "Gram Games Limited",
    "Size": " 113 MB",
    "Version": "2.1.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "“The best email app for the iPhone.” - The VergeMeet Outlook for iOS, the app that helps millions of users connect all their email accounts, calendars and files in one convenient spot. Newly redesigned, Outlook for iOS lets you do more from one powerful inbox.See what matters most first with the Focused inbox that keeps the important messages on top. Switch between your emails and calendar to schedule your next meeting or share your availability with just a few taps. Or grab a document from your Files list and attach it to an email seamlessly.With everything you need only a tap away, managing your busy days is now easier than ever. Outlook for iOS works with Microsoft Exchange, Office 365, Outlook.com (including Hotmail and MSN), Gmail, Yahoo Mail, and iCloud.--Here’s what you’ll love about Outlook for iOS: Seamless inbox management- A “Focused” inbox that displays your most important messages first. The more you use it, the smarter it gets. - Swipe gestures to quickly schedule, delete and archive messages. - Smart filters to help you sort through your inbox.Easy access to calendar and files- Share your meeting availability with just a tap and easily find times to meet with others.- View and attach any file from your email, OneDrive, Dropbox, and more, without having to download them to your phone.Work on the go- Open Word, Excel, or other Office document attachments to edit them directly in the corresponding app and attach them back to an email. - Set your Out of Office messages directly from your iPhone or iPad. - Multitask seamlessly on iPad with full Split View support in iOS 9.--Like Outlook?Try other great Microsoft apps for iOS: Word, Excel, PowerPoint, OneNote, OneDrive, Skype, and Wunderlist.",
    "In App Purchases": "No",
    "Name": "Microsoft Outlook - email and calendar",
    "Number of Reviews (All Time)": "30700",
    "Number of Reviews (Current Versions) ": "52",
    "Overall Rating": "3.5",
    "Rank": "47",
    "Rating of Current Version": "3",
    "Release": "Mar 14, 2017",
    "Seller": "Information Not Available",
    "Size": " 172 MB",
    "Version": "2.16.0"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Meet new cool zombie postapocalypse sequel for Dead Ahead!The hungry pixel-art walking dead are here for your blood and flesh! Keep calm and stay sharp! Drive your bus through the infested areas, collect supplies, look for survivors and kill zombies!ZOMBIE RUSHDefend your bus, don't let the hungry horde eat the living! Break through the barricades on your way! Gather your troops of survivors and send them into battle, use everything you can to stop the flesh-eating corpses - smash and burn the dead with barrels, molotov cocktails and grenades.USE YOUR BRAINS NOT TO LOSE THEMCombine different types of units and use both defensive and offensive tactics to win. Remember - your enemies will do the same.IMPROVE YOUR SKILLS AND GEAR TO STAY ALIVECollect items, earn experience and complete quests to upgrade your units and vehicles. WHAT AWAITS YOU:    * Blood-and-guts action-strategy game with a sense of humor :)* A huge world with numerous locations   * Plenty of survivor units and zombies* Upgrades, special items and optional quests* ....* FUN!\"",
    "In App Purchases": "Yes",
    "Name": "Dead Ahead: Zombie Warfare",
    "Number of Reviews (All Time)": "3301",
    "Number of Reviews (Current Versions) ": "86",
    "Overall Rating": "4.5",
    "Rank": "48",
    "Rating of Current Version": "4.5",
    "Release": "Mar 16, 2017",
    "Seller": "Mobirate Studio Ltd",
    "Size": " 138 MB",
    "Version": "1.4.2"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Entertainment",
    "Compatibility": "iOS 8.4 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Holiday Special! Graduate from Moron to Genius as you tap, twist, and shake your way through these fun and tricky challenges! Master the game, then laugh as your friends and family struggle with these seemingly simple puzzles!The Moron Test is one of the most popular mobile games ever with millions of players worldwide. Play now and experience why The Moron Test is an App Store favorite!The Moron Test - it's fun to FAIL!FEATURES:- Simple, addicting gameplay- Six sections featuring hundreds of fun puzzles- Funny characters, sound effects, and music- Global leaderboards and achievements- Beautiful Retina graphics- You will LOVE watching your friends FAIL!SECTIONS:- Old School- Late Registration- Winter Break- Food Fight- Skip Day- Tricky Treat",
    "In App Purchases": "Yes",
    "Name": "The Moron Test",
    "Number of Reviews (All Time)": "87789",
    "Number of Reviews (Current Versions) ": "549",
    "Overall Rating": "4",
    "Rank": "49",
    "Rating of Current Version": "4.5",
    "Release": "Dec 20, 2016",
    "Seller": "DistinctDev, Inc.",
    "Size": " 45.7 MB",
    "Version": "6.2.8"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 6.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Building roads is hard, driving is hard - that’s why we call it Hardway.Endless road building with a brand new mechanics. Build from left or right. Connect islands using roads and bridges in a fast arcade style. Track your favourite car and drive through unique worlds. Be aware of different obstacles including moving islands, lighthouses and monsters.3D Touch lets you slow down and score higher!Game features:- brand new gameplay = brand new fun- build roads & connect islands as fast as you can- challenging obstacles - towers, cranes, moving islands and more- 8 different worlds and bonus stages (including special soundtracks)- 30+ cars to unlock- lovely stamps for car challenges- free gifts & daily rewards, funny prize machine included- full iCloud synchronisation- iOS 10 Stickers included!- 3D Touch support - score higher by slowing down! Simply press stronger.- compare your score with friends (Game Center & Social integration)",
    "In App Purchases": "Yes",
    "Name": "Hardway - Endless Road Builder",
    "Number of Reviews (All Time)": "40",
    "Number of Reviews (Current Versions) ": "12",
    "Overall Rating": "3.5",
    "Rank": "50",
    "Rating of Current Version": "4",
    "Release": "Mar 15, 2017",
    "Seller": "DIGITAL MELODY GAMES KITAJEWSKI I STALEWSKI SPOLKA JAWNA",
    "Size": " 232 MB",
    "Version": "1.0.2"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Finance",
    "Compatibility": "iOS 8.1 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "DescriptionTAP INTO YOUR MONEYSend money or pay online to almost anywhere in the world in just seconds. Manage all the ways you send, receive, and spend money at a glance – download the PayPal payment app today.SEND MONEY IN SECONDSTransfer money to PayPal account holders in over 100 countries using just their email address or mobile number. When the money arrives in their account (usually in seconds), they can spend the money online or withdraw it with just a tap. And it’s completely free when you send money to friends in the US from your bank account or PayPal balance.GET PAID WITH EASESend a request for money that allows people to pay you back with just a tap. Whether you’re collecting money for a group gift or something you sold online, PayPal mobile app makes it easy for them and even easier for you. STAY ON TOP OF IT ALLWhenever you send, receive, and spend money with PayPal, the app sends an instant notification to help you keep track of it all. Whether you use PayPal Credit, your balance, your bank, or your debit and credit cards to pay with PayPal - you can find everything and anything you need to simply manage it all in this secure payment app.",
    "In App Purchases": "No",
    "Name": "PayPal - Send and request money safely",
    "Number of Reviews (All Time)": "114031",
    "Number of Reviews (Current Versions) ": "167",
    "Overall Rating": "4",
    "Rank": "51",
    "Rating of Current Version": "4.5",
    "Release": "Mar 14, 2017",
    "Seller": "PayPal, Inc.",
    "Size": " 216 MB",
    "Version": "6.10.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "A New Kind of Mario game you can play with one hand.Mario constantly runs forward, while you time your taps to pull off stylish jumps and moves to gather coins and reach the goal!Super Mario Run can be downloaded for free and after you purchase the game, you will be able to play all the modes with no additional payment required. You can try out all the modes before purchase; “World Tour” the mode where you clear courses, “Toad Rally” where you compete with friends and players around the world, and “Kingdom Builder” where you can create your own kingdom.*Internet connectivity required to play. Data charges may apply.■World TourRun and jump with style to rescue Princess Peach from Bowser’s clutches! Travel through plains, caverns, Ghost Houses, airships, castles, and more …To reach Bowser’s Castle, clear 6 worlds filled with 24 brand-new courses designed for game play on the iPhone and iPad. There are many ways to enjoy the new courses, such as collecting the 3 different types of colored coins per level or by competing for the highest score against your friends.You can try course 1-1 to 1-3 for free, and after purchase, you gain access to play all 24 courses. ■Toad RallyShow off Mario’s stylish moves, compete against your friends and challenge people from all over the world.A challenge mode where the competition differs each time you play.Compete against the stylish moves of other players for the highest score as you gather coins and get cheered on by a crowd of Toads. Fill the gauge with stylish moves to enter “Coin Rush Mode” to get more coins. If you win the rally, the cheering Toads will come live in your kingdom. Rally tickets are necessary to play “Toad Rally”. You can get rally tickets in \"World Tour\" as well as in \"Kingdom Builder\" from bonus games and ? Block.■Kingdom BuilderGather coins and Toads to build your very own kingdom.Create your unique kingdom by using coins to acquire buildings and decorations that you acquire with the help of Toads gathered in “Toad Rally”. There are over 100 kinds of items in the Kingdom Builder mode. There are even buildings that add playable characters in World Tour and Toad Rally.■Additional Information＊We permit our third-party partners to collect data from this app for analytical purposes.",
    "In App Purchases": "Yes",
    "Name": "Super Mario Run",
    "Number of Reviews (All Time)": "83729",
    "Number of Reviews (Current Versions) ": "993",
    "Overall Rating": "2.5",
    "Rank": "52",
    "Rating of Current Version": "3",
    "Release": "Feb 21, 2017",
    "Seller": "Nintendo Co., Ltd.",
    "Size": " 207 MB",
    "Version": "1.1.2"
  },
  {
    "Age Restriction": "Rated 9+ ",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Presented by Kiloo Games and Sybo Games.DASH as fast as you can!DODGE the oncoming trains!Help Jake, Tricky & Fresh escape from the grumpy Inspector and his dog.- Grind trains with your cool crew!- Colorful and vivid HD graphics!- Hoverboard Surfing!- Paint powered jetpack!- Lightning fast swipe acrobatics!- Challenge and help your friends!Join the App Store's most daring chase!A Universal App with HD optimized graphics for retina resolution.Subway Surfers is compatible with iPhone 4, iPod 5, iPad 2 or newer.iOS 7 or later OS version is required.",
    "In App Purchases": "Yes",
    "Name": "Subway Surfers",
    "Number of Reviews (All Time)": "699179",
    "Number of Reviews (Current Versions) ": "934",
    "Overall Rating": "4.5",
    "Rank": "53",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Kiloo",
    "Size": " 139 MB",
    "Version": "1.68.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Finance",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Venmo is the simple and fun way to send and receive money between friends. Whether you’re splitting a dinner bill, concert tickets, or the cost of a road trip, Venmo removes the awkward talks over who owes what.Just send or request your payment with a message or emoji combo of your choice, then comment on and like all your favorite splitting moments.“#1 app college students should download right now” – BuzzFeedA few more quotes that make us blush:“One of the 50 Best Apps of the Year” – Time“The crown jewel of all finance apps” – Forbes“Revolutionized the mobile payment space” – Vanity Fair\"Just Venmo me” has become synonymous with \"pay me back\" or \"I got it.\" - Business InsiderThe Venmo magic:• Transfer money easily and quickly using a friend's name, @username, phone or email.• Find friends automatically by syncing your Facebook or phone contacts.• Stay in control of what you owe, what friends owe you and what you’ve bought.• Make purchases in select apps using Venmo, so you can split and share your finds with friends more easily.• Venmo uses data encryption to protect your financial information. That means we keep your actual card or bank information private by not sharing it when you send money or make purchases.Venmo is a service of PayPal, Inc., a licensed provider of money transfer services. All money transmission is provided by PayPal, Inc. pursuant to PayPal, Inc.'s licenses. Visit https://venmo.com/legal/us-licenses/ for additional information. © 2017 PayPal.",
    "In App Purchases": "No",
    "Name": "Venmo",
    "Number of Reviews (All Time)": "15459",
    "Number of Reviews (Current Versions) ": "660",
    "Overall Rating": "4.5",
    "Rank": "54",
    "Rating of Current Version": "4",
    "Release": "Feb 13, 2017",
    "Seller": "The Delancey Corporation, LLC",
    "Size": " 66.6 MB",
    "Version": "6.25.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 6.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "A challenging and interesting game where traps and barriers make you addicted.Rolling Sky is a game that pushes the boundaries of your speed and reaction. The splendid 3D effect scene enables you to experience the imaginary traps and barriers. Now, let's control the ball and conquer the world by overcoming challenges.How to play?Drag the ball left or right and avoid all obstacles. Do not deviate from track! Come on! Relentless pursuit of super speed. You can be faster along with the music rhythm!Features:• One-touch control & simple operation• Stunning 3D stereo visual• Rich scenes: massif, cosmos, forest, snowfield, inferno• A challenge to speed and reflexFollow and contact us:It’s pleasant to receive your valuable suggestions. We invite you join us in game improvement and upgrade. Contact us!rollingskyfeedback@conew.comPrivacy Policy ：http://www.cmcm.com/protocol/site/privacy.html",
    "In App Purchases": "Yes",
    "Name": "Rolling Sky",
    "Number of Reviews (All Time)": "28103",
    "Number of Reviews (Current Versions) ": "311",
    "Overall Rating": "4.5",
    "Rank": "55",
    "Rating of Current Version": "4.5",
    "Release": "Mar 10, 2017",
    "Seller": "cheetah technology corporation limited",
    "Size": " 136 MB",
    "Version": "1.4.4"
  },
  {
    "Age Restriction": "Rated 9+ ",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Enter the Arena! From the creators of Clash of Clans comes a real-time multiplayer game starring the Royales, your favorite Clash characters and much, much more.Collect and upgrade dozens of cards featuring the Clash of Clans troops, spells and defenses you know and love, as well as the Royales: Princes, Knights, Baby Dragons and more. Knock the enemy King and Princesses from their towers to defeat your opponents and win Trophies, Crowns and glory in the Arena. Form a Clan to share cards and build your very own battle community. Lead the Clash Royale Family to victory!PLEASE NOTE! Clash Royale is free to download and play, however, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings. Also, under our Terms of Service and Privacy Policy, you must be at least 13 years of age to play or download Clash Royale. A network connection is also required. FEATURES● Duel players from around the world in real-time and take their Trophies● Earn chests to unlock rewards, collect powerful new cards and upgrade existing ones● Destroy opponent’s towers and win Crowns to earn epic Crown chests● Build and upgrade your card collection with the Clash Royale Family along with dozens of your favorite Clash troops, spells and defenses● Construct your ultimate Battle Deck to defeat your opponents● Progress through multiple Arenas all the way to the top● Form a Clan to share cards and build your very own battle community● Challenge your Clanmates and friends to a private duel● Learn different battle tactics by watching the best duels on TV RoyaleSupportAre you having problems? Visit http://supercell.helpshift.com/a/clash-royale/ or http://supr.cl/ClashRoyaleForum or contact us in game by going to Settings > Help and Support.Privacy Policy: http://supercell.com/en/privacy-policy/Terms of Service:http://supercell.com/en/terms-of-service/Parent’s Guide:http://supercell.com/en/parents/",
    "In App Purchases": "Yes",
    "Name": "Clash Royale",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "247150",
    "Overall Rating": "Information Not Available",
    "Rank": "56",
    "Rating of Current Version": "4.5",
    "Release": "Mar 16, 2017",
    "Seller": "Supercell Oy",
    "Size": " 114 MB",
    "Version": "1.8.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Create fun, one-of-a-kind layouts by remixing your own photos and sharing them with your friends. Choose photos from your camera roll—or use the built-in Photo Booth to take spur-of-the-moment shots—and instantly see them laid out in various combinations. Pick the layout you like best, then edit it to make it your own.Layout's smooth, intuitive process gives you complete creative control. Tap to mirror, flip or replace images, hold and drag to swap them, pinch to zoom in or out, or pull the handles to resize. You're the editor, so get creative—tell a story, show off an outfit or just splice, dice and change the look of your regular photos to convey a mood or theme. FEATURES* Re-mix up to 9 of your photos at a time to create fun, personalized layouts.* Use the Faces tab to quickly find photos with people in them.  * Capture the moment in Photo Booth mode with quick, spontaneous shots.  * Save your layouts to your camera roll and share them seamlessly to Instagram or other networks.* Easily see the last 30 photos you've selected in the Recents tab. * Pair your layouts with Instagram's filters and creative tools afterwards to make them stand out even more. * Download and start creating immediately. No signup or account required—and no clutter breaking up your flow.",
    "In App Purchases": "No",
    "Name": "Layout from Instagram",
    "Number of Reviews (All Time)": "11856",
    "Number of Reviews (Current Versions) ": "1596",
    "Overall Rating": "4.5",
    "Rank": "57",
    "Rating of Current Version": "4.5",
    "Release": "Dec 05, 2016",
    "Seller": "Instagram, Inc.",
    "Size": " 9.4 MB",
    "Version": "1.2.4"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "musical.ly is the world’s largest creative platform. The platform makes it super easy for everyone to make awesome videos and share with friends or to the world. Top categories on musical.ly include:musiccomedytalent (sing, dance, magic, etc.) fashion & beautyvloganimals* Any feedback? Contact us at support@musical.ly or tweet us @musicallyapp* Requires iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch. Optimised for iPhone 6, iPhone 6s, iPhone 7 and latest models. Performance of this app on iPhone 5c or earlier iOS device is not fine-tuned.",
    "In App Purchases": "Yes",
    "Name": "musical.ly - your video social network",
    "Number of Reviews (All Time)": "99791",
    "Number of Reviews (Current Versions) ": "234",
    "Overall Rating": "4.5",
    "Rank": "58",
    "Rating of Current Version": "4",
    "Release": "Mar 14, 2017",
    "Seller": "musical.ly inc.",
    "Size": " 231 MB",
    "Version": "5.4.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Social Networking",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Skype keeps the world talking. Free messaging, voice and video calls with anyone for free.- Talk face to face with a video call.- New group video calls with up to 25 people.- Free voice calls to anyone else on Skype. Add up to 25 people on a group call.- Message your friends in an instant and add up to 300 people to a group chat.- Call mobiles and landlines at low rates (Skype to Skype calls are always free). - Share photos, video messages, your location and add emoticons and Mojis to your chat.- Skype’s available on smartphones, tablets, PCs, Macs, and even some TVs. Now it’s even easier to stay connected to friends and family – no matter the device they’re on.- Available for Apple Watch – your notifications and chats available on your wrist.System requirements:- iOS 8.0 or above (If you are using iOS 7 or earlier, you can download the last compatible version by tapping install/update and following the prompt to download.) The Apple Watch features require iOS 8.2 and of course, an Apple Watch.",
    "In App Purchases": "Yes",
    "Name": "Skype for iPhone",
    "Number of Reviews (All Time)": "372684",
    "Number of Reviews (Current Versions) ": "295",
    "Overall Rating": "3.5",
    "Rank": "59",
    "Rating of Current Version": "4",
    "Release": "Feb 28, 2017",
    "Seller": "Information Not Available",
    "Size": " 133 MB",
    "Version": "6.34.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Here comes new BRAIN TEASERS from the maker of Block!, Pipe Lines : Hexa & Words Crush: Hidden Word!.Roll The Ball: slide puzzle is a simple addictive unblock puzzle game, keep you playing it!Do you like the game genres as below? Great! Roll the Ball has all the elements. ;)• Sliding Puzzles, Just move and move!• Puzzle Games, Thought-provoking fun.• Brain Teasers, Test yourself. Exercise your brain.• Escape Games, Can you get out? Let's go.• Hidden Object Games, Find the hidden path.• Physics Puzzler, Physics-based gaming.• Match-3 Puzzle, Easy to learn but hard to master.• Retro Games, Revisit the classics• Rule the Rotation, Spinning games.• Exam Prep & Tutoring, Practice makes perfect. Train you brain to active mind.• Family Puzzle Games, Enjoy the game with you family.Move the blocks with your finger to create a path for moving the ball to the red GOAL block. But riveted blocks can't be moved. Are you ready to play? Download and start solving puzzles now!FEATURES• SLIDING PUZZLE: An essential is for the adult to kids of all ages.• TONS OF EPIC LEVELS: You can enjoy the game enough.• NO TIME LIMIT: Play at your own pace.• NO WIFI? NO PROBLEM! Games you can play offline.• MORE VARIATIONS: Moving, Rotation mode to challenge & Star mode to relax.• USEFUL IN-GAME FUNCTIONS:-- RESTART: Just restart a level quickly.-- UNDO : Have a mistake? Don't worry, just put it back.-- HINTS : It's a good friend. Of course, it may be wrong.• GET 7 DAILY BONUS & GIFTS: The Santa may give gifts to you. Check a message box often.• ANNOYING ADS? NO PROBLEM! Buy AD FREE(USD 1.99) or Participate in ads improvement program by in-game Email.• OPTIMIZED to App Store-- Support both iPhones, iPads & iPod Touches-- Support both 32 & 64 bit DEVICES.-- LEADERBOARDS & ACHIEVEMENTS from Game Center.NOTES• Roll the Ball contains the ads like banner, interstitial, video and house ads.• Roll the Ball sells In-app products like AD FREE, Hints and level packages.E-MAIL• contact@bitmango.comHOMEPAGE• http://www.bitmango.comLike us on FACEBOOK• https://www.facebook.com/BitMangoGamesLet's ROLL THE BALL. Let's CRUSH THE PUZZLE. lol",
    "In App Purchases": "Yes",
    "Name": "Roll the Ball™ - slide puzzle",
    "Number of Reviews (All Time)": "15790",
    "Number of Reviews (Current Versions) ": "3296",
    "Overall Rating": "4.5",
    "Rank": "60",
    "Rating of Current Version": "4.5",
    "Release": "Feb 10, 2017",
    "Seller": "BitMango Corporation",
    "Size": " 183 MB",
    "Version": "1.6.5"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Shopping",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Download Groupon and start saving on everything you’ve been looking for! Find great deals on all the best stuff to eat, see and do near you in hundreds of locations around the world.Whether you’re craving to try a new restaurant downtown, in need of a relaxing massage, looking for a new gym, shopping for the latest fashion trends or daydreaming about a hotel for a tropical getaway, Groupon has you covered with all the unique local experiences and discounts you could ever wish for!Get ready to start your New Year shopping for popular fashion, electronics, beauty products, toys and other awesome products with our local deals! With Groupon, you can:Get Access to Incredible Deals Near You • Save up to 70% on 1,000s of local deals.• Browse outstanding discounts and coupons for your favorite hair or beauty salon, pizza place, yoga studio and more.• Discover the hottest spots in your city including top-rated restaurants, spas and gyms.• Buy and redeem Groupon deals directly from your mobile device.Save Big on Products• Shop Groupon Goods for discounts on delicious food, designer brands, electronics, everyday essentials and fun finds delivered right to your door.Travel for Cheap• Collect the fanciest hotel shampoos and travel to exotic destinations with Groupon Getaways.• Always find something fun to do on your next trip by turning on your location settings.Keep Things Simple• Track your vouchers by location and expiration date.• Save ink and avoid traumatic paper cuts by never printing another coupon or voucher again.• Instantly redeem vouchers for local deals without the hassle of clipping coupons.• Use Apple Pay to buy deals with a single touch.As a Local Marketplace, Groupon provides you with realtime recommendations for great deals near you. Groupon takes steps to limit usage of GPS to preserve battery life. That said, as with any functionality of this type, continued use of GPS running in the background can dramatically decrease battery life. Put down the coupon book and download Groupon to begin exploring the best that your city has to offer, with savings of up to 70%.Share Groupon deals with friends, family and fiscally responsible robots on your social media accounts.Got any problems? Tell us all about it at https://www.groupon.com/customer_support",
    "In App Purchases": "No",
    "Name": "Groupon - Deals, Coupons & Discount Shopping App",
    "Number of Reviews (All Time)": "413473",
    "Number of Reviews (Current Versions) ": "36",
    "Overall Rating": "4.5",
    "Rank": "61",
    "Rating of Current Version": "4.5",
    "Release": "Mar 15, 2017",
    "Seller": "Groupon, Inc.",
    "Size": " 147 MB",
    "Version": "17.4"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Over 125,000,000 downloads worldwide!Play now the #1 addictive game of the year!Tap the ball carefully through each obstacle and your ball will switch color with some powerups.You must follow the color pattern on each obstacle to cross it ! Be careful not to pass through the wrong color, or you’ll have to start again.",
    "In App Purchases": "Yes",
    "Name": "Color Switch",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "136912",
    "Overall Rating": "Information Not Available",
    "Rank": "62",
    "Rating of Current Version": "4.5",
    "Release": "Mar 16, 2017",
    "Seller": "Fortafy Games DMCC",
    "Size": " 69.1 MB",
    "Version": "6.80"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Mobile Strike is an exciting new action game of modern war that lets you build a base, control the action, and train elite troops to fight against enemies on the battlefield!Unlock cutting-edge assault vehicles, command powerful armies, and put your tactical mind to test against opponents across the globe in this worldwide MMO game!- Join millions of players from around the world- Build & customize an elite military base for defensive strength or offensive might- Use tanks, helicopters, and modern military units to blitz your enemies- Claim the title of Head of State to grant protections to your allies, and obstacles to your enemies!- Upgrade buildings & walls to defend your perimeter - Train, level up, and supply your Commander with superior firepower- Command 16 types of troops with 4 lethal tiers- Clash with rival alliances & rule the world in the #1 modern war themed MMOExperience the rush of battle and conquest in the vast multiplayer world of Mobile Strike.Join forces with powerful players to create global alliances and conquer enemy territories in the immersive world of Mobile Strike!Privacy Policy: http://epicwar-online.com/privacypolicy.htmlTerms of Service: http://epicwar-online.com/termsofservice.htmlGame Page: http://epicwar-online.com",
    "In App Purchases": "Yes",
    "Name": "Mobile Strike",
    "Number of Reviews (All Time)": "21537",
    "Number of Reviews (Current Versions) ": "704",
    "Overall Rating": "3.5",
    "Rank": "63",
    "Rating of Current Version": "4",
    "Release": "Mar 09, 2017",
    "Seller": "Epic War LLC",
    "Size": " 272 MB",
    "Version": "3.21.505"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Finance",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get your free credit scores, reports and more on Credit Karma. Checking your own credit won’t affect your score, and we’ll never ask for your credit card info. Apple ® named it one of 2016's 10 Best Apps of the Year, and it now has a bright new look! Free, Helpful Features for Your Credit:• Free credit monitoring – We’ll send you alerts about important changes on your TransUnion credit report.• Direct Dispute™ – If you notice an error on your TransUnion report, you can submit a dispute without leaving Credit Karma.• Free education, tips and tools – We’ll help you understand your scores and reports so you can make informed financial decisions.• Personalized recommendations – Use our Approval Odds to find credit cards and loans you’re more likely to be approved for. Join more than 60 million members on the path to financial progress. Learn more and sign up at creditkarma.com.",
    "In App Purchases": "No",
    "Name": "Credit Karma: Free Credit Scores, Reports & Alerts",
    "Number of Reviews (All Time)": "97150",
    "Number of Reviews (Current Versions) ": "1224",
    "Overall Rating": "5",
    "Rank": "64",
    "Rating of Current Version": "5",
    "Release": "Feb 28, 2017",
    "Seller": "Credit Karma, Inc.",
    "Size": " 71.1 MB",
    "Version": "4.7.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Pianotiles2™ is a popular game that has 600 million players around the world.Here comes surprise new version! Watch videos to unlock Kiss the rain and River flows in you! Newly added music chart, get songs' ranking at a galnce; Everyday quest system lauched, free diamonds and coins are waiting for you!In 2016, we have added pop music and new instruments. Slider tiles and Competition of Masters are also presented. The interface is more simple with more fonction such as favorites which simplifies the research of music. This is a better version of Piano Tiles 2 with more splendid music, better gaming experience and more excited hand speed competition. Come and try!Game features: • Bonus! Watch video to unlock Kiss the rain and River flows in you• Added music chart. Wanna know the ranking of the songs you played?• Launched everyday quest system, hard work pays off!• Finish your achievements to get more diamonds and coins. • Brand new slider tile gamplay brings you more exciting gaming experiences.• Master's challenge kicks off! Reach the peak experience of speed challenge.• There are more albums and songs of various styles. • You can add songs to your favorite, play both classical and pop music to enrich your playing experience. • New interface and new song lists make it easier to choose songs.• Compete with friends and global players• Log in with Facebook and share data on multiple devices• Enjoy a brand-new level of sound qualityGame rules: Tap on the black tiles while listening to music. Avoid the white ones! Hurry now! Enjoy classical and pop music, challenge your friends, improve your tapping speed!. Compete with your friends and speed up your fingers! Support: Are you having problems? Send email to gpfeedbackpt2@gmail.com or contact us in game by going to Settings > FAQ and Support.For users of iPhone 6s, 6s Plus, 7 and 7 Plus, if your system is above iOS 10, you may have lags and your touches may not be identified. We will resolve the problem asap. Once it occurs, you can try to turn off the 3D Touch in auxiliary of phone settings. Thank you for your support!Business Cooperation: Cheetah Mobile is now sincerely inviting all the amazing mobile game developers globally to achieve mutual success! we are looking forward to the great games! Contact us on: publishing_cmplay@cmcm.com Privacy policy:http://www.cmcm.com/protocol/site/privacy.html",
    "In App Purchases": "Yes",
    "Name": "Piano Tiles 2™(Don't Tap The White Tile 2)",
    "Number of Reviews (All Time)": "50551",
    "Number of Reviews (Current Versions) ": "69",
    "Overall Rating": "4.5",
    "Rank": "65",
    "Rating of Current Version": "4.5",
    "Release": "Mar 15, 2017",
    "Seller": "cheetah technology corporation limited",
    "Size": " 79.3 MB",
    "Version": "3.1.5"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Dropbox is the place for your photos, docs, videos, and other files. Files you keep in Dropbox are safely backed up and you can get to them from all your devices. It’s easy to send large files to anyone, even if they don’t have a Dropbox account.Features:\t•\tAccess your files on any device, even if you’re offline\t•\tCreate and edit Microsoft Office files from your iPhone or iPad\t•\tShare links to your largest files without using email attachmentsWe offer in-app purchases for Dropbox Pro, which includes 1 TB of storage and additional features. The amount will be charged to your iTunes account and will vary by plan and country. You’ll see the total price before completing payment.Dropbox Pro subscriptions purchased in-app renew monthly or yearly depending on your plan. Plans are priced at $9.99USD monthly and $99.99USD yearly (pricing may vary in countries other than the U.S.). To avoid renewal, you must turn off auto-renew at least 24 hours before your subscription ends. You can turn off auto-renew at any time from your iTunes account settings. Dropbox also offers one-month trials for monthly subscriptions.Terms of Service: https://www.dropbox.com/pricing_termsPrivacy Policy: https://www.dropbox.com/privacy",
    "In App Purchases": "Yes",
    "Name": "Dropbox",
    "Number of Reviews (All Time)": "49356",
    "Number of Reviews (Current Versions) ": "53",
    "Overall Rating": "3.5",
    "Rank": "66",
    "Rating of Current Version": "3",
    "Release": "Mar 08, 2017",
    "Seller": "Dropbox, Inc.",
    "Size": " 156 MB",
    "Version": "38.3"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Music",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get unlimited music and thousands of radio stations all in one app. Download iHeartRadio today and listen to top radio stations, music, news, podcasts, sports, talk and comedy shows. iHeartRadio is easy to use and best of all it’s FREE. Get The Best Local Radio Stations and Podcasts• Discover thousands of live AM and FM stations near you and from cities across the globe • Listen to sports radio stations like ESPN Radio, Fox Sports and more• Stream podcasts from famous personalities like Ryan Seacrest, Colin Cowherd, Sean Hannity, Elvis Duran and Bobby BonesPlay Free Artist StationsCreate personalized music stations based on today’s top artists using a library of millions of songs covering genres like Country, Top 40, Rap, EDM, Rock, Alternative and more.The Ultimate Station Made Just for YouMy Favorites Radio collects all of the songs you love in one free personalized station. Premium FeaturesTake control of your listening experience with millions of songs on demand. Choose the plan that’s right for you with iHeartRadio Plus™ and iHeartRadio All Access™.•\tSave and replay any song from the radio•\tEnjoy unlimited skips•\tListen offline•\tCreate unlimited playlistsJoin our community!• Facebook: http://on.fb.me/1F1TcFX• Instagram: http://bit.ly/1e1AOUS• Twitter: http://bit.ly/1HZk5KQ• Blog: http://bit.ly/1GiT59DFor Feedback and HelpTell us how we can improve by sharing your thoughts at http://help.iheartradio.com!For additional help and to find answers to common questions for iPhone and iPad devices, please visit https://help.iheart.com/hc/en-us/sections/204008308-iPhone-iPadPlease note: This app features Nielsen’s proprietary measurement software which may allow you to contribute to market research, like Nielsen's TV Ratings. To learn more about our digital measurement products and your choices in regard to them, please visit http://www.nielsen.com/digitalprivacy for more information.",
    "In App Purchases": "Yes",
    "Name": "iHeartRadio – Free Music & Radio Stations",
    "Number of Reviews (All Time)": "289270",
    "Number of Reviews (Current Versions) ": "131",
    "Overall Rating": "3.5",
    "Rank": "67",
    "Rating of Current Version": "4.5",
    "Release": "Mar 13, 2017",
    "Seller": "Information Not Available",
    "Size": " 119 MB",
    "Version": "7.2.1"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Social Networking",
    "Compatibility": "iOS 8.1 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get connected. Kik is way more than just messaging. It’s the easiest way to connect with your friends, stay in the loop, and explore – all through chat. No phone numbers, just pick a username.• Choose who to chat with one-on-one and in groups• Share pics, videos, gifs, games, and more• Meet new friends with similar interestsGet on Kik now. Start chatting!",
    "In App Purchases": "No",
    "Name": "Kik",
    "Number of Reviews (All Time)": "259543",
    "Number of Reviews (Current Versions) ": "47",
    "Overall Rating": "4",
    "Rank": "68",
    "Rating of Current Version": "4",
    "Release": "Mar 15, 2017",
    "Seller": "Kik Interactive Inc.",
    "Size": " 160 MB",
    "Version": "11.11.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 9.3 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "With its beautiful design, easy-to-use interface, and lightning fast speed, the Yahoo Mail app makes reading, organizing, and sending emails across your inboxes (Gmail, Outlook, AOL and more) easier than ever. Yahoo Mail offers 1000GB of free cloud storage, so you never have to delete a message again. With the Yahoo Mail app you can:- SEND MULTIPLE ATTACHMENTS - Easily add photos, videos, and documents to an email, all at once. - QUICKLY SEARCH - Search across all of your messages, contacts, files and photos, faster than ever. - SWITCH BETWEEN ACCOUNTS - Add your Gmail, Outlook, or second Yahoo account right in the app. - NEVER LOSE AN EMAIL - Keep all of your emails with 1000GB of free cloud space. - QUICKLY DELETE MULTIPLE EMAILS – Press and hold an email to select and delete multiple messages.- CHOOSE A THEME - Select different backgrounds and text colors for your Yahoo inbox.- DITCH PASSWORDS - Enable Account Key for secure password-free sign in.- SAY IT WITH A GIF - Can’t find the right words? Send an animated GIF.- SEND STATIONERY - Send emails with artist-designed stationery from Paperless Post. - CONNECT GOOGLE DRIVE AND DROPBOX - Easily access and send photos and documents you’ve stored in the cloud. - BE IN THE KNOW - Get news from Yahoo and the Yahoo Magazines right in the app.Notes: - To see all the new features, upgrade your device to iOS10. - Optimized for use with VoiceOver. - Yahoo does not provide a local Swiss email service.",
    "In App Purchases": "No",
    "Name": "Yahoo Mail - Keeps You Organized!",
    "Number of Reviews (All Time)": "106974",
    "Number of Reviews (Current Versions) ": "1097",
    "Overall Rating": "4",
    "Rank": "69",
    "Rating of Current Version": "4.5",
    "Release": "Mar 09, 2017",
    "Seller": "Yahoo! Inc.",
    "Size": " 231 MB",
    "Version": "4.14"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Hotspot Shield VPN is the World’s most trusted security, privacy and access app. -\tAccess all websites and apps securely and privately from anywhere in the World.-\tStay private and anonymous online, preventing anyone from tracking your online activities.-\tGet protected from hackers and snoopers on public WiFi connections.Hotspot Shield Free VPN Proxy for iOS:- No Logs Kept: Hotspot Shield doesn’t track or keep any logs of its users and their activities. You are completely private with Hotspot Shield.- FREE and UNLIMITED: You have the choice to use basic features for free (forever) and unlimited, or simply upgrade to Elite for more features!- Trusted by millions: Trusted by more than 400 million global users and featured by Fortune, Forbes, TechCrunch, New York Times and many more renowned media.- No sign up, no registration, no credit cards: To use the basic features of the app, you don’t need to create an account or have a credit card!- Unparalleled VPN Performance: Hotspot Shield fully own all VPN servers and the proprietary servers ensure fastest VPN speed, and most stable & secured connections.- Largest VPN Coverage: Powered by AnchorFree, Hotspot Shield offers largest VPN coverage from 17 countries including US, UK, JP, IN, AU, CA, CN, TR, UA and more!- Support: We are striving to be the best security, privacy and access app for you, so we are always open to feedbacks and suggestions. Any questions, simply shoot an email to support@hsselite.com!Get Hotspot Shield Free VPN Proxy Now! And if you love us, don’t forget to spread the love by giving us 5-stars!-------------------------------------------■ Why Hotspot Shield VPN?Hotspot Shield VPN is the most trusted security, privacy and access platform with top performance on speed, stability and security.  Hotspot Shield enables users’ online activities, sites visited, searches and personally identifiable information to always stay private and secured. Get complete protection from cybercriminals - Hotspot Shield’s banking-level encryption hides your IP address from snoopers- Access all websites and apps securely and privately at home, school, work or anywhere on the go.- Get complete protection from cybercriminals- Enjoy complete anonymity - hide your IP address, identity, and location from websites and online trackers.- Protect yourself from hackers and snoopers from stealing your usernames, passwords, credit card information on public WiFi networks.■ Hotspot Shield Premium (Elite)- 7-day free trial - free of charge; no commitment; cancel anytime- Payment will be charged to iTunes Account at confirmation of purchase- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the period- Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal- Monthly as low as 11.99 dollars- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase- No cancellation of the current subscription is allowed during active subscription perio- Yearly as low as 29.99 dollars- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication.■ ABOUT AnchorFree™AnchorFree is a privately held, venture-backed company based in the Silicon Valley. Anchorfree believes in placing consumers in control of their personal information online. Anchorfree provides millions of users with online security, privacy and access through its most popular VPN product - Hotspot Shield. ■ Follow us on…Google+: plus.google.com/+HotspotShieldFacebook: facebook.com/hotspotshieldWebsite: https://www.hotspotshield.com/Lean About VPN Technology: https://goo.gl/tgL10zPrivacy: https://www.hotspotshield.com/privacy/Terms: https://www.hotspotshield.com/terms/Copyright © 2016 AnchorFree, Inc. All Rights Reserved",
    "In App Purchases": "Yes",
    "Name": "Hotspot Shield Free Privacy & Security VPN Proxy",
    "Number of Reviews (All Time)": "28225",
    "Number of Reviews (Current Versions) ": "1371",
    "Overall Rating": "4.5",
    "Rank": "70",
    "Rating of Current Version": "4.5",
    "Release": "Feb 28, 2017",
    "Seller": "AnchorFree Inc.",
    "Size": " 69.6 MB",
    "Version": "3.7.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "The world’s best multiplayer Basketball game on mobile, from the creators of multiple smash-hit online sports games!Dribble, shoot, score, WIN! Grab the ball and take on the world with BASKETBALL STARS.Play fast-paced, authentic 1v1 multiplayer basketball! Show your skills, moves and fakes to juke out your opponent and shoot for the basket! On defense, stay in the face of the attacker, steal the ball, and time your leaps to block their shots! All in REAL-TIME!REALISTIC 3D GRAPHICSBasketball on mobile has never looked this good: fully customisable 3D players and a variety of environments to play in!COMPETE 1-ON-1 IN TWO AWESOME MULTIPLAYER GAME MODESTest your duelling instincts in 1v1 Attacker-Defender battles, or rush to shoot hoops in a time-based 1v1 Shooting Race.INCREDIBLE REWARDS AND HUNDREDS OF UNIQUE ITEMSPlaying like an all-star? Enter higher-ranked matches with bigger stakes, and unlock special basketballs and unique wearables to grow your power and style.LEVEL UPStart out on the Underdog court and play your way up to the top. Gain access to more  exclusive courts and compete with the best Basketball Stars players out there!KEY FEATURESTrue 1-on-1 basketball gameplayRealistic 3D graphics2 different online multiplayer game modesEasy to pick-up, challenging to master400+ customisation items = thousands of unique looks!40+ unlockable basketballsDribble, feint, shoot, steal, block and get powerful bonuses off the backboardFree to play!-- Download Basketball Stars by Miniclip NOW! --Requirement: iPhone 4S or newer, iPod Touch 5th gen, iPad 2 or newerThis game needs an internet connection to playDon’t miss out on the latest news:Like Miniclip: http://facebook.com/miniclipFollow us on Twitter: http://twitter.com/miniclip------------------------------------Find out more about Miniclip: http://www.miniclip.comTERMS AND CONDITIONS: http://www.miniclip.com/terms-and-conditionsPRIVACY POLICY: http://www.miniclip.com/privacy",
    "In App Purchases": "Yes",
    "Name": "Basketball Stars™",
    "Number of Reviews (All Time)": "23305",
    "Number of Reviews (Current Versions) ": "1002",
    "Overall Rating": "4",
    "Rank": "71",
    "Rating of Current Version": "4.5",
    "Release": "Mar 06, 2017",
    "Seller": "Miniclip SA",
    "Size": " 142 MB",
    "Version": "1.7.0"
  },
  {
    "Age Restriction": "You must be at least 17 years old to download this app.",
    "Category": "Lifestyle",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "The world’s hottest app – Forbes.10 billion matches later, Tinder has changed the way people meet around the world. It’s so much more than a dating app. Tinder is a powerful tool to meet people, expand your social group, meet locals when you’re traveling and find people you otherwise never would have met. Making new connections on Tinder is easy and fun—just Swipe Right to Like someone, or Swipe Left to pass. If someone likes you back, It’s a Match! Chat online with your matches, step away from your phone, get out and experience something new in the real world. It’s that simple!•\tTinder Social—It’s all about going out with friends and meeting new people. Invite your friends to  go out, then swipe and match with other groups who want to meet up. Start the party with group chat, make plans and get out tonight! •\tWhen you see an individual or group you really want to connect with, tap the blue star or Swipe Up to send a Super Like•\tUpgrade to Tinder Plus for premium features, including: Passport to connect with people anywhere around the world, Rewind to give someone a second chance, one free Boost per week to be the top profile in your area for 30 minutes, and additional Super Likes to stand out from the crowd-----------------------------------If you choose to purchase Tinder Plus, payment will be charged to your iTunes account, and your account will be charged for renewal within 24-hours prior to the end of the current period. Auto-renewal may be turned off at any time by going to your settings in the iTunes Store after purchase. Current Tinder Plus subscription price starts at $9.99 USD/month. Prices are in U.S. dollars, may vary in countries other than the U.S. and are subject to change without notice. No cancellation of the current subscription is allowed during the active subscription period. If you don’t choose to purchase Tinder Plus, you can simply continue using Tinder for free.Privacy https://www.gotinder.com/privacyTerms https://www.gotinder.com/terms",
    "In App Purchases": "Yes",
    "Name": "Tinder",
    "Number of Reviews (All Time)": "138214",
    "Number of Reviews (Current Versions) ": "80",
    "Overall Rating": "3.5",
    "Rank": "72",
    "Rating of Current Version": "4.5",
    "Release": "Mar 16, 2017",
    "Seller": "Tinder Inc.",
    "Size": " 128 MB",
    "Version": "7.1.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Food & Drink",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Get the food you want, from the restaurants you love, delivered at Uber speed.Food you want: We’re working with over a hundred restaurants in your city to put great local food all in one place. If you’re craving it, you can find it on UberEATS.Speed you need: It’s Uber fast from app tap to table. Through the Uber network, you can get anything from our roster of local restaurants, within minutes.Service you love: When you’re ready to place your order, you’ll see a total that includes the food and delivery price. There’s no need to tip. Pay with your Uber account and watch your order come right to you through the app. UberEATS is currently available in Amsterdam, Bangkok, Bogota, Brussels, Capetown, Dubai, Johannesburg, Hong Kong, London, Sao Paulo, Singapore, Stockholm, Taipei, Tokyo, Madrid, Milan, Vienna, and multiple cities in the US, Australia, Canada, France, and Mexico.",
    "In App Purchases": "No",
    "Name": "UberEATS: Uber for Food Delivery",
    "Number of Reviews (All Time)": "12942",
    "Number of Reviews (Current Versions) ": "117",
    "Overall Rating": "4",
    "Rank": "73",
    "Rating of Current Version": "4",
    "Release": "Mar 14, 2017",
    "Seller": "Uber Technologies, Inc.",
    "Size": " 69.0 MB",
    "Version": "1.75.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Finance",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Pay your friends instantly, and cash out to your bank for FREE! Standard deposits show up the very next business day. You can even spend directly from the app with a built-in Visa virtual card number.SAFE TO USEProtect payments with Touch ID or a passcodeINSTANT DEPOSITSOptionally cash out to your bank in seconds for a 1% feeGET STARTED FASTJust link your Visa, MasterCard, or Discover debit card to transfer money",
    "In App Purchases": "No",
    "Name": "Square Cash - Send Money for Free",
    "Number of Reviews (All Time)": "21567",
    "Number of Reviews (Current Versions) ": "270",
    "Overall Rating": "4.5",
    "Rank": "74",
    "Rating of Current Version": "4.5",
    "Release": "Mar 06, 2017",
    "Seller": "Information Not Available",
    "Size": " 78.7 MB",
    "Version": "2.14.4"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Weather",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "The Weather Channel App for iPhone is your best option for accurate forecasts and timely local weather alerts. Make confident decisions this fall, whether you are planning for the day, the entire week or the next 15 days! KNOW THE WEATHER ANYWHERE, RIGHT NOW• Forecasts: Hourly, daily, weekly, weekend and 15-day forecasts.• Dynamic Home Screen: Changes based on your current location, weather, and time of day, so you get your current conditions plus the weather info you need most.• Detailed Current Conditions: Get “feels like” temperature, humidity, wind speed, and more.• Weather Maps: Fast-loading radar maps show past and future doppler radar. • Severe Weather Alerts: Stay safe with real-time National Weather Service notifications of severe weather including severe weather warnings about lightning, hail, flooding and severe storms. PLAN YOUR OUTDOOR ACTIVITIES WITH CONFIDENCE• Need weather information to help plan for road trips, picnics, camping or hiking? – this app lets you track and read detailed weather information in multiple locations around the world.• Dress, pack and plan appropriately – know the rain and wind forecasts, tides, sunrise and sunset times, phases of the moon and even pollen counts!• Ski season is upon us!  Our Ski forecast shows nearby ski resort conditions including snow forecasts, number of open trails, snow base depth and more.• GoRun Forecast: Like to run? Now you can create a personalized GoRun Forecast to help you answer questions like “When should I run?” “What should I wear?” “How far should I go?” Scroll to the Outdoors module in our app to try it out, and let us know what you think at  iphonesupport@weather.com.FREE DETAILED WEATHER PROGRAMMING & FEATURES 24/7• Watch our morning show “The Lift”: a 6-minute weather show that airs first on your app. Join Domenica Davis as she covers breaking weather, cool science, and amazing nature clips first thing in the morning. Available on your home screen weekdays from 6-11 a.m. Great for people on the go!• Weather News: From severe storms to straight-up bizarre weather occurrences, we’ll keep you up to date.• Stunning Imagery: Amazing background photos match your current weather conditions.• Sponsors allow us to bring you The Weather Channel app for freeAD-FREE VERSIONFor those of you who want an ad-free version of our weather app, it is here! Our iOS app includes a $3.99 in-app purchase to remove all ads for 1 year. Simply go to the Settings menu in the app to complete the purchase.WEATHER ALERT APPLE WATCH INTEGRATION• Get precise weather updates, rain and lightning alerts and more of your favorite features right from your Apple Watch.• Watch Glances: To activate The Weather Channel Glance, open the Apple Watch App on your iPhone, go to the \"Glances\" section, click \"edit,\" and add \"The Weather.\"To activate the new The Weather Channel watch face complication, press firmly on the watch face that displays the time and tap \"customize.\" Then browse to the complication showing an umbrella icon.THE WEATHER CHANNEL ON THE WEB AND SOCIAL MEDIAForgot your phone? Access many of the top app features on the web, wherever you go: find us at weather.com, like us on facebook.com/theweatherchannel, and follow us on Twitter @weatherchannel.PRIVACYWe respect your privacy! Please check out our Privacy Policy, which can be found here: https://weather.com/en-US/twc/privacy-policy and our Terms of Use, which can be found here:http://www.weather.com/common/home/legal.htmlFEEDBACKWe love feedback! If you love our weather app, please rate and review us in the App Store. If you have questions or suggestions, please email us at iphonesupport@weather.com with any suggestions or questions.",
    "In App Purchases": "Yes",
    "Name": "The Weather Channel: Alerts, Forecast & Radar",
    "Number of Reviews (All Time)": "484069",
    "Number of Reviews (Current Versions) ": "2763",
    "Overall Rating": "3.5",
    "Rank": "75",
    "Rating of Current Version": "4.5",
    "Release": "Mar 01, 2017",
    "Seller": "Information Not Available",
    "Size": " 186 MB",
    "Version": "8.8"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "The Sharks are back in the bigger and badder sequel to Hungry Shark Evolution!Control a shark in a feeding frenzy and eat your way through many oceans feasting on everything from bite-size fish and birds to tasty whales and unwitting humans!Number 1 app on iPhone and iPad in over 100 countries.THIS GAME IS ONLY COMPATIBLE WITH iPhone 5 or later, iPad Mini 2 or later, iPad 3 or later, iPad Air or later and iPod 6th generation or later.MORE THAN 20 SHARK SPECIESChoose from a range of sharks in 7 different size tiers, including the most iconic ocean predator: the Great White!HUGE OPEN WORLDSExplore the lush Pacific Islands, frozen Arctic Ocean, exotic Arabian Sea, and now the South China Sea, a vibrant urban destination full of fresh, unwary victims!FEAST FOR YOUR EYESExperience the feeding frenzy in stunning console quality 3D graphics that will blow everything else out of the water!SURVIVAL OF THE HUNGRIESTIt’s eat or be eaten in waters packed with 100s of delicious and dangerous creatures… Whales, submarines and wandering locals BEWARE!SMASHING SHARK SWAGLevel up your shark and equip jawsome gadgets to bite harder, swim faster and grow even hungrier! No shark is complete without headphones, umbrella and a freakin' jetpack!MANIC MISSIONS & BADASS BOSSESTake on more than 20 different types of mission including high score challenges, prey hunts and epic boss fights!HELPFUL PREDATORY PETSBaby sharks, whales, an octopus, and even a bald eagle are happy to help with special abilities to increase health, score and more!SUPERSIZED MEAL DEALUnleash your shark's predator potential: SuperSize mode, rushes, explosion, hypnosis and more! INTUITIVE TILT CONTROLSBack by popular demand, now you can control your shark simply by tilting your phone!Game centre, 3D touch and Apple Replay Kit enabled.Use Facebook to synchronise your progress across your IOS devices.Hungry Shark World is regularly updated with new features, content and challenges to keep you coming back for more!This app contains In-App Purchases which allow you to buy Gems and Gold currency which can be spent on upgrades and accessories. Gems and Gold can also be collected in game without requiring purchases.This game contains advertising. Advertising is disabled if you make any purchase.Like the game on Facebook for the latest news: www.facebook.com/HungrySharkWorldFollow us on Twitter @Hungry_SharkOr Youtube: http://youtube.com/FutureGamesOfLondonAnd join our community!Facebook http://facebook.com/UbisoftMobileGamesTwitter http://twitter.com/ubisoftmobileYoutube http://youtube.com/user/UbisoftAny Feedback? Contact: http://support.ubi.comNeed support? Contact: http://support.ubi.com",
    "In App Purchases": "Yes",
    "Name": "Hungry Shark World",
    "Number of Reviews (All Time)": "21312",
    "Number of Reviews (Current Versions) ": "1124",
    "Overall Rating": "4.5",
    "Rank": "76",
    "Rating of Current Version": "4.5",
    "Release": "Feb 24, 2017",
    "Seller": "Ubisoft",
    "Size": " 901 MB",
    "Version": "1.9"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Health & Fitness",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Lose weight with MyFitnessPal, the fastest and easiest-to-use calorie counter for iOS. With the largest food database by far (over 5,000,000 foods) and amazingly fast and easy food and exercise entry, we'll help you take those extra pounds off! And it's FREE! There is no better diet app - period. • Consumer Reports #1 rated diet• PC Magazine Editor’s Choice Selection• #1 Health and Fitness app for 4 years straightAlso featured in the NY Times, Wall Street Journal, Wired, USA Today, Family Circle, Marie Claire, NBC, CNET, Shape, the Today Show and more.USER REVIEWS• “The first diet tool that has ever worked for me! I’ve lost 30 pounds!”• “This is the best calorie counter, free or paid, and I’ve tried them all.”• “The food database is HUGE! I’ve NEVER had a missing food.”• “This app takes seconds to use, it’s that simple.”WHY WE’RE BETTER THAN OTHER APPS• FREE – sign up with no strings attached• Track your diet and exercise in less than 5 minutes a day! It's that fast and easy• Largest food database of any iPhone calorie counter – over 5,000,000 foods and growing daily• Easiest and fastest food entry – remembers your favorites, add multiple foods at once, save and add entire meals, and more. THERE IS NO FASTER OR EASIER APP THAN MYFITNESSPAL.• Connect with over 50 devices and apps including Apple Health, Fitbit, Jawbone UP, Garmin, MapMyFitness, Runkeeper, Strava, Runtastic, Misfit, Withings, and more! • Recipe importer - cook a lot? Our recipe importer lets you visit any recipe on the web and easily import and track it with just a tap! It feels like magic!• Built-in step tracker - iPhone 5S/6/6+ users can track steps right from their phone, no separate tracker required• MYFITNESSPAL WORKS – our members have lost almost 200 MILLION POUNDS combined! EASIEST APP TO TRACK DIET & EXERCISE• 5,000,000+ food database of global items and cuisines. Virtually every food you eat is in our database already• Barcode scanner - track a food just by scanning it's barcode. Over 4 million barcodes recognized!• Step tracker - iPhone 5S and iPhone 6/6+ users can track steps and overall calorie burn right from their phone. No separate tracker required!• Track all major nutrients: calories, fat, protein, carbs, sugar, fiber, cholesterol, and moreCONNECT APPS & DEVICES• Easily connects and seamless integrates with over 50 apps and devices including Apple Health, Fitbit, Jawbone UP, Garmin, MapMyFitness, Runkeeper, Strava, Runtastic, Misfit, Withings, and more! Works with virtually every fitness app and device.GET SUPPORT • Connect with friends and easily track and motivate each other, or meet new friends from the MyFitnessPal community!GOALS & REPORTS• Received personalized goals based on your individual diet profile, or enter your own goals if you’ve gotten specific recommendations from a doctor, nutritionist, etc.• Gain insights into where your calories and nutrients are coming from and how to make healthier choices• View charts of your progress over time for motivationWhy wait? It is free to sign up so you have nothing to lose except those extra pounds! Download us and start leading a healthier life today!SUBSCRIPTION PRICING & TERMSMyFitnessPal is free to download and use. Should you choose to upgrade to MyFitnessPal Premium, we offer two auto-renewing subscription options:$9.99/month$49.99/yearPayment will be charged to your credit card through your iTunes account at confirmation of purchase. Subscription renews automatically unless cancelled at least 24 hours prior to the end of the subscription period. There is no increase in price when renewing.Subscriptions can be managed and auto-renewal turned off in Account Settings in iTunes after purchase. Once purchased, refunds will not be provided for any unused portion of the term.Read our full Terms of Service and our Privacy Policy at http://www.myfitnesspal.com/account/terms_and_privacy.",
    "In App Purchases": "Yes",
    "Name": "Calorie Counter & Diet Tracker by MyFitnessPal",
    "Number of Reviews (All Time)": "502608",
    "Number of Reviews (Current Versions) ": "517",
    "Overall Rating": "4.5",
    "Rank": "77",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Information Not Available",
    "Size": " 137 MB",
    "Version": "7.10"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Photo & Video",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "With more than 300 million installs, PicsArt is the #1 all-in-one picture editor, pic collage maker, camera, meme maker, clipart and drawing tool. Plus… It’s a network for making and sharing awesome pictures with friends.Millions use PicsArt because it offers hundreds of filters for pictures, collage layouts and powerful photo editing tools like picture blending, picture cropping, adding text and more. Discover thousands of free clipart packs, fonts, stickers, emojis, collage templates - integrated into a powerful photo editor, and it's free! PicsArt’s photo editor, collage maker, clipart and drawing tools are the best way to transform your photos into works of art and to express your creativity with the world.Step up your photo editing game with PicsArt, make awesome pictures and collages and join the movement to go WAY beyond the filter!* 1000s of amazing photo editing features that are fun and easy to use* Remix images with friends. It’s cool.* New magic AI-powered Magic Effects turn photos into art* Make any #FreeToEdit image your own. Do it, we dare you. \u2028\u2028* Photo grid, free form collage, and collage layouts* Free and premium photo stickers and collage packs* Add text with multiple fonts and text effects* Brand new AI and Prisma style effects* Freely share to PicsArt, Instagram, Facebook, WhatsApp and more!Apply various clipart and stickers to your images and memes:* Trending this month: Get your freak on with Mardi Gras clipart and go green with St Patrick’s Day stickers* 1000s of free clipart bundles, fonts to add text on photos, stickers, collage backgrounds and emojis * Throw some beads around and put Mardi Gras masks on your selfies* Use our leprechaun clipart to get in the mood this St. Paddy’s DayDo cool things like:* Make Mardi Gras collages with your party pics and put them in fun frames!* Get your pot of gold with Saint Patrick’s Day clipart and paint your pics green!* Make memes and have fun - using text and stickers* Create a double exposure - turn two photos into a unique work of art* Mix an awesome collage - arrange a selection of cool images and tell a story* Draw - illustrate pictures, apply effects and share with friendsSo. Much. Inspo. * See how others get creative with photo and editing challenges.* Discover pictures you love and learn to make them. * Check out new tutorials every week. We got you!* Read our blog (https://picsart.com/blog) for all the latest news* Follow our Instagram (https://www.instagram.com/picsart/) for daily visual inspiration",
    "In App Purchases": "Yes",
    "Name": "PicsArt Photo Studio: Picture Editor Collage Maker",
    "Number of Reviews (All Time)": "28261",
    "Number of Reviews (Current Versions) ": "201",
    "Overall Rating": "4.5",
    "Rank": "78",
    "Rating of Current Version": "4.5",
    "Release": "Mar 05, 2017",
    "Seller": "PicsArt, Inc.",
    "Size": " 141 MB",
    "Version": "8.8"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Lifestyle",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "You’re not just looking for a house. You’re looking for a place for your life to happen™. Zillow’s top-rated real estate app opens the door to millions of homes for sale and rent across the U.S., including real estate listings you won’t find anywhere else. Compare industry-exclusive Zestimate® home values for more than 100 million homes nationwide. Using our app’s real estate search options, you can view photos and videos of listed homes near top-rated schools, find apartments near the city center or discover your dream vacation home with a view. The Zillow app helps you stay on top of your local real estate market with up-to-date listings and instant notifications about new homes in your search area, price changes and more.Zillow also has tools to help you determine your budget and find and contact a local real estate agent or property manager. We also make the home buying process easier with tools to connect you with trusted lenders for mortgage pre-approval and custom mortgage quotes.The Zillow real estate app has everything you need to find your way home while on the go.Key features:• Browse U.S. homes for sale and for rent, including more than 1 million listings you won’t find on an MLS.• See the Zestimate® of nearly any home in the U.S. and see Rent Zestimates® (estimated monthly rental prices) on most homes and apartments.• Receive instant notifications when new listings hit the market, drop in price or are sold. • Find a local lender in minutes who can pre-approve you for a mortgage. Getting pre-approved can show sellers that you’re a serious and credible buyer.• Access mortgage calculators, real-time mortgage rates and personalized loan quotes.• Looking for a home with family or friends? Try Zillow for iMessage to easily share homes you’ve recently viewed or saved, get immediate feedback and make plans to visit. To enable the feature, tap the app store logo within Messages and navigate to the Manage tab.• Get detailed ratings and reviews on public and private schools in your desired area. Use custom search tools to find homes based on school ratings and boundaries.• Create a Renter Profile to grab the attention of potential landlords and property managers, and increase your chance of securing the perfect rental.• Only on Zillow: Get FREE access to foreclosure information across the nation. View foreclosure listings in your area, including pre-foreclosures, foreclosure auctions and bank-owned properties. • For Apple Watch users, receive instant notifications about nearby homes and saved searches directly on your watch. Use your watch to browse photos and home details, favorite a home or check the Zestimate® of a nearby home.• Find every type of property: single-family homes, apartments, townhomes, condos and more. • Search three ways: Search from where you are (via GPS locator), type in an address or draw a custom region on the map.• Filter searches by price, beds, baths, keywords and more.• Save your favorite homes and searches, then view them on Zillow.com or any mobile device.• Contact a local agent to tour a home.Note: Continued use of GPS running in the background can dramatically decrease battery life.",
    "In App Purchases": "No",
    "Name": "Zillow Real Estate - Homes for Sale & for Rent",
    "Number of Reviews (All Time)": "226615",
    "Number of Reviews (Current Versions) ": "159",
    "Overall Rating": "4",
    "Rank": "79",
    "Rating of Current Version": "4",
    "Release": "Mar 13, 2017",
    "Seller": "Information Not Available",
    "Size": " 135 MB",
    "Version": "10.3.5"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Reference",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "• Text translation: Translate between 103 languages by typing• Offline: Translate with no internet connection (52 languages)• Instant camera translation: Translate text in images instantly by just pointing your camera (30 languages)• Photos: Take or import photos for higher quality translations (37 languages)• Conversations: Translate bilingual conversations on the fly (32 languages)• Handwriting: Draw text characters instead of typing (93 languages)• Phrasebook: Star and save translated words and phrases for future reference (all languages)Permissions Notice• Microphone for speech translation• Camera for translating text via the camera• Photos for importing photos from your libraryTranslations between the following languages are supported:Afrikaans, Albanian, Amharic, Arabic, Armenian, Azerbaijani, Basque, Belarusian, Bengali, Bosnian, Bulgarian, Catalan, Cebuano, Chichewa, Chinese (Simplified), Chinese (Traditional), Corsican, Croatian, Czech, Danish, Dutch, English, Esperanto, Estonian, Filipino, Finnish, French, Frisian, Galician, Georgian, German, Greek, Gujarati, Haitian Creole, Hausa, Hawaiian, Hebrew, Hindi, Hmong, Hungarian, Icelandic, Igbo, Indonesian, Irish, Italian, Japanese, Javanese, Kannada, Kazakh, Khmer, Korean, Kurdish (Kurmanji), Kyrgyz, Lao, Latin, Latvian, Lithuanian, Luxembourgish, Macedonian, Malagasy, Malay, Malayalam, Maltese, Maori, Marathi, Mongolian, Myanmar (Burmese), Nepali, Norwegian, Pashto, Persian, Polish, Portuguese, Punjabi, Romanian, Russian, Samoan, Scots Gaelic, Serbian, Sesotho, Shona, Sindhi, Sinhala, Slovak, Slovenian, Somali, Spanish, Sundanese, Swahili, Swedish, Tajik, Tamil, Telugu, Thai, Turkish, Ukrainian, Urdu, Uzbek, Vietnamese, Welsh, Xhosa, Yiddish, Yoruba, Zulu",
    "In App Purchases": "No",
    "Name": "Google Translate",
    "Number of Reviews (All Time)": "26517",
    "Number of Reviews (Current Versions) ": "76",
    "Overall Rating": "3.5",
    "Rank": "80",
    "Rating of Current Version": "3.5",
    "Release": "Mar 02, 2017",
    "Seller": "Google, Inc.",
    "Size": " 64.5 MB",
    "Version": "5.6.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Social Networking",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Houseparty is the group video chat app that you’ve been missing in your life. It’s simple, synchronous and social. We empower people to have more frequent conversations with the people they care about most, meet new friends, and have fun together - wherever they are.Questions? Comments? Want to be our new BFF?hello@joinhouse.partyTwitter/Instagram: @houseparty",
    "In App Purchases": "No",
    "Name": "Houseparty - Group Video Chat",
    "Number of Reviews (All Time)": "2957",
    "Number of Reviews (Current Versions) ": "42",
    "Overall Rating": "4",
    "Rank": "81",
    "Rating of Current Version": "4",
    "Release": "Mar 14, 2017",
    "Seller": "Alexander Herzick",
    "Size": " 101 MB",
    "Version": "0.9.33"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Shopping",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "The eBay app is the easiest way to sell your items and manage your eBay experience, whenever and wherever you are! Set up a store page instantly with the barcode scanner, or create a custom page with important details. eBay notifications will let you know each time an auction ends, a customer messages or a user outbids you in an auction.With the eBay app you can:Bid and buy for incredible discounts:• Find deals on new items or purchase in bulk straight from the source.• Search the best deals on millions of items.• Price check with different sellers to get the best deal.• Browse eBay Deals to find featured discounts on top brands, all with free shipping.Sell your items in minutes:• List your used, new or duplicate items and start making extra money.• Auto-fill product details for even faster setup.Stay up to date with push notifications:• See when customers view, bid and watch your items.• Message buyers, with instant notifications when they respond.Discover new items with our improved browsing experience:• Use the new and improved eBay search to find new items• Get personalized recommendations based on your shopping habitsSave money on the products you love:• Get the things you love for the right price. eBay has everything from clothes to electronics to cars.• Buy your favorite items from our trusted sellers and save money.• Choose Buy It Now to get the items you need instantly.• Follow your favorite searches and sellers for quick access to the latest inventory.Track orders and get notifications:• Get customizable alerts about your eBay items and activity.• Track your packages.• Leave feedback for sellers.• Read and respond to eBay messages.• Report missing or un-shipped items.Use the barcode scanner to search and sell stuff faster:• Scan items to search eBay for deals.• Auto-create a listing with a simple scan to speed up the selling process.• Users scanning items will be able to find your listings faster than ever.Buy and sell in categories like:\\Clothing, Shoes & Accessories• Find your favorite brands at unbeatable prices• Collect sneakers, sandals, heels, running shoes and more• Buy designer fashion, jewelry, watches and more cheaper than in-storeeBay Motors• Buy new and used cars, trucks, motorcycles and more• Outfit your vehicle with decals, accessories and safety equipmentElectronics, Cell Phones & Accessories• Find the perfect phone for you and get the best price• Get cases, chargers, headphones and accessories for your new phone• Miss out on that Black Friday deal? Find amazing deals all year on TVs, laptops and moreHome & Garden• Home decor, furniture, paintings, pillows and more• Garden and patio furniture, tools and decorations• Fun DIY projects, and the materials to make themAnd so much more!eBay gets you top prices on the items you love, and the best value for the things you want to sell. Whether you shop or sell, eBay’s mobile app does it all. We’ll stop here so you can start shopping now.Download the eBay app and start your search today!_____________________________________KEEP IN TOUCHThanks to all our loyal fans for your support and suggestions! Your feedback is important to us. Please contact us with any questions by tweeting @askebay or join the discussion at www.ebay.com/iOS",
    "In App Purchases": "No",
    "Name": "eBay: Buy, Sell, Save! Electronics, Fashion & More",
    "Number of Reviews (All Time)": "258640",
    "Number of Reviews (Current Versions) ": "1239",
    "Overall Rating": "4",
    "Rank": "82",
    "Rating of Current Version": "4.5",
    "Release": "Feb 27, 2017",
    "Seller": "Information Not Available",
    "Size": " 115 MB",
    "Version": "5.7.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Food & Drink",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Delicious McDonald’s deals are now more fun, more accessible, and better than ever. Slide and scroll your way through our newly designed App to experience weekly deals on tasty food, like All Day Breakfast and McCafé coffee. You can find nearby McDonald’s restaurants and even explore our delicious menu. Mobile Ordering will also be available in select markets. Download and register today. It’s the best way to start saving big!Legal Stuff:Must be 13+. Data rates may apply. Prices and participation may vary. Offers available only at participating restaurants. Check www.mcdonalds.com/us/en/mobile_app.html for Terms and Conditions and more information. ©2017 McDonald’s",
    "In App Purchases": "No",
    "Name": "McDonald's",
    "Number of Reviews (All Time)": "3598",
    "Number of Reviews (Current Versions) ": "36",
    "Overall Rating": "2",
    "Rank": "83",
    "Rating of Current Version": "3",
    "Release": "Mar 13, 2017",
    "Seller": "McDonald's Usa, LLC",
    "Size": " 138 MB",
    "Version": "5.2.1"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Impress friends with amazing videos and photo video slideshows plus free popular music! Get featured & become famous with fun challenges for every talent - like dance, beauty, art, comedy, music, animals, lip-sync and more. 200 million people have already come to Flipagram to create half a billion amazing video stories and counting. Pick fun video effects and share your videos privately or with friends and fans across all your socials.Highlights:- Fast, simple video editor to combine photos, videos, effects and free music - Upload video clips and photos from your camera roll or shoot a flipagram directly with our in-app camera- Longer free music clips than any other app, so you can pick the perfect soundtrack for your videos- Adjust speed, add filters, reorder moments and zoom/crop your photos and videos- Use Vibes™ and Beatbrushes™, sound-activated filters and brushes that react to the beat and liven up your photos and videos- Meet and collaborate with creative, fun people and improve your skills- Get Featured, climb the Top Flipsters leaderboard, gain fans, get likes, and become a star- Celebrate friendships, relationships, birthdays, holidays, and all the people you love- Turn all your selfies and snaps into one video with your favorite song- Share instantly to all your favorite apps: Instagram, Facebook, Twitter, YouTube, Tumblr, Email, Text, Pinterest, FB Messenger, WhatsApp, KIK, or LINE.We’re looking for creative, high-quality Flipsters to feature and make famous.Show off your creativity & talent in challenges and  tag #featuremyflip to get noticed!Feedback? Email support@flipagram.com or tweet @FlipagramHelp.",
    "In App Purchases": "Yes",
    "Name": "Flipagram",
    "Number of Reviews (All Time)": "78722",
    "Number of Reviews (Current Versions) ": "175",
    "Overall Rating": "4.5",
    "Rank": "84",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "Flipagram, Inc.",
    "Size": " 79.7 MB",
    "Version": "8.15.0"
  },
  {
    "Age Restriction": "Rated 9+ ",
    "Category": "Games",
    "Compatibility": "iOS 8 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Golf Zero is a crazy mix of golf and platforming. Jump, bounce and slide your way around the levels trying everything you can to get the ball in the hole.There is nothing quite like a nice round of Golf. The freshly cut grass, the birds singing, the razor sharp saw blades, the mid-air bullet time shot as you dodge a bone crushing boulder.Work your way through the 40 normal levels or compete against the rest of the world in the speed run levels.",
    "In App Purchases": "Yes",
    "Name": "Golf Zero",
    "Number of Reviews (All Time)": "Information Not Available",
    "Number of Reviews (Current Versions) ": "51",
    "Overall Rating": "Information Not Available",
    "Rank": "85",
    "Rating of Current Version": "3",
    "Release": "Mar 13, 2017",
    "Seller": "Colin Lane Games AB",
    "Size": " 47.9 MB",
    "Version": "1.0"
  },
  {
    "Age Restriction": "Rated 9+ ",
    "Category": "Games",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Play sessions are quick and challenging in this challenging on-the-go action roguelike, featuring an infinite number of randomly generated levels and enemy patterns along with tons of weapons and other gear. Every round is guaranteed to be different as you fight your way through hordes of enemies, all to the steady beat of a crisp chiptune soundtrack.Features include:- Over 50 weapons along with numerous upgrades and variations to frame and movement modules, diversifying play styles across runs by changing the way you deal damage, move around and resist enemy attacks.- Dynamic level generation that guarantees that no two levels are the same. Areas can be narrow and favor close range combat or large and leaving you without cover, or anything in between. Adjust your approach to your surroundings to get as far as possible.- Controls are specifically designed to be simple and direct on a touch screen. Easy to learn, difficult to master.- Large variation on enemies and numerous bosses. The difficulty increases as the game progresses, making the enemies more aggressive and powerful.- Five original music tracks composed by chiptune artist Starving GOGO on genuine old school gaming hardware.- Minimalistic art style that mixes new with old, and renders everything easily readable due to vibrant colors and distinct shapes, even when the entire screen is covered with bullets.",
    "In App Purchases": "Yes",
    "Name": "Virexian",
    "Number of Reviews (All Time)": "30",
    "Number of Reviews (Current Versions) ": "30",
    "Overall Rating": "4.5",
    "Rank": "86",
    "Rating of Current Version": "4.5",
    "Release": "Mar 09, 2017",
    "Seller": "Felix Hard",
    "Size": " 18.4 MB",
    "Version": "1.2"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Productivity",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Create, edit, and collaborate with others on presentations from your iPod, iPhone, or iPad with the free Google Slides app. With Google Slides you can:* Create new presentations or edit any that were created on the web or on another device * Share presentations and work together with others in the same presentation at the same time* Open, edit, and save Microsoft PowerPoint files* Get stuff done anytime -- even without an internet connection* Add and rearrange slides, format text and shapes, and more* Present right from your device* Never worry about losing your work -- everything is automatically saved as you type",
    "In App Purchases": "No",
    "Name": "Google Slides",
    "Number of Reviews (All Time)": "8870",
    "Number of Reviews (Current Versions) ": "87",
    "Overall Rating": "4",
    "Rank": "87",
    "Rating of Current Version": "4.5",
    "Release": "Mar 10, 2017",
    "Seller": "Google, Inc.",
    "Size": " 242 MB",
    "Version": "1.2017.08204"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Social Networking",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Keep your friends close with Marco Polo.HOW IT WORKS1. You tap on the button and start talking2. Your friend listens and responds right away, or waits until it’s convenient3. You keep going and stay close!FEATURES** Feel close to those you love, no matter the distance** Talk all you want, no limits** Watch all you want, messages don’t disappear** Look and feel awesome with fab filters** Easy to use and easy on your data plan :)KEEP IN TOUCH ON THE GO** Sing happy birthday to your friend through the movie star filter** Say “good night” to your bf with the night vision filter** Send your friends a clip of your awesome vacation ** “Stretch out” a conversation if you’re busy or use it like a walkie-talkie for non-stop fun** Stay connected wherever you are: in the subway, waiting in line, at a concert…** Have a group conversation with your besties so everyone is kept in the lopBye-bye phone tag and awkward voicemails...and hello Marco Polo!CONTACT UShelp@marcopolo.mewww.marcopolo.meTERMS OF SERVICEhttp://www.getjoya.com/terms.htmlMade with love by Happy Bits Co",
    "In App Purchases": "No",
    "Name": "Marco Polo Video Walkie Talkie",
    "Number of Reviews (All Time)": "20923",
    "Number of Reviews (Current Versions) ": "220",
    "Overall Rating": "4.5",
    "Rank": "88",
    "Rating of Current Version": "4.5",
    "Release": "Mar 13, 2017",
    "Seller": "Joya Communications, Inc.",
    "Size": " 107 MB",
    "Version": "0.14.76"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "PicCollage has everything you need to create amazing collages with your photos. With our new layout and clean design, it’s even easier to unleash your creativity. Play with our seasonal stickers, backgrounds, and templates. Enjoy exclusive content from huge brands such as Hello Kitty, Packman, tokidoki and many more! We’ve improved our grid options and optimized our phone case templates so you can easily create a custom case for your phone.Use our powerful web search feature to find the perfect photos to add to your creations, add GIFs and stickers, share on social media, or print your collages at home with the touch of a button by connecting to your wireless printer! Join over 130 MILLION people who love to create using PicCollage.Awesome features:* New easy-to-use layout and clean design* Message stickers for PicCollage are available on iOS10* Optimized custom phone case templates to help you create awesome phone cases from your collages.* Fun face detection templates - Add party hats to your collages* Improved grid options* Import photos from your photo library, Instagram, Facebook and web image search.* Add text with lots of NEW fun fonts to choose from.* Simple touch gestures to rotate, resize, flick to delete.* Double-tap a photo to edit with Aviary effects, clip photo, adjust borders, copy/paste images, and \"flip\" stickers.* Just tap on the lower-left Frame icon, and swipe to select a frame to make an instant collage!* Clip photos by outlining the area you want with your finger.* An ever-growing library of backgrounds and stickers to choose from!* Choose Templates to create themed collages.* Share your creations to Instagram, Facebook, Twitter, SMS, email, and more.Recent updates include:* New FREE fonts, stickers, and backgrounds!* Fun seasonal sticker packs (Valentines incoming!)* New stickers from Hello Kitty, Tokidoki, and more* Seasonal backgrounds* Improved photo grid options* Increased scrap limit from 30 to 50* Magic dot feature: Make it easier to scale or rotate scraps with one finger! Just move the dot to arrange your photos, stickers or text scraps easily.* Print your collages by connecting AirPrint printer at home.* Powerful Bing web search to help you find relevant photos.* Make your creations into personalized products- phone cases, prints, magnet, greeting cards or posters!For teachers and parents, we have a \"School Settings\" feature that allows you to: * Disable \"Photos from Web\" * Disable all social features such as the Explore and Profile tabs * Disable ads... Perfect for young kids and classrooms!\"Whether you're 6 or 106, you'll find the free Pic Collage app an excellent way to dress up your photo collection and share your handiwork.\" - USA Today\"You can impress your mother, brag to your co-workers, and make your vacation look even better than it really was, all before you pack your suitcase to return home ... It could be the fastest way you'll ever find to organize a batch of photos ... Also makes gorgeous emails and can turn your image into a real postcard.\" - LA Times and NewsdayPicCollage(TM) and “Pic Collage” are trademarks of Cardinal Blue Software. For more detailed terms of service: http://cardinalblue.com/tos",
    "In App Purchases": "Yes",
    "Name": "PicCollage - Photo Collage Maker & Picture Editor",
    "Number of Reviews (All Time)": "119515",
    "Number of Reviews (Current Versions) ": "118",
    "Overall Rating": "5",
    "Rank": "89",
    "Rating of Current Version": "5",
    "Release": "Mar 14, 2017",
    "Seller": "Cardinal Blue Software, Inc",
    "Size": " 112 MB",
    "Version": "7.8.6"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Finance",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Do your banking right from your mobile deviceYou can manage your accounts, make deposits, find ATMs and more.Now it’s easy to do banking 24/7, right from your iPhone® or iPod touch®. To start, just enroll in Chase Online. To view the Chase Mobile app in Spanish language, please ensure your iPhone® or iPod touch® language setting is set to Spanish (Asegúrate de que tu iPhone® o iPod touch® esté configurado en el idioma español) MONITOR YOUR ACCOUNT     See account balances & transaction history    View your credit and debit card rewards statusPERFORM TRANSACTIONS• Pay bills and credit cards• Transfer money between Chase accounts• Make deposits with Chase QuickDepositSM• Send wire transfers• Make changes to pending transactions• Send and request money with Chase Person-to-Person QuickPaySMFIND LOCATIONS AND CONTACT CHASE• Find the nearest Chase branches & ATMs• Speak with a service representativeCUSTOMIZE ALERTS AND PUSH NOTIFICATIONS FOR:• Deposits• Account balance levels• ACH transfersMANAGE YOUR CHASE CREDIT CARD• View your credit card balance and activity• Make payments• View Ultimate Rewards information MANAGE YOUR CHASE LIQUID CARD• View your balance and transaction activity• Make a deposit with Chase QuickDeposit and reload your card• Transfer money to a Chase Liquid card ACCOLADES• #1 Overall Mobile Banking App in 2013 – Keynote Mobile Banker Scorecard• #1 App in 2013 US Mobile Banking Functionality Rankings – Forrester Research, Inc., April 25, 2013DisclosureSome features are available for eligible customers and accounts only.iPhone and iPod touch are registered trademarks of Apple, Inc.There is no charge from Chase, but message and data rates may apply. Such charges include those from your communications service provider. Delivery of alerts may be delayed for various reasons, including service outages affecting your phone, wireless or internet provider; technology failures; and system capacity limitations. Any time you review your balance, keep in mind it may not reflect all transactions including recent debit card transactions or checks you have written.A qualifying Chase transfer account is required to transfer funds via text. Phone Alerts are not available for Chase Basic CheckingSM account Deposit products provided by JPMorgan Chase Bank N.A. Member FDICEqual Opportunity Lender",
    "In App Purchases": "No",
    "Name": "Chase Mobile℠",
    "Number of Reviews (All Time)": "222835",
    "Number of Reviews (Current Versions) ": "284",
    "Overall Rating": "4.5",
    "Rank": "90",
    "Rating of Current Version": "2",
    "Release": "Mar 04, 2017",
    "Seller": "JPMorgan Chase Bank, NA",
    "Size": " 39.2 MB",
    "Version": "2.590"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Social Networking",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Use Hangouts to keep in touch. Message friends, start free video or voice calls, and hop on a conversation with one person or a group. Say more with photos, stickers, and emoji.• Include all your friends with group chats for up to 150 people.• Say more with status messages, photos, maps, emoji, stickers, and animated GIFs.• Turn any conversation into a free group video call with up to 10 friends.• Call any phone number in the world (and all calls to other Hangouts users are free!).• Connect your Google Voice account for phone number, SMS, and voicemail integration.• Keep in touch with friends across all your devices.• Message friends anytime, even if they're offline.• Manage mobile app remotely with Google for Work.Note: Mobile carrier and ISP charges may apply. Calls to Hangouts users are free, but other calls might be charged.",
    "In App Purchases": "No",
    "Name": "Hangouts",
    "Number of Reviews (All Time)": "35203",
    "Number of Reviews (Current Versions) ": "452",
    "Overall Rating": "4",
    "Rank": "91",
    "Rating of Current Version": "4.5",
    "Release": "Mar 02, 2017",
    "Seller": "Google, Inc.",
    "Size": " 94.9 MB",
    "Version": "14.6.0"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Health & Fitness",
    "Compatibility": "iOS 9.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Live a healthier, more active life with Fitbit, the world’s leading app for tracking all-day activity, workouts, sleep and more. Use the app on its own to track basic activity and runs on your phone, or connect with one of Fitbit’s many activity trackers and the Aria Wi-Fi Smart Scale to get a complete picture of your health—including steps, distance, calories burned, sleep, weight, and more.TRACK ACTIVITY: Accurately record your steps and distance with MobileTrack when you carry your phone. For all-day tracking of stats like calories burned, active minutes, and sleep, pair the app with a Fitbit tracker.RUN SMARTER: Enhance runs, walks and hikes by using MobileRun to track your pace, time and distance. You can also control your music, get voice cues and use your phone’s GPS to map your routes. (Continued use of GPS running in the background can dramatically decrease battery life.) RECORD WORKOUTS: Use your Fitbit tracker to track your exercise, then check the app to see your stats, their impact on your day, and how your performance is improving. MONITOR HEART RATE: Use a Fitbit tracker with PurePulse™ to analyze heart rate graphs in the app. Identify trends, manage stress and see the results of your workouts. Review resting heart rate trends to see when your fitness is improving.LOG FOOD FASTER: Easily log calories with our barcode scanner, calorie estimator, and expanded food database of more than 350,000 foods. See your meal history at a glance, and get nutritional insights.MEASURE HYDRATION: Quickly log your water intake to make sure you’re properly hydrated during workouts and throughout the day.SET & MANAGE GOALS: Create weight, nutrition and exercise goals, and start a food plan to stay on track. Then get a visual picture of your progress with colorful, easy-to-read charts and graphs. SEE HOW YOU SLEEP: Set sleep goals in the app, and use a Fitbit tracker to monitor how much time you spent awake, restless or peacefully sleeping. SHARE & COMPETE: Connect with friends and family by sharing stats, sending direct-messages, and competing on the leaderboard or in Fitbit Challenges.STAY MOTIVATED: Get a nudge in the right direction with notifications that pop up when you’re close to reaching a goal or have already met one. SYNC WIRELESSLY: Fitbit trackers sync your stats to computers and 200+ leading devices so you can continuously track your progress without needing to plug in.MANAGE WEIGHT: Connect wirelessly to the Aria Wi-Fi Smart Scale to seamlessly track your weight, BMI, lean mass and body fat percentages, and to see your weight trends over time. Learn more about Fitbit products and services at www.fitbit.com.",
    "In App Purchases": "No",
    "Name": "Fitbit",
    "Number of Reviews (All Time)": "87565",
    "Number of Reviews (Current Versions) ": "404",
    "Overall Rating": "4",
    "Rank": "92",
    "Rating of Current Version": "4",
    "Release": "Mar 07, 2017",
    "Seller": "Fitbit, Inc.",
    "Size": " 126 MB",
    "Version": "2.33.1"
  },
  {
    "Age Restriction": "Rated 9+ ",
    "Category": "Music",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Join in the fun! Sing your favorite top hits with artists like Jessie J, Jason Derulo, and Charlie Puth. Create Solo, Duet and Group videos with singers around the world. Make friends! Share your performances with 50M+ global audience. Get fans!Featured by Apple as Best New App.Features- Self-recording option with video- Sing like a star with audio effects. You've never sounded so good!- Share on our global platform - get discovered! - Duet with featured pop artists - Jessie J, Jason Derulo, Kylie Minogue, X Ambassadors, OMI, Carly Rae Jepsen, Charlie Puth, Silento, Nico & Vinz and many more New songs added every day.   Currently most popular on Sing! Karaoke:** 7 Years - Lukas Graham** One Call Away - Charlie Puth** We Don’t Talk Anymore - Charlie Puth** Love Yourself - Justin Bieber** All of Me - John Legend** Cheap Thrills - SIA** My Heart Will Go On - Celine Dion** Stressed Out - 21 Pilots** Ride - 21 Pilots** Lost Boy - Ruth B** Jar of Hearts - Christina Perri** Stitches - Shawn Mendes** Treat You Better - Shawn Mendes** Thinking Out Loud - Ed Sheeran** Let It Go - Idina Menzel (from Frozen by Disney)** Panda - Desiigner** This Is What You Came For - Calvin Harris, ft. Rihanna** Killing Me Softly - The Fugees** I Took a Pill in Ibiza - Mike Posner** Just Give Me a Reason - Pink, ft. Nate Ruess** Part of Your World (from Disney’s “The Little Mermaid”)** Like I’m Gonna Lose You - Meghan Trainor, ft. John Legend** I’m Yours - Jason MrazAnd many more from artists like Imagine Dragons, Miley Cyrus, Iggy and more!CONNECTING THE WORLD THROUGH MUSIC™ Find and follow your friends in Sing! Karaoke, and meet incredible singers from all over the world. Sing your heart out on Solo songs, or join up with others in Duets or Group songs. Keep up with your friends and favorite singers, and love and comment on performances to show your support. BE DISCOVERED!  GET FANS!Lots of talents get discovered through our Sing! Karaoke platform.  Show off your talent in front of 50M+ global audience and get fans!SOUND LIKE A STARSound amazing every time with Sing!’s voice enhancement technology. Use special voice filters to spice up your performance even more. Sing! is a supportive, joyful community where music-making at all levels is encouraged and appreciated. UNLIMITED PREMIUM SUBSCRIPTION- You can subscribe for unlimited access to our full song catalog- The subscriptions are weekly, monthly and annual*- You'll be able to sing unlimited Solos, Duets, and Group songs for the duration of your subscription- Payment will be charged to iTunes Account at confirmation of purchase- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package - Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase- No cancellation of the current subscription is allowed during active subscription period- You can read our privacy policy at www.smule.com/privacy- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication*Price are equal to the value that \"Apple's App Store Matrix\" determines is the equivalent of the subscription price in $USD.Questions? Write support@smule.com, find us on YouTube (www.youtube.com/smule), Twitter (@smule) or Google+!http://smule.comhttp://facebook.com/smulehttp://youtube.com/smulehttp://twitter.com/smulehttp://plus.google.com/+smule",
    "In App Purchases": "Yes",
    "Name": "Sing! Karaoke by Smule",
    "Number of Reviews (All Time)": "116773",
    "Number of Reviews (Current Versions) ": "535",
    "Overall Rating": "4.5",
    "Rank": "93",
    "Rating of Current Version": "4.5",
    "Release": "Mar 03, 2017",
    "Seller": "Smule",
    "Size": " 105 MB",
    "Version": "5.0.5"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Entertainment",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Stream and download popular movies and TV shows including Amazon exclusives like The Grand Tour, The Man in the High Castle, and Emmy award winner Tumble Leaf.  Customers in the US can also use this app to watch videos purchased or rented on Amazon, and videos included with a subscription paid for on Amazon such as HBO, SHOWTIME and STARZ.  App features:-Download movies and TV shows over Wi-Fi or cellular to watch anywhere, anytime.-Prime members in India can enjoy hundreds of top Bollywood and regional Indian hits like Sultan, Baar Baar Dekho, Kabali, Dhoom series and more!-View IMDB data about the actors, songs and trivia related to your videos during playback with X-Ray-Stream the first episode of select TV shows for free. First Episode Free videos include advertising before and during your videos-Watch on your Apple TV using AirPlay (requires Apple TV 2nd generation or later) (US only)-Access hundreds of thousands of movies and TV episodes you bought or rented including new release movies or the latest TV programming, with the ability to download titles for offline viewing (US only)-Watch on your TV using HDMI and your Apple Digital AV Adapter -Stream the first episode of selected TV shows for free. First Episode Free videos include advertising before and during your videos (US only)-Add videos to Your Watchlist from any Amazon Prime Video compatible device for later viewing -Start watching the next episode of the show you are currently streaming automatically with Auto Play.This app is designed for an unmodified version of iOS.",
    "In App Purchases": "No",
    "Name": "Amazon Prime Video",
    "Number of Reviews (All Time)": "40643",
    "Number of Reviews (Current Versions) ": "597",
    "Overall Rating": "4",
    "Rank": "94",
    "Rating of Current Version": "4",
    "Release": "Mar 02, 2017",
    "Seller": "AMZN Mobile LLC",
    "Size": " 69.3 MB",
    "Version": "4.2"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 7.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Easy rule but unlimited fun! Enjoy the world's most beloved puzzle game for FREE!This is a new Block puzzle game created by BitMango.“Block! Hexa Puzzle” is a tetris style exciting block puzzle game.Easy to play, and pleasurable game for all ages.Move blocks to fill up the square and collect block pieces to level up!HOW TO PLAY• Drag the blocks to move them.• Try to fit them all in the frame• Blocks can't be rotated.• Don't worry! No time limits!FEATURES• BLOCK PUZZLE- Smoth effect for block puzzle game!- Play easily and quickly.• TONS OF UNIQUE LEVELS- Over 300+ puzzles are unique and full of fun and amazing challenges!• EASY AND FUN PLAY- Easy to learn and fun to master gameplay• NO TIME LIMIT- Enjoy game for any time, anywhere and a short time.• NO WIFI? NO PROBLEM!- You can play offline in anytime.• STUNNING GRAPHICS- Soothing sounds and gorgeous visual effectsSUPPORT UNIVERSAL APP• Enjoy the game with various devices. (Phones and Tablets)NOTES• Block! Hexa Puzzle contains the ads like banner, interstitial, video and house ads.• Block! Hexa Puzzle is free to play, but you can purchase In-app items like  AD FREE and Hints.E-MAIL• contact@bitmango.comHOMEPAGE• http://www.bitmango.com/Like us on FACEBOOK• https://www.facebook.com/BitMangoGamesThank you.",
    "In App Purchases": "Yes",
    "Name": "Block! Hexa Puzzle",
    "Number of Reviews (All Time)": "23096",
    "Number of Reviews (Current Versions) ": "675",
    "Overall Rating": "4.5",
    "Rank": "95",
    "Rating of Current Version": "4.5",
    "Release": "Mar 08, 2017",
    "Seller": "BitMango Corporation",
    "Size": " 120 MB",
    "Version": "1.3.7"
  },
  {
    "Age Restriction": "Rated 12+ ",
    "Category": "Music",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Shazam is one of the world’s most popular apps, used by more than 100 million people each month to identify music, get song lyrics, and now to discover the music that artists discover themselves.\"Shazam is an app that feels like magic\" --Techradar.comIdentify music instantly and share in the thrill of music discovery with the artists you love. See what top artists like Calvin Harris, Pitbull, Meghan Trainor, Avicii, Jason Derulo, Wiz Khalifa and others are Shazaming. • New discoveries from artists you’ve Shazamed appear automatically• Follow new artists with a tap of a button and see what those artists are Shazaming• Stay up-to-date about new singles, albums, and videos from the artists you followKEY FEATURES• Enjoy music lyrics and YouTube videos• Preview songs with Apple Music and add them to Rdio and Spotify playlists *• Launch Pandora radio based on artists you discover *• With Auto Shazam we'll keep finding tunes for you even when you leave the appDISCOVER & BUY• Stay in the loop with Shazam’s real time charts• Quick links to Apple Music and the iTunes store• Connect Rdio or Spotify to play full tracks in Shazam• Check out recommended tracks to discover new music• Find out what’s popular in your town, your country and the world• Start an Apple Music radio station based on tracks you've ShazamedCONNECT & SHARE • See what your friends are Shazaming when you connect your Facebook account• Share your discoveries through Facebook, Twitter, WhatsApp, Pinterest, Google+ and more...SHAZAM FROM YOUR WATCH• Launch Shazam on your Apple Watch for the artist, song, and lyrics that unfold with the music• See your past Shazams at a glance with a simple swipe up• Use Handoff on Apple Watch and iPhone to buy the song on iTunes, watch videos, and much more• Turn on Auto Shazam and we’ll keep finding tunes for youMORE THAN MEETS THE EYE• Shazam visual recognition gets you more - tap the camera icon on iPhone to Shazam posters, magazines or books; anywhere where you see the Shazam camera logo• Visual recognition also works as a QR code reader• Buy tickets to see your favorite artists in concertUse Shazam as much as you like – it’s unlimited. Don’t want the advertising? Upgrade to Shazam EncoreOTHER INFO• Previewing and buying music requires the iTunes music store in your country• Continued use of GPS running in the background can dramatically decrease battery life• Facebook uses interest based advertising. More details: https://m.facebook.com/ads/ad_choices• Some features are location, device and app version dependent• Shazam may share collected location data for interest based advertising, allowing advertisers to infer interests and serve ads to users based on their activity and location over time.• For more information on Shazam’s privacy practices, please read the Privacy Policy, available at http://www.shazam.com/terms#privacy_policy.Any questions or feedback? Check out: https://support.shazam.com",
    "In App Purchases": "Yes",
    "Name": "Shazam - Discover music, artists, videos & lyrics",
    "Number of Reviews (All Time)": "401109",
    "Number of Reviews (Current Versions) ": "83",
    "Overall Rating": "3.5",
    "Rank": "96",
    "Rating of Current Version": "4.5",
    "Release": "Mar 13, 2017",
    "Seller": "Information Not Available",
    "Size": " 151 MB",
    "Version": "10.6.1"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Education",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Simply point your camera toward a math problem and Photomath will magically show the result with detailed step-by-step instructions.Photomath provides:∙ Camera calculator∙ Handwriting recognition (NEW)∙ Step-by-step instructions∙ Smart calculatorUse Photomath+ for more powerful features:∙ Complete step-by-step instructions∙ Colorful explanations∙ Extra math knowledgePhotomath supports arithmetics, integers, fractions, decimal numbers, roots, algebraic expressions, linear equations/inequations, quadratic equations/inequations, absolute equations/inequations, systems of  equations,  logarithms, trigonometry, exponential and logarithmic functions, derivatives and integrals.",
    "In App Purchases": "Yes",
    "Name": "Photomath - Camera Calculator",
    "Number of Reviews (All Time)": "15181",
    "Number of Reviews (Current Versions) ": "424",
    "Overall Rating": "4.5",
    "Rank": "97",
    "Rating of Current Version": "5",
    "Release": "Feb 24, 2017",
    "Seller": "Photomath, Inc.",
    "Size": " 31.7 MB",
    "Version": "3.0.5"
  },
  {
    "Age Restriction": "You must be at least 17 years old to download this app.",
    "Category": "Music",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "YouTube Music lets you watch and listen to a nearly endless catalog in an app designed for music discovery.Enjoy music for free with ads, or get YouTube Red.A YouTube built just for music• Every video starts a non-stop station• Personalized stations learn your tastes• See concert footage and live recordingsA nearly endless catalog• New artists, classic favorites, and everything in between• Classic live recordings that span decades• Official music videos, playlists, remixes, covers, and moreAmplify your experience with YouTube Red• Enjoy your music without ads• The music keeps playing even when your screen is off• Take your music on-the-go with offline mixtapeGet 1 month of YouTube Red for free. Existing YouTube Red or Google Play Music members and users of either service who have already received this 30 day trial are not eligible. Monthly charges apply for YouTube Red membership outside of trial periods.Monthly price: $12.99 USD / $14.99 AUD / $15.99 NZD / $139 pesos MXN / $9.89 USD (KR only)YouTube paid service terms: https://www.youtube.com/t/terms_paidservicePrivacy policy: https://www.google.com/policies/privacy",
    "In App Purchases": "Yes",
    "Name": "YouTube Music",
    "Number of Reviews (All Time)": "6718",
    "Number of Reviews (Current Versions) ": "42",
    "Overall Rating": "3.5",
    "Rank": "98",
    "Rating of Current Version": "3.5",
    "Release": "Mar 09, 2017",
    "Seller": "Google, Inc.",
    "Size": " 118 MB",
    "Version": "1.68"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Photo & Video",
    "Compatibility": "iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Boomerang from Instagram makes everyday moments fun and unexpected. Create captivating mini videos that loop back and forth, then share them with your friends.Find something (or someone!) that's moving, or create a video selfie by switching to the front-facing camera. There’s just one button. Tap it once and Boomerang does the rest: shoots a burst of 10 photos and turns them into a delightful mini video. Share it on Facebook and Instagram right from the app, or save your video to your camera roll to share later. FEATURES* Take mini videos of your life and yourself using the front and back facing camera. * Download and start capturing immediately. No sign up or account required.* There's just one button! The app takes 10 photos and stitches them together, speeds up the video and smooths out any bumps, then loops it back and forth.* Share your videos on Instagram and Facebook right from the app, or share them later from your camera roll.",
    "In App Purchases": "No",
    "Name": "Boomerang from Instagram",
    "Number of Reviews (All Time)": "2223",
    "Number of Reviews (Current Versions) ": "369",
    "Overall Rating": "3.5",
    "Rank": "99",
    "Rating of Current Version": "3.5",
    "Release": "Nov 09, 2016",
    "Seller": "Instagram, Inc.",
    "Size": " 15.7 MB",
    "Version": "1.4.2"
  },
  {
    "Age Restriction": "Rated 4+",
    "Category": "Games",
    "Compatibility": "iOS 6.0 or later. Compatible with iPhone, iPad, and iPod touch.",
    "Description": "Play against other people online! Can you become the longest player of the day?If your head touches another player, you will explode and die. But if other players run into YOU, then THEY will explode and you can eat their remains!In slither.io, even if you're tiny, you have a chance to win. If you're skilled or lucky, you can swerve in front of a much larger player to defeat them!Download now and start slithering!",
    "In App Purchases": "Yes",
    "Name": "slither.io",
    "Number of Reviews (All Time)": "105060",
    "Number of Reviews (Current Versions) ": "9061",
    "Overall Rating": "3.5",
    "Rank": "100",
    "Rating of Current Version": "4",
    "Release": "Oct 06, 2016",
    "Seller": "Steve Howse",
    "Size": " 32.5 MB",
    "Version": "1.4.2"
  }
]